ep_list = [
    {
        "id": 4334,
        "code": "09.04.03.",
        "name": "Мобильные и сетевые технологии"
    },
    {
        "id": 4332,
        "code": "09.04.01.",
        "name": "Компьютерные системы и технологии"
    },
    {
        "id": 1839,
        "code": "12.04.02.",
        "name": "Прикладная оптика"
    },
    {
        "id": 3913,
        "code": "16.03.01.",
        "name": "Нанофотоника и квантовая оптика"
    },
    {
        "id": 4340,
        "code": "11.04.02.",
        "name": "Интеллектуальные технологии в телекоммуникациях"
    },
    {
        "id": 3926,
        "code": "27.03.05.",
        "name": "Управление технологическими инновациями"
    },
    {
        "id": 1981,
        "code": "38.03.05.",
        "name": "Бизнес-информатика"
    },
    {
        "id": 4341,
        "code": "11.04.03.",
        "name": "Проектирование киберфизических систем защиты информации"
    },
    {
        "id": 3588,
        "code": "09.03.02.",
        "name": "Программирование и интернет-технологии"
    },
    {
        "id": 1807,
        "code": "12.03.01.",
        "name": "Технология приборостроения"
    },
    {
        "id": 3900,
        "code": "12.03.01.",
        "name": "Цифровые технологии в приборостроении"
    },
    {
        "id": 3899,
        "code": "11.03.03.",
        "name": "Конструирование и технология электронных средств"
    },
    {
        "id": 3108,
        "code": "01.03.02.",
        "name": "Информатика и программирование"
    },
    {
        "id": 4071,
        "code": "09.03.03.",
        "name": "Мобильные и сетевые технологии"
    },
    {
        "id": 3910,
        "code": "15.03.06.",
        "name": "Интеллектуальная робототехника"
    },
    {
        "id": 1951,
        "code": "27.03.04.",
        "name": "Управление в технических системах"
    },
    {
        "id": 1868,
        "code": "15.03.04.",
        "name": "Автоматизация технологичеcких процессов и производств (пищевой промышленности)"
    },
    {
        "id": 1945,
        "code": "24.03.02.",
        "name": "Управление движением и навигация"
    },
    {
        "id": 4348,
        "code": "16.04.01.",
        "name": "Светодиодные технологии и оптоэлектроника"
    },
    {
        "id": 3789,
        "code": "09.04.04.",
        "name": "Технологии промышленного программирования"
    },
    {
        "id": 3914,
        "code": "16.03.03.",
        "name": "Низкотемпературная техника и энергетика"
    },
    {
        "id": 4351,
        "code": "16.04.03.",
        "name": "Техника и технологии сжиженного природного газа"
    },
    {
        "id": 4347,
        "code": "15.04.06.",
        "name": "Робототехника"
    },
    {
        "id": 1941,
        "code": "23.03.03.",
        "name": "Сервис транспортных и технологических машин и оборудования (холодильные установки, оборудование и системы кондиционирования)"
    },
    {
        "id": 4428,
        "code": "18.04.02.",
        "name": "Биоэкономика и управление ресурсами"
    },
    {
        "id": 3929,
        "code": "27.04.08.",
        "name": "Управление интеллектуальной собственностью"
    },
    {
        "id": 4339,
        "code": "09.04.04.",
        "name": "Системное и прикладное программное обеспечение"
    },
    {
        "id": 3782,
        "code": "27.04.03.",
        "name": "Управление мобильными киберфизическими системами"
    },
    {
        "id": 3804,
        "code": "19.04.01.",
        "name": "Биотехнология продуктов функционального назначения"
    },
    {
        "id": 4490,
        "code": "02.04.03.",
        "name": "Аналитика данных"
    },
    {
        "id": 3893,
        "code": "09.03.04.",
        "name": "Нейротехнологии и программирование"
    },
    {
        "id": 4308,
        "code": "09.03.02.",
        "name": "Мобильные сетевые технологии"
    },
    {
        "id": 2016,
        "code": "45.03.04",
        "name": "Интеллектуальные системы в гуманитарной сфере"
    },
    {
        "id": 3628,
        "code": "45.03.04.",
        "name": "Сетевые интеллектуальные системы в гуманитарной сфере"
    },
    {
        "id": 3888,
        "code": "09.03.01.",
        "name": "Вычислительные системы и сети"
    },
    {
        "id": 4268,
        "code": "01.04.02.",
        "name": "Разработка программного обеспечения / Software Engineering"
    },
    {
        "id": 4367,
        "code": "09.03.01.",
        "name": "Компьютерные системы и технологии"
    },
    {
        "id": 3892,
        "code": "09.03.04.",
        "name": "Компьютерные технологии в дизайне"
    },
    {
        "id": 3591,
        "code": "09.03.04.",
        "name": "Системное и прикладное программное обеспечение"
    },
    {
        "id": 3894,
        "code": "10.03.01.",
        "name": "Технологии защиты информации"
    },
    {
        "id": 3895,
        "code": "11.03.02.",
        "name": "Инфокоммуникационные системы"
    },
    {
        "id": 4368,
        "code": "11.03.03.",
        "name": "Технологии защиты информации"
    },
    {
        "id": 4388,
        "code": "12.03.01.",
        "name": "Цифровое производство"
    },
    {
        "id": 4392,
        "code": "13.03.02.",
        "name": "Цифровые системы управления"
    },
    {
        "id": 4074,
        "code": "15.03.04.",
        "name": "Цифровое производство"
    },
    {
        "id": 4393,
        "code": "15.03.06.",
        "name": "Робототехника"
    },
    {
        "id": 4397,
        "code": "23.03.03.",
        "name": "Технологии защиты информации"
    },
    {
        "id": 4398,
        "code": "24.03.02.",
        "name": "Цифровые системы управления"
    },
    {
        "id": 4399,
        "code": "27.03.04.",
        "name": "Цифровые системы управления"
    },
    {
        "id": 4369,
        "code": "44.03.04.",
        "name": "Компьютерные технологии в дизайне"
    },
    {
        "id": 1765,
        "code": "09.04.02.",
        "name": "Речевые информационные системы"
    },
    {
        "id": 4338,
        "code": "09.04.04.",
        "name": "Мультимедиа-технологии, дизайн и юзабилити"
    },
    {
        "id": 4330,
        "code": "01.04.02.",
        "name": "Программирование и искусственный интеллект"
    },
    {
        "id": 3908,
        "code": "14.03.01.",
        "name": "Информационные технологии в энергетике"
    },
    {
        "id": 3912,
        "code": "16.03.01.",
        "name": "Приборостроение в нефтехимии"
    },
    {
        "id": 3915,
        "code": "18.03.02.",
        "name": "Зеленые технологии и ресурсоэффективность"
    },
    {
        "id": 1967,
        "code": "38.03.01.",
        "name": "Макроэкономическое планирование и прогнозирование"
    },
    {
        "id": 1970,
        "code": "38.03.01.",
        "name": "Экономика предприятий и организаций"
    },
    {
        "id": 1818,
        "code": "12.03.03.",
        "name": "Физика наноструктур"
    },
    {
        "id": 4702,
        "code": "27.04.05.",
        "name": "Инвестиции в технологическом секторе"
    },
    {
        "id": 4701,
        "code": "27.04.05.",
        "name": "Цифровая трансформация организаций"
    },
    {
        "id": 4704,
        "code": "38.04.05.",
        "name": "Цифровая трансформация организаций"
    },
    {
        "id": 1977,
        "code": "38.03.02.",
        "name": "Управление технологическими инновациями"
    },
    {
        "id": 4448,
        "code": "45.04.04.",
        "name": "Анализ культурных данных и визуализация/ Data, Culture and Visualization"
    },
    {
        "id": 2003,
        "code": "38.05.02.",
        "name": "Таможенный менеджмент"
    },
    {
        "id": 4698,
        "code": "19.04.01.",
        "name": "Инфохимия / Infochemistry"
    },
    {
        "id": 3848,
        "code": "18.04.02.",
        "name": "Промышленная экология и чистое производство"
    },
    {
        "id": 3428,
        "code": "12.04.01.",
        "name": "Системы и технологии цифрового производства"
    },
    {
        "id": 4692,
        "code": "24.04.01.",
        "name": "Системы и технологии цифрового производства"
    },
    {
        "id": 4086,
        "code": "16.04.01.",
        "name": "Радиочастотные системы и устройства"
    },
    {
        "id": 4360,
        "code": "27.04.04.",
        "name": "Цифровые системы управления"
    },
    {
        "id": 1979,
        "code": "38.03.02.",
        "name": "Финансовый менеджмент"
    },
    {
        "id": 4080,
        "code": "09.04.04.",
        "name": "Нейротехнологии и программная инженерия"
    },
    {
        "id": 4362,
        "code": "27.04.05.",
        "name": "Инновационное предпринимательство"
    },
    {
        "id": 4509,
        "code": "09.02.07.",
        "name": "Информационные системы и программирование"
    },
    {
        "id": 4335,
        "code": "09.04.03.",
        "name": "Цифровые технологии умного города"
    },
    {
        "id": 4078,
        "code": "09.04.03.",
        "name": "Информационные системы бизнеса"
    },
    {
        "id": 1811,
        "code": "12.03.02.",
        "name": "Прикладная и компьютерная оптика"
    },
    {
        "id": 4112,
        "code": "12.03.03.",
        "name": "Квантовые технологии в коммуникациях"
    },
    {
        "id": 3594,
        "code": "12.03.03.",
        "name": "Фемтотехнологии фотоники и оптоинформатики"
    },
    {
        "id": 3906,
        "code": "12.03.05.",
        "name": "Лазерные технологии"
    },
    {
        "id": 3595,
        "code": "12.03.05.",
        "name": "Лазеры для информационно-коммуникационных систем"
    },
    {
        "id": 1856,
        "code": "12.05.01.",
        "name": "Оптико-электронные информационно-измерительные приборы и системы"
    },
    {
        "id": 3188,
        "code": "16.03.01.",
        "name": "Световая инженерия"
    },
    {
        "id": 3916,
        "code": "18.03.02.",
        "name": "Экологический инжиниринг"
    },
    {
        "id": 3917,
        "code": "19.03.01.",
        "name": "Биоинженерия"
    },
    {
        "id": 1916,
        "code": "19.03.01.",
        "name": "Пищевая биотехнология"
    },
    {
        "id": 4104,
        "code": "19.03.02.",
        "name": "Технологии напитков, хлеба и кондитерских изделий"
    },
    {
        "id": 4076,
        "code": "19.03.03.",
        "name": "Молекулярное питание и пищевые технологии"
    },
    {
        "id": 4079,
        "code": "23.03.03.",
        "name": "Технологии транспортирования углеводородных энергоносителей"
    },
    {
        "id": 4109,
        "code": "38.03.01.",
        "name": "Экономика высокотехнологичной компании"
    },
    {
        "id": 4110,
        "code": "45.03.04.",
        "name": "Иностранные языки и информационные технологии / Humanities and IT"
    },
    {
        "id": 1778,
        "code": "10.04.01",
        "name": "Информационная безопасность"
    },
    {
        "id": 1954,
        "code": "27.04.02",
        "name": "Управление качеством"
    },
    {
        "id": 4337,
        "code": "09.04.04.",
        "name": "Веб-технологии"
    },
    {
        "id": 1787,
        "code": "11.03.02.",
        "name": "Интеллектуальные инфокоммуникационные системы"
    },
    {
        "id": 3897,
        "code": "11.03.02.",
        "name": "Облачные технологии"
    },
    {
        "id": 4329,
        "code": "01.04.02.",
        "name": "Большие данные и машинное обучение"
    },
    {
        "id": 1816,
        "code": "12.03.03.",
        "name": "Наноматериалы и нанотехнологии фотоники и оптоинформатики"
    },
    {
        "id": 1790,
        "code": "11.03.02.",
        "name": "Программно-защищенные инфокоммуникации"
    },
    {
        "id": 1865,
        "code": "15.03.02.",
        "name": "Машины и аппараты пищевых производств"
    },
    {
        "id": 1866,
        "code": "15.03.02.",
        "name": "Машины и оборудование биотехнологий"
    },
    {
        "id": 3901,
        "code": "12.03.02.",
        "name": "Оптико-цифровые системы"
    },
    {
        "id": 1809,
        "code": "12.03.02.",
        "name": "Оптико-электронные приборы и системы"
    },
    {
        "id": 3902,
        "code": "12.03.03.",
        "name": "Компьютерная фотоника и обработка изображений"
    },
    {
        "id": 3918,
        "code": "19.03.02.",
        "name": "Алкогольные и безалкогольные напитки"
    },
    {
        "id": 3920,
        "code": "19.03.02.",
        "name": "Хлебопекарное и кондитерское производство"
    },
    {
        "id": 1751,
        "code": "09.04.01.",
        "name": "Вычислительные системы и сети"
    },
    {
        "id": 4356,
        "code": "23.04.03.",
        "name": "Функциональная безопасность беспилотных транспортных средств"
    },
    {
        "id": 1921,
        "code": "19.03.03.",
        "name": "Технология молока и молочных продуктов"
    },
    {
        "id": 4389,
        "code": "12.03.02.",
        "name": "Прикладная оптика"
    },
    {
        "id": 4390,
        "code": "12.03.03.",
        "name": "Фотоника и оптоинформатика"
    },
    {
        "id": 4391,
        "code": "12.03.05.",
        "name": "Лазерная фотоника и оптоэлектроника"
    },
    {
        "id": 3907,
        "code": "13.03.02.",
        "name": "Цифровой электропривод робототехнических комплексов"
    },
    {
        "id": 4395,
        "code": "16.03.01.",
        "name": "Лазерная фотоника и оптоэлектроника"
    },
    {
        "id": 4394,
        "code": "16.03.01.",
        "name": "Прикладная оптика"
    },
    {
        "id": 1882,
        "code": "16.03.01.",
        "name": "Техническая физика"
    },
    {
        "id": 4396,
        "code": "18.03.02.",
        "name": "Биоинженерия"
    },
    {
        "id": 1915,
        "code": "19.03.01.",
        "name": "Биотехнология"
    },
    {
        "id": 3921,
        "code": "19.03.03.",
        "name": "Инновационные технологии в молочной промышленности"
    },
    {
        "id": 3008,
        "code": "27.04.05.",
        "name": "Инновационный маркетинг"
    },
    {
        "id": 4694,
        "code": "12.04.04.",
        "name": "Биоинженерия и биотехнические системы"
    },
    {
        "id": 1858,
        "code": "13.03.02.",
        "name": "Электропривод и автоматика"
    },
    {
        "id": 1871,
        "code": "15.03.06.",
        "name": "Мехатроника"
    },
    {
        "id": 3779,
        "code": "19.04.01.",
        "name": "Пищевая биотехнология"
    },
    {
        "id": 4107,
        "code": "19.04.03",
        "name": "Продукты питания на белковой основе"
    },
    {
        "id": 4355,
        "code": "19.04.01.",
        "name": "Биотехнология напитков, хлеба и кондитерских изделий"
    },
    {
        "id": 4188,
        "code": "27.04.05.",
        "name": "Научная коммуникация"
    },
    {
        "id": 1922,
        "code": "19.03.03.",
        "name": "Технология мяса и мясных продуктов"
    },
    {
        "id": 3811,
        "code": "19.04.02.",
        "name": "Качество и безопасность пищевых продуктов"
    },
    {
        "id": 4343,
        "code": "12.04.03.",
        "name": "Квантовые коммуникации и фемтотехнологии"
    },
    {
        "id": 3669,
        "code": "19.03.02.",
        "name": "Технология бродильных производств и виноделия"
    },
    {
        "id": 1919,
        "code": "19.03.02.",
        "name": "Технология хлеба, кондитерских и макаронных изделий"
    },
    {
        "id": 1972,
        "code": "38.03.02.",
        "name": "Логистика"
    },
    {
        "id": 1976,
        "code": "38.03.02.",
        "name": "Управление проектом"
    },
    {
        "id": 4100,
        "code": "27.04.05.",
        "name": "Искусство и наука / Art & Science"
    },
    {
        "id": 4728,
        "code": "12.04.03.",
        "name": "Квантовые и гибридные материалы"
    },
    {
        "id": 4689,
        "code": "07.04.04.",
        "name": "Городское планирование и городской дизайн"
    },
    {
        "id": 4568,
        "code": "27.04.07.",
        "name": "Урбанистика"
    },
    {
        "id": 4670,
        "code": "12.03.04.",
        "name": "Биоинженерия"
    },
    {
        "id": 4708,
        "code": "12.05.01.",
        "name": "Оптико-электронные приборы и системы"
    },
    {
        "id": 4668,
        "code": "16.03.01.",
        "name": "Прикладная и теоретическая физика"
    },
    {
        "id": 4084,
        "code": "16.04.01.",
        "name": "Нанофотоника и метаматериалы"
    },
    {
        "id": 4083,
        "code": "12.04.05.",
        "name": "Лазерные технологии"
    },
    {
        "id": 4691,
        "code": "09.04.02.",
        "name": "Цифровые геотехнологии"
    },
    {
        "id": 4366,
        "code": "11.03.02.",
        "name": "Программирование в инфокоммуникационных системах"
    },
    {
        "id": 2015,
        "code": "44.03.04.",
        "name": "Компьютерная графика и дизайн"
    },
    {
        "id": 4695,
        "code": "16.04.01.",
        "name": "Световодная фотоника и программируемая электроника"
    },
    {
        "id": 4690,
        "code": "09.04.02.",
        "name": "Программирование и интернет-технологии"
    },
    {
        "id": 2829,
        "code": "09.04.02.",
        "name": "Разработка корпоративных информационных систем"
    },
    {
        "id": 4688,
        "code": "01.04.02.",
        "name": "Математическое и компьютерное моделирование"
    },
    {
        "id": 3903,
        "code": "12.03.03.",
        "name": "Оптические и квантовые технологии в коммуникациях"
    },
    {
        "id": 4070,
        "code": "01.04.02.",
        "name": "Биоинформатика и системная биология"
    },
    {
        "id": 2448,
        "code": "09.04.01.",
        "name": "Программное обеспечение интеллектуальных систем и технологий"
    },
    {
        "id": 4336,
        "code": "09.04.03.",
        "name": "Технологии разработки компьютерных игр"
    },
    {
        "id": 3772,
        "code": "09.04.04.",
        "name": "Программное обеспечение радиоэлектронных систем"
    },
    {
        "id": 4030,
        "code": "11.04.02.",
        "name": "Финансовые технологии больших данных"
    },
    {
        "id": 4364,
        "code": "12.04.02.",
        "name": "Оптико-цифровые системы"
    },
    {
        "id": 2868,
        "code": "12.04.03.",
        "name": "Физика и технология наноструктур"
    },
    {
        "id": 4345,
        "code": "13.04.02.",
        "name": "Электроинженерия"
    },
    {
        "id": 1875,
        "code": "15.04.02.",
        "name": "Процессы и аппараты пищевых производств"
    },
    {
        "id": 1877,
        "code": "15.04.04.",
        "name": "Автоматизация технологических процессов и производств пищевой промышленности"
    },
    {
        "id": 4346,
        "code": "15.04.04.",
        "name": "Индустриальные киберфизические системы"
    },
    {
        "id": 4349,
        "code": "16.04.01.",
        "name": "Материалы фотоники"
    },
    {
        "id": 4350,
        "code": "16.04.01.",
        "name": "Физика полупроводников"
    },
    {
        "id": 4709,
        "code": "16.04.03.",
        "name": "Информационные технологии в теплофизике"
    },
    {
        "id": 4352,
        "code": "16.04.03.",
        "name": "Проектирование тепломассообменного оборудования и систем жизнеобеспечения"
    },
    {
        "id": 1902,
        "code": "16.04.03.",
        "name": "Промышленные холодильные системы и тепловые насосы"
    },
    {
        "id": 4409,
        "code": "16.04.03.",
        "name": "Твердотельные системы охлаждения"
    },
    {
        "id": 4696,
        "code": "18.04.02.",
        "name": "Химия прикладных материалов / Chemistry of Applied Materials"
    },
    {
        "id": 4697,
        "code": "19.04.01.",
        "name": "Молекулярная биология и биотехнология / Molecular Biology and Biotechnology"
    },
    {
        "id": 4354,
        "code": "19.04.01.",
        "name": "Низкотемпературная и глубокая обработка биологических систем"
    },
    {
        "id": 4410,
        "code": "20.04.01.",
        "name": "Информационные системы для экологической и техносферной безопасности"
    },
    {
        "id": 1948,
        "code": "24.04.02",
        "name": "Системы управления движением и навигация"
    },
    {
        "id": 3784,
        "code": "27.04.01.",
        "name": "Стандартизация и метрология в высокотехнологичном секторе экономики"
    },
    {
        "id": 4699,
        "code": "27.04.03.",
        "name": "Системы управления движением и навигация"
    },
    {
        "id": 4700,
        "code": "27.04.03.",
        "name": "Цифровые системы управления"
    },
    {
        "id": 4363,
        "code": "27.04.05.",
        "name": "Наука и технологии в обществе"
    },
    {
        "id": 4703,
        "code": "27.04.07.",
        "name": "Световой дизайн"
    },
    {
        "id": 4528,
        "code": "38.04.01.",
        "name": "Инновационная экономика и отраслевое регулирование"
    },
    {
        "id": 1935,
        "code": "19.04.03.",
        "name": "Микробиологические процессы в пищевых технологиях"
    },
    {
        "id": 1746,
        "code": "09.03.03.",
        "name": "Прикладная информатика в экономике"
    },
    {
        "id": 4768,
        "code": "45.03.04",
        "name": "Иностранные языки и информационные технологии"
    },
    {
        "id": 3269,
        "code": "27.04.03",
        "name": "Научная коммуникация"
    },
    {
        "id": 1891,
        "code": "16.03.03.",
        "name": "Холодильная техника и технологии"
    },
    {
        "id": 1910,
        "code": "18.03.02.",
        "name": "Охрана окружающей среды и рациональное использование природных ресурсов"
    },
    {
        "id": 1918,
        "code": "19.03.02.",
        "name": "Технология консервов и пищеконцентратов"
    },
    {
        "id": 2128,
        "code": "19.03.03.",
        "name": "Технология рыбы и рыбных продуктов"
    },
    {
        "id": 1973,
        "code": "38.03.02.",
        "name": "Производственный менеджмент"
    },
    {
        "id": 1975,
        "code": "38.03.02.",
        "name": "Управление малым бизнесом"
    },
    {
        "id": 1980,
        "code": "38.03.02.",
        "name": "Финансовый менеджмент: организация и управление финансами на предприятии отрасли"
    },
    {
        "id": 1730,
        "code": "01.03.02.",
        "name": "Математические модели и алгоритмы в разработке программного обеспечения"
    },
    {
        "id": 1731,
        "code": "01.03.02.",
        "name": "Математическое моделирование"
    },
    {
        "id": 1737,
        "code": "09.03.01.",
        "name": "Вычислительные машины, комплексы, системы и сети"
    },
    {
        "id": 3590,
        "code": "09.03.03.",
        "name": "Корпоративные информационные системы"
    },
    {
        "id": 3891,
        "code": "09.03.04.",
        "name": "Программно-информационные системы"
    },
    {
        "id": 1776,
        "code": "10.03.01.",
        "name": "Математическое моделирование и прогнозирование информационных угроз"
    },
    {
        "id": 1777,
        "code": "10.03.01.",
        "name": "Организация и технология защиты информации"
    },
    {
        "id": 1815,
        "code": "12.03.03.",
        "name": "Компьютерная фотоника"
    },
    {
        "id": 3904,
        "code": "12.03.03.",
        "name": "Компьютерное проектирование приборов фотоники"
    },
    {
        "id": 1817,
        "code": "12.03.03.",
        "name": "Оптические и квантовые технологии передачи, записи и обработки информации"
    },
    {
        "id": 3596,
        "code": "12.03.05.",
        "name": "Лазерные микро- и нанотехнологии"
    },
    {
        "id": 3909,
        "code": "15.03.04.",
        "name": "Управление в биотехнологических системах"
    },
    {
        "id": 1883,
        "code": "16.03.01.",
        "name": "Лазерные технологии"
    },
    {
        "id": 3925,
        "code": "27.03.05.",
        "name": "Инноватика"
    },
    {
        "id": 3604,
        "code": "38.03.05.",
        "name": "Информационные технологии в бизнесе"
    },
    {
        "id": 0,
        "code": "00.00.00",
        "name": "000000"
    },
    {
        "id": 4342,
        "code": "12.04.02.",
        "name": "Световой дизайн"
    },
    {
        "id": 3923,
        "code": "23.03.03.",
        "name": "Мобильные и стационарные холодильные системы"
    },
    {
        "id": 3769,
        "code": "01.04.02.",
        "name": "Машинное обучение и анализ данных"
    },
    {
        "id": 4081,
        "code": "12.04.01.",
        "name": "Биоинженерия и биотехнические системы"
    },
    {
        "id": 4344,
        "code": "12.04.03.",
        "name": "Квантовые материалы"
    },
    {
        "id": 4087,
        "code": "16.04.01.",
        "name": "Световодная фотоника"
    },
    {
        "id": 3778,
        "code": "18.04.02.",
        "name": "Химический наноинжиниринг материалов"
    },
    {
        "id": 3781,
        "code": "19.04.01.",
        "name": "Молекулярная робототехника и биосенсорные системы"
    },
    {
        "id": 3649,
        "code": "01.04.02.",
        "name": "Вычислительная биомедицина"
    },
    {
        "id": 1733,
        "code": "01.04.02.",
        "name": "Математическое моделирование"
    },
    {
        "id": 3786,
        "code": "01.04.02.",
        "name": "Технологии разработки программного обеспечения"
    },
    {
        "id": 1756,
        "code": "09.04.01.",
        "name": "Системное администрирование аппаратно-программных комплексов и сетей"
    },
    {
        "id": 2809,
        "code": "09.04.02.",
        "name": "Дизайн человеко-компьютерных систем"
    },
    {
        "id": 4094,
        "code": "09.04.02.",
        "name": "Когнитивные технологии и квантовый интеллект"
    },
    {
        "id": 4408,
        "code": "09.04.02.",
        "name": "Цифровое здравоохранение"
    },
    {
        "id": 1802,
        "code": "11.04.03.",
        "name": "Проектирование электронных средств в защищенной интегрированной среде"
    },
    {
        "id": 4208,
        "code": "12.04.02.",
        "name": "Оптико-цифровые системы и технологии"
    },
    {
        "id": 2468,
        "code": "12.04.03.",
        "name": "Физика и технология наноструктур"
    },
    {
        "id": 1879,
        "code": "15.04.06.",
        "name": "Интеллектуальные технологии в робототехнике"
    },
    {
        "id": 2748,
        "code": "16.04.01.",
        "name": "Информационные технологии в теплофизике"
    },
    {
        "id": 3799,
        "code": "16.04.03.",
        "name": "Технологии низкотемпературной энергетики"
    },
    {
        "id": 4357,
        "code": "24.04.01.",
        "name": "Технологии интроскопии"
    },
    {
        "id": 3797,
        "code": "27.04.02.",
        "name": "Аудит и сертификация качества"
    },
    {
        "id": 4358,
        "code": "27.04.03.",
        "name": "Управление киберфизическими системами"
    },
    {
        "id": 2910,
        "code": "27.04.05.",
        "name": "Инновационные транспортные технологии"
    },
    {
        "id": 4099,
        "code": "27.04.05.",
        "name": "Стратегическое управление инновациями"
    },
    {
        "id": 2890,
        "code": "27.04.05.",
        "name": "Технологическое предпринимательство и развитие инноваций"
    },
    {
        "id": 4093,
        "code": "27.04.07.",
        "name": "Городская информатика и прикладная урбанистика"
    },
    {
        "id": 4101,
        "code": "38.04.01",
        "name": "Экономика инноваций и предпринимательства"
    },
    {
        "id": 4529,
        "code": "38.04.01.",
        "name": "Инвестиции в технологическом секторе"
    },
    {
        "id": 2000,
        "code": "38.04.05.",
        "name": "IT-консалтинг"
    }
]
wp_list=[
    {
        "id": 34407,
        "name": "BI-технологии и анализ бизнес-данных",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34756,
        "name": "C++ и UNIX системы",
        "term": 6,
        "course_project": False
    },
    {
        "id": 34090,
        "name": "CALS технологии в оптической технике / CALS strategy in optical engineering",
        "term": 4,
        "course_project": False
    },
    {
        "id": 27396,
        "name": "CALS технологии и стандарты",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34505,
        "name": "CALS технологии и стандарты / CALS technologies and standards",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31363,
        "name": "Computer System Design/Проектирование вычислительных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31363,
        "name": "Computer System Design/Проектирование вычислительных систем",
        "term": 2,
        "course_project": True
    },
    {
        "id": 21637,
        "name": "Digital-технологии в инноватике",
        "term": 8,
        "course_project": False
    },
    {
        "id": 24942,
        "name": "Digital-технологии в инноватике",
        "term": 4,
        "course_project": False
    },
    {
        "id": 24965,
        "name": "IT-среда инновационной деятельности",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31365,
        "name": "Parallel Computing/Параллельные вычисления",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27328,
        "name": "UNIX/Linux системы в инфокоммуникациях",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27328,
        "name": "UNIX/Linux системы в инфокоммуникациях",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34428,
        "name": "UNIX/Linux системы в инфокоммуникациях / UNIX/Linux systems in telecommunication",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34428,
        "name": "UNIX/Linux системы в инфокоммуникациях / UNIX/Linux systems in telecommunication",
        "term": 2,
        "course_project": True
    },
    {
        "id": 10231,
        "name": "Web-программирование",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25024,
        "name": "Web-программирование",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25024,
        "name": "Web-программирование",
        "term": 6,
        "course_project": True
    },
    {
        "id": 18978,
        "name": "Web-технологии",
        "term": 8,
        "course_project": False
    },
    {
        "id": 30939,
        "name": "Автоматизация инженерно-конструкторских задач",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25027,
        "name": "Автоматизация инженерных расчетов, анализа и моделирования",
        "term": 2,
        "course_project": False
    },
    {
        "id": 6697,
        "name": "Автоматизация проектирования гироскопических приборов (механика)",
        "term": 8,
        "course_project": False
    },
    {
        "id": 6715,
        "name": "Автоматизация проектирования и конструирования приборов",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25030,
        "name": "Автоматизация технологических процессов",
        "term": 6,
        "course_project": False
    },
    {
        "id": 5060,
        "name": "Автоматизация технологических процессов и производств",
        "term": 10,
        "course_project": False
    },
    {
        "id": 19628,
        "name": "Автоматизация холодильных автотранспортных средств",
        "term": 10,
        "course_project": False
    },
    {
        "id": 21776,
        "name": "Автоматизированное проектирование низкотемпературных систем",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25037,
        "name": "Автоматизированное управление промышленными объектами",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25031,
        "name": "Автоматизированные информационно-управляющие системы",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31522,
        "name": "Автоматизированные системы управления технологическими процессами",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34444,
        "name": "Автоматизированный анализ текстов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35651,
        "name": "Автоматизированный расчет теплофизичеких и транспортных свойств криопродуктов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34179,
        "name": "Автоматизированный расчет теплофизических и транспортных свойств компонентов природного газа",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25028,
        "name": "Автоматическая обработка естественного языка",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25038,
        "name": "Авторское право",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25046,
        "name": "Адаптивное и робастное управление",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25049,
        "name": "Адаптивное и робастное управление с компенсацией возмущений",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25047,
        "name": "Адаптивное управление мультиагентными системами",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25047,
        "name": "Адаптивное управление мультиагентными системами",
        "term": 2,
        "course_project": True
    },
    {
        "id": 30284,
        "name": "Администрирование в ОС Windows Server / Windows Server Administration",
        "term": 4,
        "course_project": False
    },
    {
        "id": 28512,
        "name": "Администрирование в ОС Windows Server/Windows Server operating system administration",
        "term": 4,
        "course_project": False
    },
    {
        "id": 18662,
        "name": "Администрирование вычислительных систем",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25057,
        "name": "Администрирование систем управления базами данных",
        "term": 6,
        "course_project": False
    },
    {
        "id": 30962,
        "name": "Активные \"умные\" полимерные покрытия и их использование в пищевой промышленности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30992,
        "name": "Алгоритмы и оценка сложности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25061,
        "name": "Алгоритмы и структуры данных",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25061,
        "name": "Алгоритмы и структуры данных",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25061,
        "name": "Алгоритмы и структуры данных",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25060,
        "name": "Алгоритмы и структуры данных (углубленный курс)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33176,
        "name": "Алгоритмы и структуры данных / Algorithms and Data Structures",
        "term": 4,
        "course_project": False
    },
    {
        "id": 13138,
        "name": "Алгоритмы машинного обучения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 6922,
        "name": "Альтернативные источники энергии",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25066,
        "name": "Альтернативные источники энергии",
        "term": 6,
        "course_project": False
    },
    {
        "id": 30816,
        "name": "Анализ акустических событий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30816,
        "name": "Анализ акустических событий",
        "term": 2,
        "course_project": True
    },
    {
        "id": 31444,
        "name": "Анализ данных гетерогенных источников",
        "term": 2,
        "course_project": False
    },
    {
        "id": 3539,
        "name": "Анализ деятельности организации",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25084,
        "name": "Анализ и оценка пользовательского опыта",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25086,
        "name": "Анализ и проектирование на UML",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25074,
        "name": "Анализ и управление бизнес-процессами",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30151,
        "name": "Анализ изображений",
        "term": 4,
        "course_project": False
    },
    {
        "id": 19008,
        "name": "Анализ наноструктур методами микроскопии",
        "term": 8,
        "course_project": False
    },
    {
        "id": 30995,
        "name": "Анализ неструктурированных данных",
        "term": 2,
        "course_project": False
    },
    {
        "id": 21708,
        "name": "Анализ результатов инновационной деятельности",
        "term": 8,
        "course_project": False
    },
    {
        "id": 19168,
        "name": "Анализ результатов технологических инноваций",
        "term": 10,
        "course_project": False
    },
    {
        "id": 18742,
        "name": "Анализ социальных сетей",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25070,
        "name": "Анализ социальных сетей",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25070,
        "name": "Анализ социальных сетей",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25096,
        "name": "Анализ социальных сетей/ Social Network Analysis",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25096,
        "name": "Анализ социальных сетей/ Social Network Analysis",
        "term": 2,
        "course_project": True
    },
    {
        "id": 32576,
        "name": "Анализ текстов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 2897,
        "name": "Анализ хозяйственной деятельности предприятий-участников внешнеэкономической деятельности",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25100,
        "name": "Анализ экологических показателей продукции/ Quantative Environmental Assessment of Products",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25089,
        "name": "Аналитическая и прикладная механика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34193,
        "name": "Аналитическая химия. Физико-химические методы анализа / Analytical chemistry. Physicochemical methods of analysis",
        "term": 2,
        "course_project": False
    },
    {
        "id": 40436,
        "name": "Аналитические и численные методы теории дифракции",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34017,
        "name": "Аналоговая и цифровая обработка сигналов",
        "term": 8,
        "course_project": False
    },
    {
        "id": 33250,
        "name": "Английский язык / English",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33179,
        "name": "Английский язык: устная речь / College English Listening & Speaking",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33181,
        "name": "Английский язык: чтение / College English Intensive Reading",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25097,
        "name": "Антенны и радиочастотные устройства",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25097,
        "name": "Антенны и радиочастотные устройства",
        "term": 2,
        "course_project": True
    },
    {
        "id": 1390,
        "name": "Антикризисное управление",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34356,
        "name": "Аппаратно-программное обеспечение киберфизических систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25101,
        "name": "Аппаратное обеспечение робототехнических систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31332,
        "name": "Аппаратное обеспечение робототехнических систем / Robotic Systems Hardware",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30853,
        "name": "Архитектура IT-решений",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31026,
        "name": "Архитектура аппаратных средств",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31353,
        "name": "Архитектура и моделирование киберфизических систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30380,
        "name": "Архитектура интернета вещей",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25114,
        "name": "Архитектура информационных систем",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25106,
        "name": "Архитектура корпоративных информационных систем",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31371,
        "name": "Архитектура мобильных и встраиваемых систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25109,
        "name": "Архитектура предприятия",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31405,
        "name": "Архитектура предприятия / Enterprise Architecture",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25105,
        "name": "Архитектуры государственных информационных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25105,
        "name": "Архитектуры государственных информационных систем",
        "term": 2,
        "course_project": True
    },
    {
        "id": 28672,
        "name": "Атаки по сторонним каналам и современная криптография / Side-Channel Attacks and Modern Cryptanalysis",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30819,
        "name": "Аудиоаналитика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30819,
        "name": "Аудиоаналитика",
        "term": 2,
        "course_project": True
    },
    {
        "id": 25123,
        "name": "Аудит системы менеджмента качества",
        "term": 2,
        "course_project": False
    },
    {
        "id": 6795,
        "name": "Базовые материалы фотоники",
        "term": 8,
        "course_project": False
    },
    {
        "id": 574,
        "name": "Базы данных",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25127,
        "name": "Базы данных и базы знаний",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25128,
        "name": "Базы данных и знаний",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30159,
        "name": "Безопасность ICO контрактов",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25130,
        "name": "Безопасность Web-приложений",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25130,
        "name": "Безопасность Web-приложений",
        "term": 6,
        "course_project": True
    },
    {
        "id": 35249,
        "name": "Безопасность ОС семейства UNIX",
        "term": 8,
        "course_project": False
    },
    {
        "id": 28671,
        "name": "Безопасность баз данных / Database Security",
        "term": 2,
        "course_project": False
    },
    {
        "id": 10549,
        "name": "Безопасность в Интернет",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25131,
        "name": "Безопасность вычислительных систем и сетей",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25131,
        "name": "Безопасность вычислительных систем и сетей",
        "term": 2,
        "course_project": True
    },
    {
        "id": 576,
        "name": "Безопасность жизнедеятельности",
        "term": 6,
        "course_project": False
    },
    {
        "id": 576,
        "name": "Безопасность жизнедеятельности",
        "term": 10,
        "course_project": False
    },
    {
        "id": 25143,
        "name": "Безопасность жизнедеятельности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25143,
        "name": "Безопасность жизнедеятельности",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25143,
        "name": "Безопасность жизнедеятельности",
        "term": 6,
        "course_project": False
    },
    {
        "id": 6001,
        "name": "Безопасность продовольственного сырья и продуктов питания",
        "term": 8,
        "course_project": False
    },
    {
        "id": 31043,
        "name": "Безопасность роевых робототехнических систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25137,
        "name": "Безопасность сетевых операционных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33069,
        "name": "Безопасность сетевых технологий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 9850,
        "name": "Безотходные технологии отрасли",
        "term": 8,
        "course_project": False
    },
    {
        "id": 9850,
        "name": "Безотходные технологии отрасли",
        "term": 10,
        "course_project": False
    },
    {
        "id": 25138,
        "name": "Бек-энд разработка",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25144,
        "name": "Бизнес в digital-среде",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30356,
        "name": "Бизнес-логика программных систем",
        "term": 6,
        "course_project": False
    },
    {
        "id": 32809,
        "name": "Бизнес-модели основных секторов инновационной экономики",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31188,
        "name": "Бизнес-моделирование в сфере управления энергоресурсами",
        "term": 2,
        "course_project": False
    },
    {
        "id": 36051,
        "name": "Бизнес-моделирование предприятий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 5077,
        "name": "Бизнес-планирование",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25147,
        "name": "Биоинформатика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25148,
        "name": "Биокатализ в пищевой промышленности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 18797,
        "name": "Биологическая безопасность",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25151,
        "name": "Биологическая безопасность пищевой продукции",
        "term": 6,
        "course_project": False
    },
    {
        "id": 36125,
        "name": "Биологические мишени лекарственных препаратов",
        "term": 8,
        "course_project": False
    },
    {
        "id": 32113,
        "name": "Биометрия и нейротехнологии",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31544,
        "name": "Бионанотехнологии белков и белковых препаратов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34271,
        "name": "Биоорганическая химия",
        "term": 2,
        "course_project": False
    },
    {
        "id": 36109,
        "name": "Биотехнические системы",
        "term": 2,
        "course_project": False
    },
    {
        "id": 36110,
        "name": "Биотехнические системы / Biotechnical Systems",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31123,
        "name": "Биотехнологическая индустрия",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25172,
        "name": "Биотехнологическая модификация свойств пищевого сырья",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28253,
        "name": "Биотехнологическая модификация свойств пищевого сырья / Biotechnological Modification of Food Raw Materials",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28258,
        "name": "Биотехнологическая модификация свойств растительного сырья / Biotechnological Modification of Plant Materials",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19301,
        "name": "Биотехнологические основы конструирования функциональных продуктов питания",
        "term": 10,
        "course_project": False
    },
    {
        "id": 30568,
        "name": "Биотехнологические основы переработки продовольственного сырья",
        "term": 6,
        "course_project": False
    },
    {
        "id": 28260,
        "name": "Биотехнологические основы производства вина / Biotechnological Basics of Wine Manufacturing",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31116,
        "name": "Биотехнология виноделия",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35830,
        "name": "Биотехнология продуктов здорового питания",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35830,
        "name": "Биотехнология продуктов здорового питания",
        "term": 2,
        "course_project": True
    },
    {
        "id": 25182,
        "name": "Биотехнология продуктов микробного синтеза",
        "term": 2,
        "course_project": False
    },
    {
        "id": 5988,
        "name": "Биофизика",
        "term": 8,
        "course_project": False
    },
    {
        "id": 5988,
        "name": "Биофизика",
        "term": 10,
        "course_project": False
    },
    {
        "id": 25174,
        "name": "Биофизика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25175,
        "name": "Биофотоника",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35749,
        "name": "Биофотоника / Biophotonics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25180,
        "name": "Биохимические и физико-химические основы производства экологически безопасных пищевых продуктов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25177,
        "name": "Биохимия трансформации белковых молекул",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25178,
        "name": "Биоэтика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25185,
        "name": "Бухгалтерский учет нематериальных активов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19371,
        "name": "Бюджетирование в организации",
        "term": 8,
        "course_project": False
    },
    {
        "id": 13537,
        "name": "Бюджетирование проекта",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25251,
        "name": "ВЧ и СВЧ электроника",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25251,
        "name": "ВЧ и СВЧ электроника",
        "term": 2,
        "course_project": True
    },
    {
        "id": 28008,
        "name": "Вариационные методы в теории динамических систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25195,
        "name": "Введение в интеллектуальный анализ данных",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25195,
        "name": "Введение в интеллектуальный анализ данных",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34604,
        "name": "Введение в интеллектуальный анализ данных / Introduction to Cultural Data Mining and Analysis",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34604,
        "name": "Введение в интеллектуальный анализ данных / Introduction to Cultural Data Mining and Analysis",
        "term": 2,
        "course_project": True
    },
    {
        "id": 40390,
        "name": "Введение в интеллектуальный анализ культурных данных //Introduction to Cultural Data Mining and Analysis.",
        "term": 2,
        "course_project": False
    },
    {
        "id": 40390,
        "name": "Введение в интеллектуальный анализ культурных данных //Introduction to Cultural Data Mining and Analysis.",
        "term": 2,
        "course_project": True
    },
    {
        "id": 32319,
        "name": "Введение в кибербезопасность",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34454,
        "name": "Введение в клеточную биологию / Introduction to cell biology",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34450,
        "name": "Введение в материаловедение / Introduction to Materials Science",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32329,
        "name": "Введение в микробиологию",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32328,
        "name": "Введение в молекулярную биологию",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25201,
        "name": "Введение в профессиональную деятельность",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33231,
        "name": "Введение в профессиональную деятельность / Introduction to Professional Activity",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31433,
        "name": "Введение в распределенные технологии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27338,
        "name": "Введение в теорию \"умного города\"",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34745,
        "name": "Введение в теорию электрических цепей",
        "term": 6,
        "course_project": False
    },
    {
        "id": 33172,
        "name": "Введение в учение Мао Цзэдуна и теоретическую систему социализма с китайской спецификой / Introduction to Mao Zedong Thought and the Theoretical System of Socialism with Chinese characteristics",
        "term": 4,
        "course_project": False
    },
    {
        "id": 40432,
        "name": "Введение в физику полупроводников / Introduction to Semiconductor Physics",
        "term": 4,
        "course_project": False
    },
    {
        "id": 35552,
        "name": "Введение в цифровые гуманитарные науки",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25210,
        "name": "Веб-программирование",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25215,
        "name": "Венчурное предпринимательство",
        "term": 4,
        "course_project": False
    },
    {
        "id": 30991,
        "name": "Вероятность и статистика (продвинутый уровень)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 7677,
        "name": "Ветеринарно-санитарная экспертиза мясного сырья",
        "term": 10,
        "course_project": False
    },
    {
        "id": 25219,
        "name": "Взаимодействие лазерного излучения с веществом",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25219,
        "name": "Взаимодействие лазерного излучения с веществом",
        "term": 6,
        "course_project": False
    },
    {
        "id": 32473,
        "name": "Видеоинформационные системы в практических задачах",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30863,
        "name": "Видеосистемы и видеоаналитика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34517,
        "name": "Видеосистемы и видеоаналитика / Video systems and video analytics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25221,
        "name": "Визуализация данных",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28228,
        "name": "Визуализация данных / Data Visualization",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35685,
        "name": "Визуализация данных / Introduction to Visualization",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25222,
        "name": "Визуализация и моделирование",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25226,
        "name": "Виртуальное командообразование",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25225,
        "name": "Виртуальные среды в образовании",
        "term": 6,
        "course_project": False
    },
    {
        "id": 34169,
        "name": "Военная подготовка (офицер запаса. Часть 2)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33170,
        "name": "Военная теория / Military Theory",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25236,
        "name": "Возобновляемая энергетика/ Reneable Energy",
        "term": 2,
        "course_project": False
    },
    {
        "id": 15571,
        "name": "Возобновляемые источники энергии",
        "term": 8,
        "course_project": False
    },
    {
        "id": 27392,
        "name": "Волновая оптика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34496,
        "name": "Волновая оптика / Wave optics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25240,
        "name": "Волновые процессы",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25242,
        "name": "Волоконная и интегральная оптика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32712,
        "name": "Волоконная и интегральная оптика / Fiber and integrated optics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 601,
        "name": "Волоконная оптика",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25244,
        "name": "Волоконно-оптические информационно-измерительные системы",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32714,
        "name": "Волоконно-оптические информационно-измерительные системы / Fiber-optic Information and measurement systems based on the fiber optics components",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32111,
        "name": "Встроенные системы",
        "term": 4,
        "course_project": False
    },
    {
        "id": 33198,
        "name": "Встроенные системы / Embedded Systems",
        "term": 4,
        "course_project": False
    },
    {
        "id": 35290,
        "name": "Второй иностранный язык (немецкий). Уровень A2",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31242,
        "name": "Второй иностранный язык (немецкий). Уровень А2",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31242,
        "name": "Второй иностранный язык (немецкий). Уровень А2",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31242,
        "name": "Второй иностранный язык (немецкий). Уровень А2",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31243,
        "name": "Второй иностранный язык (немецкий). Уровень В1+",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35489,
        "name": "Второй иностранный язык (русский). Уровень В2+",
        "term": 4,
        "course_project": False
    },
    {
        "id": 35849,
        "name": "Второй иностранный язык (шведский)",
        "term": 8,
        "course_project": False
    },
    {
        "id": 31241,
        "name": "Второй иностранный язык (шведский). Уровень B1+",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31241,
        "name": "Второй иностранный язык (шведский). Уровень B1+",
        "term": 6,
        "course_project": False
    },
    {
        "id": 36889,
        "name": "Второй иностранный язык (шведский). Уровень B1+",
        "term": 8,
        "course_project": False
    },
    {
        "id": 31240,
        "name": "Второй иностранный язык (шведский). Уровень А2",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31240,
        "name": "Второй иностранный язык (шведский). Уровень А2",
        "term": 4,
        "course_project": False
    },
    {
        "id": 30993,
        "name": "Выпуклый анализ и оптимизация",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25249,
        "name": "Высокие технологии и работа с материалами в современном искусстве/ High Technology and Materials in the Contemporary Art",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25253,
        "name": "Высокопроизводительные вычисления",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28212,
        "name": "Высокопроизводительные вычисления / High Performance Computing",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33188,
        "name": "Высшая математика А / Higher Mathematics A",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25256,
        "name": "Вычислительная геометрия",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25257,
        "name": "Вычислительная математика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 33175,
        "name": "Вычислительная математика / Computational Mathematics",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25261,
        "name": "Вычислительная техника и компьютерное моделирование в физике",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30921,
        "name": "Вычислительная физика/ Computational Physics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31000,
        "name": "Вычислительные методы в физике / \nComputational methods in physics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 612,
        "name": "Вычислительные сети",
        "term": 6,
        "course_project": False
    },
    {
        "id": 33253,
        "name": "Вычислительный интеллект / Computational Intelligence",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25267,
        "name": "Геоинформационные технологии авиаприборостроения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28009,
        "name": "Геометрические методы исследования динамических систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30793,
        "name": "Геометрические методы управления нелинейными системами и их практические приложения / Introduction to geometric nonlinear control theory and applications",
        "term": 2,
        "course_project": False
    },
    {
        "id": 36959,
        "name": "Геометрия многообразий",
        "term": 4,
        "course_project": False
    },
    {
        "id": 34311,
        "name": "Геродиетика активного долголетия / Herodietics of active longevity",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34729,
        "name": "Гидродинамика и теория упругости",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25273,
        "name": "Глобальные изменения белковых трофических цепей",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25270,
        "name": "Глобальные технологические тренды",
        "term": 4,
        "course_project": False
    },
    {
        "id": 34419,
        "name": "Глобальный мониторинг изменения климата",
        "term": 2,
        "course_project": False
    },
    {
        "id": 21636,
        "name": "Глобальный рынок инноваций",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25279,
        "name": "Государственная инновационная политика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25279,
        "name": "Государственная инновационная политика",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25280,
        "name": "Государственная система обеспечения единства измерений",
        "term": 2,
        "course_project": False
    },
    {
        "id": 618,
        "name": "Государственная экзаменационная комиссия (несколько членов ГАК)",
        "term": 4,
        "course_project": False
    },
    {
        "id": 618,
        "name": "Государственная экзаменационная комиссия (несколько членов ГАК)",
        "term": 8,
        "course_project": False
    },
    {
        "id": 31189,
        "name": "Государственное регулирование в биоэкономике",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34409,
        "name": "Государственные эталоны, эталонные комплексы и материалы",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25281,
        "name": "Графический дизайн пользовательских интерфейсов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34445,
        "name": "Графовые базы знаний",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19113,
        "name": "Дегустационная оценка сырья и готовой продукции",
        "term": 8,
        "course_project": False
    },
    {
        "id": 19113,
        "name": "Дегустационная оценка сырья и готовой продукции",
        "term": 10,
        "course_project": False
    },
    {
        "id": 9641,
        "name": "Деловые коммуникации в логистике",
        "term": 10,
        "course_project": False
    },
    {
        "id": 35910,
        "name": "Демонстрационный экзамен",
        "term": 8,
        "course_project": False
    },
    {
        "id": 6905,
        "name": "Детали мехатронных модулей, роботов и их конструирование",
        "term": 8,
        "course_project": False
    },
    {
        "id": 2670,
        "name": "Диагностика энергофизических процессов",
        "term": 8,
        "course_project": False
    },
    {
        "id": 9789,
        "name": "Диагностика, ремонт, монтаж и сервисное обслуживание оборудования пищевых производств",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25294,
        "name": "Дизайн вещей будущего",
        "term": 4,
        "course_project": False
    },
    {
        "id": 33225,
        "name": "Дизайн вещей будущего / Future Things Design",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31070,
        "name": "Дизайн и методы STS",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31070,
        "name": "Дизайн и методы STS",
        "term": 2,
        "course_project": True
    },
    {
        "id": 35969,
        "name": "Динамика открытых квантовых систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35970,
        "name": "Динамика открытых квантовых систем / Dynamics of open quantum systems",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25299,
        "name": "Динамика робототехнических систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28610,
        "name": "Динамика робототехнических систем / Dynamics of Robotic Systems",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25302,
        "name": "Дискретная математика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25302,
        "name": "Дискретная математика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 33192,
        "name": "Дискретная математика / Discrete Mathematics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31023,
        "name": "Дискретная математика с элементами математической логики",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29058,
        "name": "Дискретные математические модели / Discrete modeling",
        "term": 2,
        "course_project": False
    },
    {
        "id": 9899,
        "name": "Дискретные системы управления",
        "term": 8,
        "course_project": False
    },
    {
        "id": 29650,
        "name": "Дисперсные системы и явления",
        "term": 2,
        "course_project": False
    },
    {
        "id": 29650,
        "name": "Дисперсные системы и явления",
        "term": 6,
        "course_project": False
    },
    {
        "id": 30279,
        "name": "Дифференциальные уравления и ТФКП",
        "term": 4,
        "course_project": False
    },
    {
        "id": 36950,
        "name": "Дифференциальные уравнения II",
        "term": 4,
        "course_project": False
    },
    {
        "id": 35677,
        "name": "Дифференциальные уравнения и ТФКП",
        "term": 4,
        "course_project": False
    },
    {
        "id": 27908,
        "name": "Доклинические исследования / Preclinical studies",
        "term": 2,
        "course_project": False
    },
    {
        "id": 9642,
        "name": "Документирование в логистической деятельности",
        "term": 10,
        "course_project": False
    },
    {
        "id": 30269,
        "name": "Дополнительные главы алгоритмов и структур данных",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29529,
        "name": "Дополнительные главы дискретной математики",
        "term": 2,
        "course_project": False
    },
    {
        "id": 29529,
        "name": "Дополнительные главы дискретной математики",
        "term": 4,
        "course_project": False
    },
    {
        "id": 34735,
        "name": "Дополнительные главы квантовой механики",
        "term": 6,
        "course_project": False
    },
    {
        "id": 27128,
        "name": "Дополнительные главы линейной алгебры",
        "term": 2,
        "course_project": False
    },
    {
        "id": 29528,
        "name": "Дополнительные главы математического анализа",
        "term": 4,
        "course_project": False
    },
    {
        "id": 19754,
        "name": "Дополнительные главы прикладной механики",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25314,
        "name": "Дополнительные главы физики",
        "term": 4,
        "course_project": False
    },
    {
        "id": 28152,
        "name": "Дополнительные разделы C++",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30154,
        "name": "Дополнительные разделы вычислительной геометрии",
        "term": 4,
        "course_project": False
    },
    {
        "id": 28332,
        "name": "Дополнительные разделы машинного обучения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28332,
        "name": "Дополнительные разделы машинного обучения",
        "term": 2,
        "course_project": True
    },
    {
        "id": 32674,
        "name": "Допустимые уровни и нормативы биологической безопасности сырья и продуктов животного и растительного происхождения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25317,
        "name": "Жанры научного стиля. Языковые и неязыковые особенности",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25318,
        "name": "Живопись",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25319,
        "name": "Жидкостные методы получения оптических наноматериалов",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25321,
        "name": "Жизненный цикл безопасной разработки программного обеспечения",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25322,
        "name": "Жизненный цикл мобильных приложений",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25320,
        "name": "Жизненный цикл программного обеспечения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25323,
        "name": "Задачи механики подвижных объектов для приборостроения",
        "term": 6,
        "course_project": False
    },
    {
        "id": 2470,
        "name": "Защита ВКР",
        "term": 4,
        "course_project": False
    },
    {
        "id": 2470,
        "name": "Защита ВКР",
        "term": 8,
        "course_project": False
    },
    {
        "id": 2470,
        "name": "Защита ВКР",
        "term": 10,
        "course_project": False
    },
    {
        "id": 32854,
        "name": "Защита выпуской квалификационной работы",
        "term": 6,
        "course_project": False
    },
    {
        "id": 32854,
        "name": "Защита выпуской квалификационной работы",
        "term": 8,
        "course_project": False
    },
    {
        "id": 35909,
        "name": "Защита дипломного проекта",
        "term": 8,
        "course_project": False
    },
    {
        "id": 29562,
        "name": "Защита искусственного интеллекта от вредоносных воздействий",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25324,
        "name": "Защищенный документооборот",
        "term": 6,
        "course_project": False
    },
    {
        "id": 33254,
        "name": "Идентификация и обработка сигналов / Signal Detection and Processing Technology",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33182,
        "name": "Идеологическое и нравственное воспитание и основы права / Ideological and Moral Cultivation and Legal Basis",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34194,
        "name": "Избранные главы физической химии / Selected chapters of physical chemistry",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34194,
        "name": "Избранные главы физической химии / Selected chapters of physical chemistry",
        "term": 2,
        "course_project": True
    },
    {
        "id": 25335,
        "name": "Измерения в телекоммуникационных системах",
        "term": 2,
        "course_project": False
    },
    {
        "id": 13021,
        "name": "Измерительные видеоинформационные системы",
        "term": 10,
        "course_project": False
    },
    {
        "id": 25340,
        "name": "Имитационное моделирование",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31030,
        "name": "Имитационное моделирование беспилотных транспортных средств",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34475,
        "name": "Имитационное моделирование робототехнических систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34476,
        "name": "Имитационное моделирование робототехнических систем / Simulation of Robotic Systems",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25343,
        "name": "Импульсные последовательности и методы физического контрастирования в МР-томографии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 7968,
        "name": "Инвестиционный анализ инновационной деятельности",
        "term": 10,
        "course_project": False
    },
    {
        "id": 25346,
        "name": "Индустриальный интернет",
        "term": 4,
        "course_project": False
    },
    {
        "id": 33191,
        "name": "Инженерная математика / Engineering Mathematics",
        "term": 4,
        "course_project": False
    },
    {
        "id": 5153,
        "name": "Инженерная реология",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25350,
        "name": "Инженерная фотоника",
        "term": 6,
        "course_project": False
    },
    {
        "id": 33178,
        "name": "Инженерная экономика / Engineering economy",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25352,
        "name": "Инженерно-технические средства защиты информации",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31074,
        "name": "Инновации и общество",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28259,
        "name": "Инновационная биотехнология пива / Innovative Brewery Biotechnology",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25370,
        "name": "Инновационная экономика и технологическое предпринимательство",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25370,
        "name": "Инновационная экономика и технологическое предпринимательство",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25361,
        "name": "Инновационное предпринимательство",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34879,
        "name": "Инновационное предпринимательство: создание стоимости",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25359,
        "name": "Инновационные бизнес-модели",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31126,
        "name": "Инновационные маркетинговые технологии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25403,
        "name": "Инновационные технологии и направления развития ассортимента хлебобулочных изделий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25403,
        "name": "Инновационные технологии и направления развития ассортимента хлебобулочных изделий",
        "term": 2,
        "course_project": True
    },
    {
        "id": 25369,
        "name": "Инновационные технологии пива",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25369,
        "name": "Инновационные технологии пива",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34308,
        "name": "Инновационные технологии производства экологически безопасных продуктов питания",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34308,
        "name": "Инновационные технологии производства экологически безопасных продуктов питания",
        "term": 2,
        "course_project": True
    },
    {
        "id": 21706,
        "name": "Инновационные технологии финансового рынка",
        "term": 8,
        "course_project": False
    },
    {
        "id": 425,
        "name": "Иностранный язык",
        "term": 6,
        "course_project": False
    },
    {
        "id": 425,
        "name": "Иностранный язык",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25373,
        "name": "Иностранный язык",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25373,
        "name": "Иностранный язык",
        "term": 4,
        "course_project": False
    },
    {
        "id": 415,
        "name": "Иностранный язык в профессиональной деятельности",
        "term": 4,
        "course_project": False
    },
    {
        "id": 415,
        "name": "Иностранный язык в профессиональной деятельности",
        "term": 6,
        "course_project": False
    },
    {
        "id": 415,
        "name": "Иностранный язык в профессиональной деятельности",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25439,
        "name": "Иностранный язык в профессиональной деятельности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25439,
        "name": "Иностранный язык в профессиональной деятельности",
        "term": 6,
        "course_project": False
    },
    {
        "id": 33200,
        "name": "Иностранный язык в профессиональной деятельности / IELTS English",
        "term": 4,
        "course_project": False
    },
    {
        "id": 28208,
        "name": "Иностранный язык в профессиональной деятельности/English for Specific Purposes",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30866,
        "name": "Иностранный язык в профессиональной деятельности/Foreign language in professional activity",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35228,
        "name": "Иностранный язык в экологических исследованиях",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35229,
        "name": "Иностранный язык в экологических исследованиях / Foreign Language in Environmental Studies",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25377,
        "name": "Инструментальные средства разработки ПО",
        "term": 4,
        "course_project": False
    },
    {
        "id": 27355,
        "name": "Инструментальные средства разработки видеоигр",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27355,
        "name": "Инструментальные средства разработки видеоигр",
        "term": 2,
        "course_project": True
    },
    {
        "id": 1926,
        "name": "Инструментальные средства разработки программного обеспечения",
        "term": 6,
        "course_project": False
    },
    {
        "id": 1926,
        "name": "Инструментальные средства разработки программного обеспечения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 19217,
        "name": "Интегрально-оптические технологии",
        "term": 8,
        "course_project": False
    },
    {
        "id": 2190,
        "name": "Интегрированные системы ориентации и навигации",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25391,
        "name": "Интеллектуальная обработка экспериментальных данных",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25406,
        "name": "Интеллектуальное управление креативными проектами/ Intellectual Management of Creative Projects",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34185,
        "name": "Интеллектуальные методы и модели анализа пространственно-временных процессов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34567,
        "name": "Интеллектуальные системы и теория игр",
        "term": 2,
        "course_project": False
    },
    {
        "id": 6968,
        "name": "Интеллектуальные системы и технологии",
        "term": 8,
        "course_project": False
    },
    {
        "id": 32320,
        "name": "Интеллектуальные системы управления",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25394,
        "name": "Интеллектуальные системы управления промышленным предприятием",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25388,
        "name": "Интеллектуальные технические системы",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25404,
        "name": "Интеллектуальные технологии в задачах управления и навигации",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34587,
        "name": "Интеллектуальные технологии в задачах управления и навигации/\nIntelligent technology in control and navigation tasks",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25389,
        "name": "Интеллектуальные транспортные системы",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25389,
        "name": "Интеллектуальные транспортные системы",
        "term": 2,
        "course_project": True
    },
    {
        "id": 14168,
        "name": "Интенсификация биотехнологических процессов",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25402,
        "name": "Интернет журналистика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25402,
        "name": "Интернет журналистика",
        "term": 6,
        "course_project": False
    },
    {
        "id": 440,
        "name": "Информатика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 440,
        "name": "Информатика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 1064,
        "name": "Информационная безопасность",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25418,
        "name": "Информационная безопасность",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25422,
        "name": "Информационная поддержка жизненного цикла изделий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25411,
        "name": "Информационно-измерительные комплексы и системы управления процессами",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25411,
        "name": "Информационно-измерительные комплексы и системы управления процессами",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34590,
        "name": "Информационно-навигационные системы в задачах позиционирования и ориентации/Information and navigation systems in the problems of positioning and orientation",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30293,
        "name": "Информационно-управляющие системы",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31090,
        "name": "Информационные системы управления проектами",
        "term": 2,
        "course_project": False
    },
    {
        "id": 439,
        "name": "Информационные технологии",
        "term": 4,
        "course_project": False
    },
    {
        "id": 27202,
        "name": "Информационные технологии в науке и образовании",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28589,
        "name": "Информационные технологии в науке и образовании / Information Technologies in Science and Education",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34679,
        "name": "Информационные технологии в проведении научных исследований",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25419,
        "name": "Информационные технологии и безопасность",
        "term": 2,
        "course_project": False
    },
    {
        "id": 10454,
        "name": "Информационные технологии поддержки жизненного цикла электронных средств",
        "term": 8,
        "course_project": False
    },
    {
        "id": 30478,
        "name": "Информационные устройства в мехатронике",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31408,
        "name": "Информационный менеджмент в туризме / Tourism Information Management",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32379,
        "name": "Информационный менеджмент и основы кибербезопасности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32379,
        "name": "Информационный менеджмент и основы кибербезопасности",
        "term": 2,
        "course_project": True
    },
    {
        "id": 7049,
        "name": "Информационный поиск",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25417,
        "name": "Информационный поиск",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25427,
        "name": "Инфраструктура больших данных",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28218,
        "name": "Инфраструктура больших данных / Technologies and Infrastructure for Big Data",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28218,
        "name": "Инфраструктура больших данных / Technologies and Infrastructure for Big Data",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34574,
        "name": "Инфраструктура сбора данных об окружающей среде",
        "term": 2,
        "course_project": False
    },
    {
        "id": 6719,
        "name": "Искусственный интеллект в технической подготовке производства",
        "term": 8,
        "course_project": False
    },
    {
        "id": 33264,
        "name": "Искусственный интеллект и распознавание образов / Artificial Intelligence and Pattern Recognition",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25442,
        "name": "Искусство и естественные науки: теория, эстетика, дискурсы",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25339,
        "name": "Искусство и естественные науки: теория, эстетика, дискурсы/ Art and Natural Sciences: Theory, Aesthetics, Discourses",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25441,
        "name": "Искусство и точные науки: теория, эстетика, дискурсы/ Art and Exact Sciences: Theory, Aesthetics, Discourses",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27302,
        "name": "Использование информационных технологий в реометрии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25452,
        "name": "Исследование экосистем веб-языков и веб-технологий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25452,
        "name": "Исследование экосистем веб-языков и веб-технологий",
        "term": 2,
        "course_project": True
    },
    {
        "id": 19751,
        "name": "Исследование электромеханической системы",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25450,
        "name": "Исследования и анализ в бизнесе",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31463,
        "name": "История (История западноевропейской и русской культуры)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31459,
        "name": "История (История становления Российской государственности)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31461,
        "name": "История (Наука и техника в истории цивилизации)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31460,
        "name": "История (Проблемы истории Европы ХХ века)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31464,
        "name": "История (Реформы и реформаторы в истории России)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31466,
        "name": "История (Россия в истории современных международных отношений)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31415,
        "name": "История дизайна",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25455,
        "name": "История искусств",
        "term": 6,
        "course_project": False
    },
    {
        "id": 15183,
        "name": "Источники и приёмники оптического излучения",
        "term": 6,
        "course_project": False
    },
    {
        "id": 29603,
        "name": "Источники и приемники оптического излучения",
        "term": 6,
        "course_project": False
    },
    {
        "id": 30609,
        "name": "Источники и приемники оптического излучения / Sources and receivers of optical radiation",
        "term": 2,
        "course_project": False
    },
    {
        "id": 13539,
        "name": "Кадровое обеспечение проекта",
        "term": 8,
        "course_project": False
    },
    {
        "id": 21704,
        "name": "Календарное планирование инновационных проектов",
        "term": 8,
        "course_project": False
    },
    {
        "id": 19144,
        "name": "Календарное планирование проектов",
        "term": 8,
        "course_project": False
    },
    {
        "id": 32933,
        "name": "Квазичастицы в полупроводниках",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32849,
        "name": "Квалификационный экзамен ПМ.01",
        "term": 6,
        "course_project": False
    },
    {
        "id": 32849,
        "name": "Квалификационный экзамен ПМ.01",
        "term": 8,
        "course_project": False
    },
    {
        "id": 32850,
        "name": "Квалификационный экзамен ПМ.02",
        "term": 6,
        "course_project": False
    },
    {
        "id": 32850,
        "name": "Квалификационный экзамен ПМ.02",
        "term": 8,
        "course_project": False
    },
    {
        "id": 32851,
        "name": "Квалификационный экзамен ПМ.04",
        "term": 6,
        "course_project": False
    },
    {
        "id": 32851,
        "name": "Квалификационный экзамен ПМ.04",
        "term": 8,
        "course_project": False
    },
    {
        "id": 32852,
        "name": "Квалификационный экзамен ПМ.11",
        "term": 6,
        "course_project": False
    },
    {
        "id": 32852,
        "name": "Квалификационный экзамен ПМ.11",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25472,
        "name": "Квантовая механика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25472,
        "name": "Квантовая механика",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25480,
        "name": "Квантовая оптика и метрология",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25479,
        "name": "Квантовая оптика/ Quantum Optics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34016,
        "name": "Квантовая электродинамика конденсированного состояния",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34229,
        "name": "Квантовые и оптические методы обработки информации и вычислений",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33134,
        "name": "Квантовые когнитивные технологии систем искусственного интеллекта/Quantum Cognitive Technologies of AI Systems",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25477,
        "name": "Квантовые технологии",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25478,
        "name": "Квантовый компьютер",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25482,
        "name": "Киберфизические системы и технологии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31329,
        "name": "Киберфизические системы и технологии / Cyber Physical Systems and Technologies",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25490,
        "name": "Когнитивная экономика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31197,
        "name": "Количественные методы анализа информации",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30840,
        "name": "Количественные методы исследования мультимедийных данных",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30840,
        "name": "Количественные методы исследования мультимедийных данных",
        "term": 2,
        "course_project": True
    },
    {
        "id": 30830,
        "name": "Количественные методы исследования человеко-компьютерного взаимодействия (базовый уровень)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30830,
        "name": "Количественные методы исследования человеко-компьютерного взаимодействия (базовый уровень)",
        "term": 2,
        "course_project": True
    },
    {
        "id": 30839,
        "name": "Количественные методы исследования человеко-компьютерного взаимодействия(продвинутый уровень)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30839,
        "name": "Количественные методы исследования человеко-компьютерного взаимодействия(продвинутый уровень)",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34272,
        "name": "Коллоидные нано- и микродисперсные системы",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25496,
        "name": "Колориметрия светодиодного излучения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25496,
        "name": "Колориметрия светодиодного излучения",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34465,
        "name": "Коммуникации и командообразование",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34418,
        "name": "Коммуникационные протоколы кибер-физических систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 4177,
        "name": "Комплексные системы защиты информации",
        "term": 8,
        "course_project": False
    },
    {
        "id": 474,
        "name": "Комплексный курсовой проект",
        "term": 8,
        "course_project": False
    },
    {
        "id": 474,
        "name": "Комплексный курсовой проект",
        "term": 10,
        "course_project": False
    },
    {
        "id": 34089,
        "name": "Композиция и проектирование оптических систем / Composing and optical system design",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25523,
        "name": "Компьютерная визуализация",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25523,
        "name": "Компьютерная визуализация",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25503,
        "name": "Компьютерная геометрия и графика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25504,
        "name": "Компьютерная графика реального времени",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25509,
        "name": "Компьютерная лингвистика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25525,
        "name": "Компьютерное зрение",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25525,
        "name": "Компьютерное зрение",
        "term": 6,
        "course_project": False
    },
    {
        "id": 30794,
        "name": "Компьютерное зрение в робототехнических приложениях / Computer vision for robotic applications",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31538,
        "name": "Компьютерное проектирование низкотемпературных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 1505,
        "name": "Компьютерное управление мехатронными системами",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25488,
        "name": "Компьютерные методы и моделирование в химии материалов/ Computational methods and modeling in materials chemistry",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25488,
        "name": "Компьютерные методы и моделирование в химии материалов/ Computational methods and modeling in materials chemistry",
        "term": 4,
        "course_project": False
    },
    {
        "id": 490,
        "name": "Компьютерные сети",
        "term": 6,
        "course_project": False
    },
    {
        "id": 490,
        "name": "Компьютерные сети",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25526,
        "name": "Компьютерные сети",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25520,
        "name": "Компьютерные технологии моделирования физических процессов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27267,
        "name": "Компьютерные технологии мультимедиа",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34069,
        "name": "Конструирование и точностной анализ оптических приборов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34069,
        "name": "Конструирование и точностной анализ оптических приборов",
        "term": 2,
        "course_project": True
    },
    {
        "id": 30858,
        "name": "Конструирование и точностной анализ оптических приборов /Design of optical devices and systems+project",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30858,
        "name": "Конструирование и точностной анализ оптических приборов /Design of optical devices and systems+project",
        "term": 2,
        "course_project": True
    },
    {
        "id": 25532,
        "name": "Конструирование оптических приборов",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25532,
        "name": "Конструирование оптических приборов",
        "term": 6,
        "course_project": True
    },
    {
        "id": 6713,
        "name": "Конструирование технологической оснастки",
        "term": 8,
        "course_project": False
    },
    {
        "id": 1524,
        "name": "Конструкторско-технологическое обеспечение производства ЭВМ",
        "term": 8,
        "course_project": False
    },
    {
        "id": 31659,
        "name": "Конструкторско-технологическое обеспечение точности в машиностроении",
        "term": 4,
        "course_project": False
    },
    {
        "id": 34550,
        "name": "Контроль качества изделий цифрового производства",
        "term": 2,
        "course_project": False
    },
    {
        "id": 9893,
        "name": "Контроль качества продукции пищевых и биотехнологических производств",
        "term": 8,
        "course_project": False
    },
    {
        "id": 9893,
        "name": "Контроль качества продукции пищевых и биотехнологических производств",
        "term": 10,
        "course_project": False
    },
    {
        "id": 25535,
        "name": "Конфликтология",
        "term": 6,
        "course_project": False
    },
    {
        "id": 29644,
        "name": "Концепция развития низкотемпературных систем",
        "term": 4,
        "course_project": False
    },
    {
        "id": 33177,
        "name": "Конъюнктура и направления политики / Situation and Policies",
        "term": 4,
        "course_project": False
    },
    {
        "id": 34472,
        "name": "Корпоративная коммуникация",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25537,
        "name": "Корпоративные информационные системы",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25541,
        "name": "Корпоративный экологический менеджмент",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35650,
        "name": "Корпоративный экологический менеджмент / Corporate Environmental Management",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25542,
        "name": "Креативные технологии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25542,
        "name": "Креативные технологии",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25542,
        "name": "Креативные технологии",
        "term": 6,
        "course_project": False
    },
    {
        "id": 5177,
        "name": "Криогенные машины",
        "term": 8,
        "course_project": False
    },
    {
        "id": 5176,
        "name": "Криогенные системы и установки",
        "term": 8,
        "course_project": False
    },
    {
        "id": 3729,
        "name": "Криптографические методы защиты информации",
        "term": 8,
        "course_project": False
    },
    {
        "id": 16856,
        "name": "Криптографические методы и средства обеспечения информационной безопасности инфокоммуникаций",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34464,
        "name": "Криптографические средства обеспечения информационной безопасности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35549,
        "name": "Критическая теория цифровых медиа / Critical Theory of Digital Media",
        "term": 2,
        "course_project": False
    },
    {
        "id": 523,
        "name": "Культурология",
        "term": 4,
        "course_project": False
    },
    {
        "id": 523,
        "name": "Культурология",
        "term": 6,
        "course_project": False
    },
    {
        "id": 28031,
        "name": "Кураторство в научных музеях и центрах популяризации науки",
        "term": 2,
        "course_project": False
    },
    {
        "id": 40435,
        "name": "Курс по ревёрс-инжинирингу",
        "term": 2,
        "course_project": False
    },
    {
        "id": 40435,
        "name": "Курс по ревёрс-инжинирингу",
        "term": 4,
        "course_project": False
    },
    {
        "id": 40435,
        "name": "Курс по ревёрс-инжинирингу",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25556,
        "name": "Лаборатория академического письма",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25556,
        "name": "Лаборатория академического письма",
        "term": 6,
        "course_project": False
    },
    {
        "id": 18936,
        "name": "Лазерная технология в медико-биологических исследованиях",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34237,
        "name": "Лазерные конденсированные среды",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34237,
        "name": "Лазерные конденсированные среды",
        "term": 2,
        "course_project": True
    },
    {
        "id": 30891,
        "name": "Лазерные конденсированные среды / Laser condensed matter",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25559,
        "name": "Лазерные микро- и нанотехнологии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 276,
        "name": "Лазерные технологии",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25566,
        "name": "Лазерные технологии",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25570,
        "name": "Лазерные, нелинейные и регистрирующие среды в фемтотехнологиях",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25564,
        "name": "Лазерные, нелинейные, регистрирующие среды",
        "term": 6,
        "course_project": False
    },
    {
        "id": 18953,
        "name": "Лазеры для индустриальных применений",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25574,
        "name": "Линейная алгебра",
        "term": 2,
        "course_project": False
    },
    {
        "id": 36229,
        "name": "Линейная алгебра II",
        "term": 2,
        "course_project": False
    },
    {
        "id": 283,
        "name": "Логистика",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25582,
        "name": "Магистральные сети передачи данных",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32969,
        "name": "Майнинг социальных данных и методы их анализа / Social Data Mining and Analysis",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19730,
        "name": "Маркетинг в инновационных сферах и отраслях",
        "term": 8,
        "course_project": False
    },
    {
        "id": 32343,
        "name": "Маркетинг в системе здравоохранения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34857,
        "name": "Маркетинг новых вызовов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25593,
        "name": "Маркетинговые исследования на основе патентной информации",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25593,
        "name": "Маркетинговые исследования на основе патентной информации",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34405,
        "name": "Маркетинговые технологии в цифровой экономике",
        "term": 2,
        "course_project": False
    },
    {
        "id": 302,
        "name": "Математика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 302,
        "name": "Математика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25597,
        "name": "Математика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31368,
        "name": "Математика (базовый уровень)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31368,
        "name": "Математика (базовый уровень)",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31369,
        "name": "Математика (продвинутый уровень)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25598,
        "name": "Математическая лингвистика",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25600,
        "name": "Математическая логика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25600,
        "name": "Математическая логика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25600,
        "name": "Математическая логика",
        "term": 4,
        "course_project": True
    },
    {
        "id": 25599,
        "name": "Математическая статистика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25599,
        "name": "Математическая статистика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29649,
        "name": "Математическая физика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29649,
        "name": "Математическая физика",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25601,
        "name": "Математические методы в физике",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35989,
        "name": "Математические методы в физике / Mathematical Methods for Physicists",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32420,
        "name": "Математические методы в экономике",
        "term": 4,
        "course_project": False
    },
    {
        "id": 34921,
        "name": "Математические методы и модели принятия управленческих решений",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25614,
        "name": "Математические методы компьютерных технологий в научных исследованиях",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30872,
        "name": "Математические методы компьютерных технологий в научных исследованиях/Mathematical methods of computer technology in scientific research",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25616,
        "name": "Математические методы поиска технических решений",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25629,
        "name": "Математические модели и методология компьютерного моделирования",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25629,
        "name": "Математические модели и методология компьютерного моделирования",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34690,
        "name": "Математические модели исторических процессов",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25627,
        "name": "Математические модели комплексов программ",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32152,
        "name": "Математические основы криптологии",
        "term": 4,
        "course_project": False
    },
    {
        "id": 7066,
        "name": "Математические основы преобразования информации",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25633,
        "name": "Математические основы проектирования баз данных",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25633,
        "name": "Математические основы проектирования баз данных",
        "term": 6,
        "course_project": True
    },
    {
        "id": 25634,
        "name": "Математические основы теории оценивания",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25634,
        "name": "Математические основы теории оценивания",
        "term": 6,
        "course_project": True
    },
    {
        "id": 25594,
        "name": "Математический анализ",
        "term": 2,
        "course_project": False
    },
    {
        "id": 36230,
        "name": "Математический анализ II",
        "term": 2,
        "course_project": False
    },
    {
        "id": 36955,
        "name": "Математический анализ III",
        "term": 4,
        "course_project": False
    },
    {
        "id": 36590,
        "name": "Математическое и имитационное моделирование",
        "term": 2,
        "course_project": False
    },
    {
        "id": 36590,
        "name": "Математическое и имитационное моделирование",
        "term": 2,
        "course_project": True
    },
    {
        "id": 28010,
        "name": "Математическое и иммитационное моделирование",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25623,
        "name": "Математическое моделирование",
        "term": 6,
        "course_project": False
    },
    {
        "id": 30958,
        "name": "Математическое моделирование биотехнологических процессов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25619,
        "name": "Математическое моделирование для анализа пространственной информации",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25619,
        "name": "Математическое моделирование для анализа пространственной информации",
        "term": 2,
        "course_project": True
    },
    {
        "id": 25622,
        "name": "Математическое моделирование объектов и систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31525,
        "name": "Математическое моделирование систем генерации холода и теплоты",
        "term": 2,
        "course_project": False
    },
    {
        "id": 7070,
        "name": "Математическое моделирование систем специального назначения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25625,
        "name": "Математическое моделирование физических процессов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25625,
        "name": "Математическое моделирование физических процессов",
        "term": 2,
        "course_project": True
    },
    {
        "id": 25606,
        "name": "Материаловедение",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31615,
        "name": "Материалы для оборудования низкотемпературной техники",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25596,
        "name": "Материалы для фото- и оптоэлектроники",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25596,
        "name": "Материалы для фото- и оптоэлектроники",
        "term": 2,
        "course_project": True
    },
    {
        "id": 31540,
        "name": "Материалы для фото- и оптоэлектроники / Materials for Photo- and Optoelectronics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31540,
        "name": "Материалы для фото- и оптоэлектроники / Materials for Photo- and Optoelectronics",
        "term": 2,
        "course_project": True
    },
    {
        "id": 27179,
        "name": "Материалы зеленой энергетики и биомедицины",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25607,
        "name": "Материалы и технологии фотоники",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25607,
        "name": "Материалы и технологии фотоники",
        "term": 6,
        "course_project": False
    },
    {
        "id": 34948,
        "name": "Материалы новой электроники",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34753,
        "name": "Матричные вычисления",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25639,
        "name": "Машинное обучение",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25642,
        "name": "Машинное обучение и анализ данных",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31954,
        "name": "Машинное обучение и анализ данных",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34485,
        "name": "Машинное обучение и нейронные сети",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31520,
        "name": "Машины и системы низкопотенциальной энергетики",
        "term": 2,
        "course_project": False
    },
    {
        "id": 29066,
        "name": "Медицинская статистика / Medical statistics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 5320,
        "name": "Международная логистика",
        "term": 8,
        "course_project": False
    },
    {
        "id": 7290,
        "name": "Международные стандарты финансовой отчетности",
        "term": 8,
        "course_project": False
    },
    {
        "id": 7290,
        "name": "Международные стандарты финансовой отчетности",
        "term": 10,
        "course_project": False
    },
    {
        "id": 31044,
        "name": "Менеджмент в профессиональной деятельности",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25656,
        "name": "Метагеномика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31425,
        "name": "Метадизайн: дизайн-прогнозирование (смешанное обучение)/ Metadesign: Design Forecasting (blended learning)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34630,
        "name": "Метадизайн: дизайн-прогнозирование / Metadesign: Design Forecasting",
        "term": 2,
        "course_project": False
    },
    {
        "id": 18688,
        "name": "Методика проектной работы",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34280,
        "name": "Методология городских исследований",
        "term": 2,
        "course_project": False
    },
    {
        "id": 18764,
        "name": "Методология и практика чистого производства",
        "term": 8,
        "course_project": False
    },
    {
        "id": 30849,
        "name": "Методология научных и инженерных исследований",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25713,
        "name": "Методология научных исследований",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31004,
        "name": "Методология научных исследований макро- и микронутриентов, биологических систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31021,
        "name": "Методология обработки и оформления результатов научных исследований",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25747,
        "name": "Методология организации проектирования и разработки информационных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25718,
        "name": "Методология программной инженерии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31007,
        "name": "Методология производства пищевых систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25752,
        "name": "Методология разработки нормативно-технической документации на мясоперерабатывающих предприятиях",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25753,
        "name": "Методология разработки нормативно-технической документации на рыбоперерабатывающих предприятиях",
        "term": 6,
        "course_project": False
    },
    {
        "id": 37450,
        "name": "Методология трансляционных исследований",
        "term": 2,
        "course_project": False
    },
    {
        "id": 37449,
        "name": "Методология трансляционных исследований / Methodology of translational research",
        "term": 2,
        "course_project": False
    },
    {
        "id": 5214,
        "name": "Методология чистого производства",
        "term": 8,
        "course_project": False
    },
    {
        "id": 5214,
        "name": "Методология чистого производства",
        "term": 10,
        "course_project": False
    },
    {
        "id": 25657,
        "name": "Методы адаптивной обработки речевых сигналов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25657,
        "name": "Методы адаптивной обработки речевых сигналов",
        "term": 2,
        "course_project": True
    },
    {
        "id": 31581,
        "name": "Методы в наномедицине/ Methods in nanomedicine",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31581,
        "name": "Методы в наномедицине/ Methods in nanomedicine",
        "term": 2,
        "course_project": True
    },
    {
        "id": 31537,
        "name": "Методы диагностики наноматериалов / Characterization techniques for Nanomaterials",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25659,
        "name": "Методы и задачи обработки навигационной информации",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25659,
        "name": "Методы и задачи обработки навигационной информации",
        "term": 2,
        "course_project": True
    },
    {
        "id": 31570,
        "name": "Методы и задачи обработки навигационной информации / Approaches to design of estimation algorithms for processing of navigation data",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31570,
        "name": "Методы и задачи обработки навигационной информации / Approaches to design of estimation algorithms for processing of navigation data",
        "term": 2,
        "course_project": True
    },
    {
        "id": 29709,
        "name": "Методы и инструменты безопасной разработки программного обеспечения",
        "term": 6,
        "course_project": False
    },
    {
        "id": 32378,
        "name": "Методы и инструменты реинжиниринга",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28215,
        "name": "Методы и модели многомерного анализа данных / Methods and models for multivariate data analysis",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34420,
        "name": "Методы и средства контроля загрязнений окружающей среды нефтью и нефтепродуктами",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19648,
        "name": "Методы и средства контроля технического состояния холодильных агрегатов автотранспортных средств",
        "term": 10,
        "course_project": False
    },
    {
        "id": 25676,
        "name": "Методы и средства обеспечения информационной безопасности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27332,
        "name": "Методы и средства обеспечения информационной безопасности инфокоммуникаций",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34414,
        "name": "Методы и средства обеспечения информационной безопасности инфокоммуникаций / Informational security of info-communication",
        "term": 2,
        "course_project": False
    },
    {
        "id": 7071,
        "name": "Методы и средства обработки данных систем специального назначения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 32112,
        "name": "Методы и средства программной инженерии",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25707,
        "name": "Методы и техника физического эксперимента",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25707,
        "name": "Методы и техника физического эксперимента",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34633,
        "name": "Методы и техника физического эксперимента / Methods and Techniques of Physical Experiment",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34633,
        "name": "Методы и техника физического эксперимента / Methods and Techniques of Physical Experiment",
        "term": 2,
        "course_project": True
    },
    {
        "id": 25686,
        "name": "Методы и технологии системного анализа",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25686,
        "name": "Методы и технологии системного анализа",
        "term": 2,
        "course_project": True
    },
    {
        "id": 6868,
        "name": "Методы и устройства испытаний электронно-вычислительных средств",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25728,
        "name": "Методы искусственного интеллекта",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25728,
        "name": "Методы искусственного интеллекта",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25679,
        "name": "Методы исследований и контроль качества материалов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31403,
        "name": "Методы исследования бизнес-информационных систем / Research Methods of Business Information Systems",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25705,
        "name": "Методы исследования региональной экономики",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25681,
        "name": "Методы исследования систем управления",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34438,
        "name": "Методы исследования тепло- и электрофизических свойств материалов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34439,
        "name": "Методы исследования тепло- и электрофизических свойств материалов / Research Methods of Thermal and Electrophysical Properties of Materials",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30923,
        "name": "Методы квантовой химии / Methods of Quantum Chemistry",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34455,
        "name": "Методы компьютерного моделирования / Methods of computer simulation",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25690,
        "name": "Методы контроля оптических элементов и систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34498,
        "name": "Методы контроля оптических элементов и систем / \nTesting methods for optical elements and systems",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25729,
        "name": "Методы криптографии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25729,
        "name": "Методы криптографии",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25693,
        "name": "Методы математического моделирования процесса проектирования электронных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25737,
        "name": "Методы машинного обучения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33267,
        "name": "Методы машинного обучения / Machine learning",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25695,
        "name": "Методы моделирования и оптимизации в инфокоммуникационных системах",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25699,
        "name": "Методы обработки изображений и спектров",
        "term": 2,
        "course_project": False
    },
    {
        "id": 331,
        "name": "Методы оптимизации",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25730,
        "name": "Методы оптимизации",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25730,
        "name": "Методы оптимизации",
        "term": 6,
        "course_project": False
    },
    {
        "id": 33261,
        "name": "Методы оптимизации и оптимальное управление /Optimization Method and Optimal Control",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25845,
        "name": "Методы оценки количественных и качественных параметров оптико-цифровых систем и их компонентов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25749,
        "name": "Методы передачи, приема и обработки информации",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31617,
        "name": "Методы построения уравнений состояния вещества",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25721,
        "name": "Методы расчета глобальной освещенности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 6728,
        "name": "Методы расчета оптических систем",
        "term": 8,
        "course_project": False
    },
    {
        "id": 8288,
        "name": "Методы расчета теплофизических свойств веществ",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34018,
        "name": "Методы решения обратных задач",
        "term": 8,
        "course_project": False
    },
    {
        "id": 27339,
        "name": "Методы сбора и обработки городских данных",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27339,
        "name": "Методы сбора и обработки городских данных",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34295,
        "name": "Методы сбора и обработки данных о городских территориях",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34295,
        "name": "Методы сбора и обработки данных о городских территориях",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34658,
        "name": "Методы сетевого анализа",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25763,
        "name": "Методы статистической обработки экспериментальных данных",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25725,
        "name": "Методы техники управления роботами",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25743,
        "name": "Методы трёхмерного моделирования",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25743,
        "name": "Методы трёхмерного моделирования",
        "term": 6,
        "course_project": True
    },
    {
        "id": 25731,
        "name": "Методы трансляции",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25731,
        "name": "Методы трансляции",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25764,
        "name": "Методы управления качеством при проектировании и эксплуатации автоматизированных систем управления",
        "term": 2,
        "course_project": False
    },
    {
        "id": 6767,
        "name": "Методы управления параметрами лазерного излучения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 31389,
        "name": "Методы хранения данных и бизнес-анализ (часть 1) / Data Warehouse Techniques and Business Intelligence (part 1)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31395,
        "name": "Методы хранения данных и бизнес-анализ (часть 2) / Data Warehouse Techniques and Business Intelligence (part 2)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25757,
        "name": "Метрологическое обеспечение высокотехнологичного сектора экономики",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25698,
        "name": "Метрологическое обеспечение измерений, контроля и диагностики",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25758,
        "name": "Метрологическое обеспечение при проектировании оптико-цифровых систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25762,
        "name": "Метрологическое обеспечение техносферной безопасности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25760,
        "name": "Метрология",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25760,
        "name": "Метрология",
        "term": 6,
        "course_project": False
    },
    {
        "id": 34525,
        "name": "Метрология и стандартизация в светотехнике",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34526,
        "name": "Метрология и стандартизация в светотехнике / Metrology and standards in light engineering",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25756,
        "name": "Метрология и требования стандартизации в инфокоммуникационных системах",
        "term": 6,
        "course_project": False
    },
    {
        "id": 5912,
        "name": "Метрология оптико-электронного приборостроения",
        "term": 10,
        "course_project": False
    },
    {
        "id": 5756,
        "name": "Метрология, стандартизация и сертификация",
        "term": 8,
        "course_project": False
    },
    {
        "id": 30479,
        "name": "Механика деформируемых тел",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25769,
        "name": "Механика жидкости и газа",
        "term": 6,
        "course_project": False
    },
    {
        "id": 344,
        "name": "Механика сплошных сред",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25772,
        "name": "Микро- и наносенсорика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28256,
        "name": "Микробиологические основы биотехнологии / Microbial Fundamentals of Biotechnology",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34210,
        "name": "Микробиологическое качество и контроль/Microbiological Quality and Safety",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31578,
        "name": "Микроконтроллерные системы / Microcontroller Systems",
        "term": 2,
        "course_project": False
    },
    {
        "id": 5240,
        "name": "Микропроцессорные системы контроля и управления",
        "term": 10,
        "course_project": False
    },
    {
        "id": 27290,
        "name": "Микропроцессорные системы управления",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27290,
        "name": "Микропроцессорные системы управления",
        "term": 2,
        "course_project": True
    },
    {
        "id": 25782,
        "name": "Мировая художественная культура и дизайн",
        "term": 6,
        "course_project": False
    },
    {
        "id": 361,
        "name": "Мировая экономика",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34283,
        "name": "Мировые практики проектирования общественных пространств",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25786,
        "name": "Многопоточное программирование",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25786,
        "name": "Многопоточное программирование",
        "term": 6,
        "course_project": False
    },
    {
        "id": 30155,
        "name": "Мобильная разработка",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31401,
        "name": "Модели бизнес-процессов и сервисов / Models for Business Processes and Services",
        "term": 2,
        "course_project": False
    },
    {
        "id": 386,
        "name": "Моделирование",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25793,
        "name": "Моделирование динамических систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25793,
        "name": "Моделирование динамических систем",
        "term": 6,
        "course_project": False
    },
    {
        "id": 27288,
        "name": "Моделирование и управление в киберфизических системах",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34594,
        "name": "Моделирование и управление движением надводных судов/Modeling and control of the movement of surface ships",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25813,
        "name": "Моделирование и управление робототехническими системами",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25813,
        "name": "Моделирование и управление робототехническими системами",
        "term": 2,
        "course_project": True
    },
    {
        "id": 31335,
        "name": "Моделирование и управление робототехническими системами / Modeling and Control of Robotic Systems",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31335,
        "name": "Моделирование и управление робототехническими системами / Modeling and Control of Robotic Systems",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34551,
        "name": "Моделирование и управление техническими системами",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25795,
        "name": "Моделирование инфокоммуникационных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 21536,
        "name": "Моделирование информационной безопасности мультиагентных систем",
        "term": 8,
        "course_project": False
    },
    {
        "id": 31156,
        "name": "Моделирование логистической деятельности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34934,
        "name": "Моделирование логистической деятельности / Logistics Modelling in Foodtech",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34603,
        "name": "Моделирование материалов и устройств 2 / Materials and Devices simulation 2",
        "term": 2,
        "course_project": False
    },
    {
        "id": 1904,
        "name": "Моделирование оптических материалов и процессов",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25804,
        "name": "Моделирование оптических материалов и процессов",
        "term": 6,
        "course_project": False
    },
    {
        "id": 4061,
        "name": "Моделирование оптических систем",
        "term": 8,
        "course_project": False
    },
    {
        "id": 6733,
        "name": "Моделирование процессов в оптико-электронных приборах и системах",
        "term": 8,
        "course_project": False
    },
    {
        "id": 31582,
        "name": "Моделирование процессов и систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31582,
        "name": "Моделирование процессов и систем",
        "term": 2,
        "course_project": True
    },
    {
        "id": 25807,
        "name": "Моделирование процессов технического творчества",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27303,
        "name": "Моделирование ресурсосберегающих процессов в биотехнологии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27303,
        "name": "Моделирование ресурсосберегающих процессов в биотехнологии",
        "term": 2,
        "course_project": True
    },
    {
        "id": 30468,
        "name": "Моделирование систем и объектов управления",
        "term": 6,
        "course_project": False
    },
    {
        "id": 383,
        "name": "Моделирование систем управления",
        "term": 8,
        "course_project": False
    },
    {
        "id": 383,
        "name": "Моделирование систем управления",
        "term": 10,
        "course_project": False
    },
    {
        "id": 25801,
        "name": "Моделирование сложных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27362,
        "name": "Моделирование температурных и электрических полей в термоэлектрических системах",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27362,
        "name": "Моделирование температурных и электрических полей в термоэлектрических системах",
        "term": 2,
        "course_project": True
    },
    {
        "id": 27690,
        "name": "Моделирование температурных и электрических полей в термоэлектрических системах/Modeling of Thermal and Electric Fields in Thermoelectric Systems",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27690,
        "name": "Моделирование температурных и электрических полей в термоэлектрических системах/Modeling of Thermal and Electric Fields in Thermoelectric Systems",
        "term": 2,
        "course_project": True
    },
    {
        "id": 30847,
        "name": "Моделирование технических систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27397,
        "name": "Моделирование формирования оптического изображения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30611,
        "name": "Моделирование формирования оптического изображения / Optical image modeling",
        "term": 2,
        "course_project": False
    },
    {
        "id": 7058,
        "name": "Моделирование энерго- и ресурсосберегающих процессов в химической технологии, нефтехимии и биотехнологии",
        "term": 10,
        "course_project": False
    },
    {
        "id": 19219,
        "name": "Модуляция оптического и лазерного излучения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25830,
        "name": "Молекулярная биология",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34021,
        "name": "Молекулярная динамика и метод Монте-Карло",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25825,
        "name": "Молекулярная онкология/ Molecular Oncology",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25833,
        "name": "Молекулярная физика и спектроскопия",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25829,
        "name": "Молекулярная филогенетика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25828,
        "name": "Молекулярное моделирование биополимеров",
        "term": 6,
        "course_project": False
    },
    {
        "id": 7563,
        "name": "Монтаж и наладка холодильных систем",
        "term": 8,
        "course_project": False
    },
    {
        "id": 17931,
        "name": "Монтаж и эксплуатация систем управления",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25847,
        "name": "Мультимедиа технологии",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25848,
        "name": "Мультимедийная научная журналистика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34152,
        "name": "Мышление (Мышление и научная рациональность)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34150,
        "name": "Мышление (Основные проблемы современного политического мышления)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35554,
        "name": "Мэппинг и геоинформационные системы в гуманитарных науках",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30391,
        "name": "Надежность изделий и систем",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25856,
        "name": "Наилучшие доступные технологии в производстве",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25856,
        "name": "Наилучшие доступные технологии в производстве",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34804,
        "name": "Наилучшие доступные технологии в производстве / The Best Available Technique in Production",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31561,
        "name": "Нанобиотехнологии/ Nanobiotechnologies",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25863,
        "name": "Наноплазмоника/ Nanoplasmonics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34276,
        "name": "Нанотехнологии в упаковке пищевых продуктов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25912,
        "name": "Нанотехнология фотонной записи брэгговских решеток в фоторефрактивные оптические волокна",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32729,
        "name": "Нанотехнология фотонной записи брэгговских решеток в фоторефрактивные оптические волокна / Nanotechnology of the photonic inscription of the Bragg gratings into photorefractive optical fibers",
        "term": 2,
        "course_project": False
    },
    {
        "id": 6784,
        "name": "Нанофотоника и наноплазмоника",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25870,
        "name": "Нанофотоника и наноплазмоника",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25875,
        "name": "Наука о данных",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25875,
        "name": "Наука о данных",
        "term": 6,
        "course_project": True
    },
    {
        "id": 31069,
        "name": "Наука, технологии и общество",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25876,
        "name": "Науки о Земле",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31071,
        "name": "Наукометрический анализ и картирование науки и технологий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34309,
        "name": "Научно-обоснованное проектирование пищевых композиций / Science-based design of the food composition",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34309,
        "name": "Научно-обоснованное проектирование пищевых композиций / Science-based design of the food composition",
        "term": 2,
        "course_project": True
    },
    {
        "id": 19326,
        "name": "Научные основы производства комбинированных рыбных продуктов",
        "term": 10,
        "course_project": False
    },
    {
        "id": 25877,
        "name": "Научные основы создания продуктов функционального назначения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30160,
        "name": "Научные семинары по биоинформатике",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31601,
        "name": "Научный поиск / Scientific Index Search",
        "term": 2,
        "course_project": False
    },
    {
        "id": 21809,
        "name": "Нейроинтерфейсы информационных систем",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25881,
        "name": "Нейроинтерфейсы информационных систем",
        "term": 6,
        "course_project": False
    },
    {
        "id": 402,
        "name": "Нелинейная оптика",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25886,
        "name": "Нелинейная оптика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34025,
        "name": "Нелинейная физика",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25888,
        "name": "Нелинейные и дискретные системы управления",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25888,
        "name": "Нелинейные и дискретные системы управления",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25895,
        "name": "Непрерывные математические модели",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25904,
        "name": "Нормативная документация по проектированию автоматизированных систем управления",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25907,
        "name": "Нормативно-правовая и техническая документация по эксплуатации автоматизированных систем управления",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25903,
        "name": "Нормативные документы и стандарты",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25903,
        "name": "Нормативные документы и стандарты",
        "term": 2,
        "course_project": True
    },
    {
        "id": 32669,
        "name": "Нормативы показателей качества сырья и продукции животного и растительного происхождения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25914,
        "name": "Обеспечение информационной безопасности мобильных устройств",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25914,
        "name": "Обеспечение информационной безопасности мобильных устройств",
        "term": 6,
        "course_project": True
    },
    {
        "id": 29600,
        "name": "Обеспечение качества и сертификация изделий",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31063,
        "name": "Обеспечение качества функционирования компьютерных систем",
        "term": 4,
        "course_project": False
    },
    {
        "id": 19688,
        "name": "Обеспечение устойчивого развития предпринимательских структур",
        "term": 8,
        "course_project": False
    },
    {
        "id": 29749,
        "name": "Облачные вычисления / Cloud Computing",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25920,
        "name": "Облачные технологии и услуги",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25921,
        "name": "Оборудование биотехнологических производств",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25923,
        "name": "Обработка естественного языка",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25924,
        "name": "Обработка и анализ данных",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27516,
        "name": "Обработка и анализ данных/ Data Processing and Analysis",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25927,
        "name": "Обработка изображений",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25928,
        "name": "Обработка навигационной информации",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34209,
        "name": "Обработка отходов в пищевой промышленности/Waste Management in Food Industry",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25932,
        "name": "Обработка результатов теплофизического эксперимента",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25931,
        "name": "Обработка сигналов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25931,
        "name": "Обработка сигналов",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25934,
        "name": "Обработка цифрового звука",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30150,
        "name": "Обучение с подкреплением",
        "term": 4,
        "course_project": False
    },
    {
        "id": 27568,
        "name": "Общая астрономия",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34513,
        "name": "Общая астрономия / General astronomy",
        "term": 2,
        "course_project": False
    },
    {
        "id": 1284,
        "name": "Общая и профессиональная педагогика",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25947,
        "name": "Общая и профессиональная педагогика",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25944,
        "name": "Общая физика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25951,
        "name": "Общая химическая технология",
        "term": 6,
        "course_project": False
    },
    {
        "id": 1111,
        "name": "Общая электротехника и электроника",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25949,
        "name": "Общественные пространства и городская культура",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25948,
        "name": "Общие принципы переработки молочного сырья",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25952,
        "name": "Объектно-ориентированное программирование",
        "term": 4,
        "course_project": False
    },
    {
        "id": 18828,
        "name": "Объемные компрессорные и расширительные машины",
        "term": 8,
        "course_project": False
    },
    {
        "id": 8213,
        "name": "Объемные компрессоры холодильных машин",
        "term": 10,
        "course_project": False
    },
    {
        "id": 25954,
        "name": "Онтологии и представление знаний",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34910,
        "name": "Операционное управление фондом",
        "term": 2,
        "course_project": False
    },
    {
        "id": 36210,
        "name": "Операционные исчисления",
        "term": 6,
        "course_project": False
    },
    {
        "id": 164,
        "name": "Операционные системы",
        "term": 6,
        "course_project": False
    },
    {
        "id": 25955,
        "name": "Операционные системы",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25955,
        "name": "Операционные системы",
        "term": 6,
        "course_project": False
    },
    {
        "id": 28669,
        "name": "Операционные системы / Operating systems",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31025,
        "name": "Операционные системы и среды",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25964,
        "name": "Оптика - 2 (Геометрическая оптика)",
        "term": 4,
        "course_project": False
    },
    {
        "id": 25965,
        "name": "Оптика - 3 (Оптика конденсированных сред)",
        "term": 4,
        "course_project": False
    },
    {
        "id": 34741,
        "name": "Оптика волноводов и резонаторов",
        "term": 6,
        "course_project": False
    },
    {
        "id": 29682,
        "name": "Оптика плазмы",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25962,
        "name": "Оптика твердого тела",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19450,
        "name": "Оптика фемтосекундных импульсов",
        "term": 8,
        "course_project": False
    },
    {
        "id": 1356,
        "name": "Оптико-информационные приборы",
        "term": 8,
        "course_project": False
    },
    {
        "id": 7086,
        "name": "Оптико-электронные приборы и системы измерения линейных и угловых перемещений",
        "term": 8,
        "course_project": False
    },
    {
        "id": 4124,
        "name": "Оптико-электронные системы измерения линейных и угловых перемещений",
        "term": 8,
        "course_project": False
    },
    {
        "id": 31622,
        "name": "Оптимизация компьютерных технологий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 184,
        "name": "Оптическая технология",
        "term": 6,
        "course_project": False
    },
    {
        "id": 7083,
        "name": "Оптические и оптико-электронные информационно-измерительные приборы и системы",
        "term": 8,
        "course_project": False
    },
    {
        "id": 29604,
        "name": "Оптические измерения",
        "term": 6,
        "course_project": False
    },
    {
        "id": 16231,
        "name": "Оптические технологии и материалы",
        "term": 6,
        "course_project": False
    },
    {
        "id": 1240,
        "name": "Оптическое материаловедение",
        "term": 6,
        "course_project": False
    },
    {
        "id": 1231,
        "name": "Оптоинформатика",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25980,
        "name": "Оптоинформационные материалы квантовой электроники и наноинформатики",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27291,
        "name": "Организационно-правовые аспекты информационной безопасности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 29278,
        "name": "Организационно-правовые аспекты информационной безопасности / Information security laws and regulations",
        "term": 2,
        "course_project": False
    },
    {
        "id": 4176,
        "name": "Организационное и правовое обеспечение информационной безопасности",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26003,
        "name": "Организационное и правовое обеспечение информационной безопасности",
        "term": 4,
        "course_project": False
    },
    {
        "id": 19149,
        "name": "Организационный конфликт-менеджмент",
        "term": 8,
        "course_project": False
    },
    {
        "id": 18793,
        "name": "Организация биотехнологических производств",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25988,
        "name": "Организация вычислительного процесса",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33268,
        "name": "Организация вычислительного процесса / Computational Process Organization",
        "term": 2,
        "course_project": False
    },
    {
        "id": 2899,
        "name": "Организация деятельности специалистов по таможенным операциям",
        "term": 8,
        "course_project": False
    },
    {
        "id": 35429,
        "name": "Организация добровольческой (волонтерской) деятельности и взаимодействие с социально ориентированными НКО",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35429,
        "name": "Организация добровольческой (волонтерской) деятельности и взаимодействие с социально ориентированными НКО",
        "term": 4,
        "course_project": False
    },
    {
        "id": 35429,
        "name": "Организация добровольческой (волонтерской) деятельности и взаимодействие с социально ориентированными НКО",
        "term": 6,
        "course_project": False
    },
    {
        "id": 35509,
        "name": "Организация добровольческой (волонтерской) деятельности и взаимодействие с социально ориентированными НКО",
        "term": 8,
        "course_project": False
    },
    {
        "id": 35509,
        "name": "Организация добровольческой (волонтерской) деятельности и взаимодействие с социально ориентированными НКО",
        "term": 10,
        "course_project": False
    },
    {
        "id": 2922,
        "name": "Организация и управление бизнес-процессами",
        "term": 8,
        "course_project": False
    },
    {
        "id": 21575,
        "name": "Организация и управление научно-исследовательской и опытно-конструкторской деятельностью",
        "term": 8,
        "course_project": False
    },
    {
        "id": 2304,
        "name": "Организация и управление службой защиты информации",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26007,
        "name": "Организация и управление службой информационной безопасности",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26007,
        "name": "Организация и управление службой информационной безопасности",
        "term": 6,
        "course_project": True
    },
    {
        "id": 27369,
        "name": "Организация измерений и законодательная метрология",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28592,
        "name": "Организация измерений и законодательная метрология / Organization of Measurements and Legal Metrology",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19140,
        "name": "Организация малого бизнеса",
        "term": 8,
        "course_project": False
    },
    {
        "id": 19140,
        "name": "Организация малого бизнеса",
        "term": 10,
        "course_project": False
    },
    {
        "id": 26015,
        "name": "Организация массовых мероприятий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26015,
        "name": "Организация массовых мероприятий",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26009,
        "name": "Организация обеспечение информационной безопасности мобильных устройств",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26009,
        "name": "Организация обеспечение информационной безопасности мобильных устройств",
        "term": 6,
        "course_project": True
    },
    {
        "id": 34319,
        "name": "Организация проектирования и управления разработкой программного обеспечения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34319,
        "name": "Организация проектирования и управления разработкой программного обеспечения",
        "term": 2,
        "course_project": True
    },
    {
        "id": 32330,
        "name": "Организация проектной деятельности на транспорте",
        "term": 2,
        "course_project": False
    },
    {
        "id": 9900,
        "name": "Организация производства на пищевых предприятиях",
        "term": 8,
        "course_project": False
    },
    {
        "id": 30910,
        "name": "Организация производственных процессов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 18708,
        "name": "Организация процесса разработки программного обеспечения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 25999,
        "name": "Организация службы информационной безопасности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26013,
        "name": "Организация службы стандартизации на предприятии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25992,
        "name": "Организация чистого производства",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34970,
        "name": "Организация чистого производства / Organization of Cleaner production",
        "term": 2,
        "course_project": False
    },
    {
        "id": 25994,
        "name": "Органическая химия",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31621,
        "name": "Основные принципы современной физики",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31621,
        "name": "Основные принципы современной физики",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34800,
        "name": "Основные процессы и оборудование биотехнологических и химических производств",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35232,
        "name": "Основные процессы и оборудование биотехнологических и химических производств / Basic processes and equipment of biotechnological and chemical industries",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35811,
        "name": "Основы 3D-моделирования",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26019,
        "name": "Основы автоматизации технологических процессов",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26058,
        "name": "Основы автоматизированного проектирования",
        "term": 6,
        "course_project": False
    },
    {
        "id": 34408,
        "name": "Основы академической коммуникации",
        "term": 2,
        "course_project": False
    },
    {
        "id": 17780,
        "name": "Основы алгоритмизации и программирования",
        "term": 4,
        "course_project": False
    },
    {
        "id": 28254,
        "name": "Основы биотехнологии дрожжей / Basics of Yeast Biotechnology",
        "term": 2,
        "course_project": False
    },
    {
        "id": 40434,
        "name": "Основы боевой (общей) алгебры II",
        "term": 4,
        "course_project": False
    },
    {
        "id": 40433,
        "name": "Основы боевой линейной алгебры I",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32142,
        "name": "Основы веб-вёрстки",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26026,
        "name": "Основы генетической инженерии/ Basics of genetic engineering",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26028,
        "name": "Основы дизайна компьютерных игр",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26062,
        "name": "Основы естественнонаучных процессов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 36991,
        "name": "Основы иммунологии/ Basics of Immunology",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19214,
        "name": "Основы информационных оптических технологий",
        "term": 6,
        "course_project": False
    },
    {
        "id": 30801,
        "name": "Основы кибербезопасности",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26051,
        "name": "Основы композиции",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26051,
        "name": "Основы композиции",
        "term": 6,
        "course_project": True
    },
    {
        "id": 26030,
        "name": "Основы компьютерного дизайна",
        "term": 4,
        "course_project": False
    },
    {
        "id": 33909,
        "name": "Основы компьютерного моделирования в электродинамике / Basics of computer modeling in electromagnetics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26031,
        "name": "Основы конструирования механизмов и машин",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26031,
        "name": "Основы конструирования механизмов и машин",
        "term": 6,
        "course_project": True
    },
    {
        "id": 6741,
        "name": "Основы конструирования оптико-электронных приборов и систем",
        "term": 6,
        "course_project": False
    },
    {
        "id": 7073,
        "name": "Основы конструирования оптико-электронных приборов и систем специального назначения",
        "term": 6,
        "course_project": False
    },
    {
        "id": 7073,
        "name": "Основы конструирования оптико-электронных приборов и систем специального назначения",
        "term": 6,
        "course_project": True
    },
    {
        "id": 6765,
        "name": "Основы конструирования оптических и лазерных приборов и систем",
        "term": 6,
        "course_project": False
    },
    {
        "id": 6862,
        "name": "Основы конструирования электронных средств",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31309,
        "name": "Основы криологии",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26033,
        "name": "Основы культивирования заквасочных микроорганизмов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 6730,
        "name": "Основы лазерной техники",
        "term": 6,
        "course_project": False
    },
    {
        "id": 6730,
        "name": "Основы лазерной техники",
        "term": 8,
        "course_project": False
    },
    {
        "id": 5335,
        "name": "Основы логистики",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26066,
        "name": "Основы математического моделирования",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26018,
        "name": "Основы математического моделирования оборудования систем производства и транспортирования углеводородных энергоносителей",
        "term": 6,
        "course_project": False
    },
    {
        "id": 19013,
        "name": "Основы математической физики",
        "term": 6,
        "course_project": False
    },
    {
        "id": 19455,
        "name": "Основы моделирования физических процессов",
        "term": 8,
        "course_project": False
    },
    {
        "id": 33511,
        "name": "Основы нанофотоники",
        "term": 8,
        "course_project": False
    },
    {
        "id": 31119,
        "name": "Основы научной визуализации и визуального сторителлинга",
        "term": 2,
        "course_project": False
    },
    {
        "id": 18765,
        "name": "Основы научной деятельности",
        "term": 8,
        "course_project": False
    },
    {
        "id": 35069,
        "name": "Основы научной деятельности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 2954,
        "name": "Основы научных исследований",
        "term": 8,
        "course_project": False
    },
    {
        "id": 18791,
        "name": "Основы научных исследований в биотехнологии и биоинженерии",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34710,
        "name": "Основы нефтегазового дела",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35578,
        "name": "Основы обработки естественного языка",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26042,
        "name": "Основы обработки мультимедийных данных",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26042,
        "name": "Основы обработки мультимедийных данных",
        "term": 6,
        "course_project": False
    },
    {
        "id": 6940,
        "name": "Основы оптики природных сред",
        "term": 8,
        "course_project": False
    },
    {
        "id": 1632,
        "name": "Основы оптоинформатики",
        "term": 8,
        "course_project": False
    },
    {
        "id": 7112,
        "name": "Основы организации применения систем специального назначения",
        "term": 10,
        "course_project": False
    },
    {
        "id": 31492,
        "name": "Основы препаративной химии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 1288,
        "name": "Основы прикладного телевидения",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31034,
        "name": "Основы проектирования баз данных",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31118,
        "name": "Основы проектирования биотехнологических предприятий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30392,
        "name": "Основы проектирования приборов и систем",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26075,
        "name": "Основы профессиональной деятельности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33205,
        "name": "Основы профессиональной деятельности / Computer Basics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 5348,
        "name": "Основы работоспособности технических систем",
        "term": 8,
        "course_project": False
    },
    {
        "id": 6953,
        "name": "Основы разработки компиляторов",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26096,
        "name": "Основы разработки программно-аппаратных средств",
        "term": 6,
        "course_project": False
    },
    {
        "id": 6947,
        "name": "Основы распределенных вычислений",
        "term": 6,
        "course_project": False
    },
    {
        "id": 30952,
        "name": "Основы расчета систем очистки газовоздушных выбросов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26055,
        "name": "Основы рисунка",
        "term": 6,
        "course_project": False
    },
    {
        "id": 34354,
        "name": "Основы робототехники",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34354,
        "name": "Основы робототехники",
        "term": 2,
        "course_project": True
    },
    {
        "id": 31583,
        "name": "Основы системного анализа",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26099,
        "name": "Основы современного естествознания и научной коммуникации",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28257,
        "name": "Основы спиртового брожения / Basics of Alcoholic Fermentation",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19005,
        "name": "Основы статистической физики",
        "term": 6,
        "course_project": False
    },
    {
        "id": 6879,
        "name": "Основы теории идентификации",
        "term": 8,
        "course_project": False
    },
    {
        "id": 29646,
        "name": "Основы теории кондиционирования воздуха",
        "term": 4,
        "course_project": False
    },
    {
        "id": 248,
        "name": "Основы теории управления",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26082,
        "name": "Основы теории эксперимента",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26044,
        "name": "Основы термодинамики и теплопередачи",
        "term": 2,
        "course_project": False
    },
    {
        "id": 18710,
        "name": "Основы тестирования программного обеспечения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26083,
        "name": "Основы технического зрения",
        "term": 6,
        "course_project": False
    },
    {
        "id": 27330,
        "name": "Основы технологии программно-конфигурируемых сетей",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34430,
        "name": "Основы технологии программно-конфигурируемых сетей / Software define networks basic",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30498,
        "name": "Основы технологий быстрого прототипирования",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26084,
        "name": "Основы транспортного планирования",
        "term": 2,
        "course_project": False
    },
    {
        "id": 5,
        "name": "Основы трибоники",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26106,
        "name": "Основы управления и эксплуатации сетей радиосвязи и радиодоступа",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26106,
        "name": "Основы управления и эксплуатации сетей радиосвязи и радиодоступа",
        "term": 6,
        "course_project": True
    },
    {
        "id": 9837,
        "name": "Основы устройства и эксплуатации инженерных сетей",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26107,
        "name": "Основы физики полупроводниковых лазеров",
        "term": 2,
        "course_project": False
    },
    {
        "id": 1975,
        "name": "Основы философии",
        "term": 6,
        "course_project": False
    },
    {
        "id": 34602,
        "name": "Основы финансовой грамотности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 1722,
        "name": "Основы фотоники",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26108,
        "name": "Основы цифрового производства",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26108,
        "name": "Основы цифрового производства",
        "term": 4,
        "course_project": False
    },
    {
        "id": 1976,
        "name": "Основы экономики",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34802,
        "name": "Основы экономики замкнутого цикла / The Basics of Circular Economy",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27356,
        "name": "Основы экономического анализа и экономики пространства",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30457,
        "name": "Основы электрических измерений",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26087,
        "name": "Основы электротехники",
        "term": 6,
        "course_project": False
    },
    {
        "id": 34877,
        "name": "Особенности регулирования новых рынков",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30629,
        "name": "Особенности формирования языковых профессиональных компетенций",
        "term": 6,
        "course_project": False
    },
    {
        "id": 5372,
        "name": "Оценка бизнеса",
        "term": 8,
        "course_project": False
    },
    {
        "id": 28292,
        "name": "Оценка восприятия (зрительное, когнитивное, эмоциональное) / Assessment of Perception (Visual, Cognitive, Emotional)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26119,
        "name": "Оценка жизненного цикла",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34805,
        "name": "Оценка жизненного цикла / Life Cycle Assessment",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32489,
        "name": "Оценка жизненного цикла продукции",
        "term": 2,
        "course_project": False
    },
    {
        "id": 21701,
        "name": "Оценка имущественного комплекса инновационных предприятий",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34905,
        "name": "Оценка проектов на новых рынках",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34895,
        "name": "Оценка стоимости проектов в секторе Life Sciences",
        "term": 2,
        "course_project": False
    },
    {
        "id": 6647,
        "name": "Оценка экономической эффективности",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34314,
        "name": "Оценка эффективности информатизации предприятия",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34318,
        "name": "Оценка эффективности программных продуктов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 18694,
        "name": "Оценка эффективности проекта",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26128,
        "name": "Пакеты прикладных программ",
        "term": 6,
        "course_project": False
    },
    {
        "id": 1923,
        "name": "Параллельное программирование",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26132,
        "name": "Параллельное программирование",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26134,
        "name": "Патентная информатика (Патентные ландшафты)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26135,
        "name": "Патентное право",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26136,
        "name": "Педагогический дизайн",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26141,
        "name": "Передовые материалы и технологии/ Advanced materials",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26141,
        "name": "Передовые материалы и технологии/ Advanced materials",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26139,
        "name": "Перспективные методы в химическом наноинжиниринге/ Advanced methods in chemical nanoengeneering",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26139,
        "name": "Перспективные методы в химическом наноинжиниринге/ Advanced methods in chemical nanoengeneering",
        "term": 2,
        "course_project": True
    },
    {
        "id": 5380,
        "name": "Пищевая биотехнология",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26154,
        "name": "Пищевая биотехнология",
        "term": 6,
        "course_project": False
    },
    {
        "id": 5381,
        "name": "Пищевая химия",
        "term": 10,
        "course_project": False
    },
    {
        "id": 26155,
        "name": "Пищевая химия",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26160,
        "name": "Планирование НИР и ОКР",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26164,
        "name": "Планирование эксперимента, методы анализа и обработки данных",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26165,
        "name": "Пластическая анатомия",
        "term": 6,
        "course_project": False
    },
    {
        "id": 5393,
        "name": "Поверхностные явления и дисперсные системы",
        "term": 10,
        "course_project": False
    },
    {
        "id": 32853,
        "name": "Подготовка выпускной квалификационной работы",
        "term": 6,
        "course_project": False
    },
    {
        "id": 32853,
        "name": "Подготовка выпускной квалификационной работы",
        "term": 8,
        "course_project": False
    },
    {
        "id": 11953,
        "name": "Подготовка и защита ВКР",
        "term": 8,
        "course_project": False
    },
    {
        "id": 32855,
        "name": "Подготовка к государственному демонстрационному экзамену",
        "term": 6,
        "course_project": False
    },
    {
        "id": 32855,
        "name": "Подготовка к государственному демонстрационному экзамену",
        "term": 8,
        "course_project": False
    },
    {
        "id": 28338,
        "name": "Подготовка к защите и защита ВКР",
        "term": 4,
        "course_project": False
    },
    {
        "id": 28328,
        "name": "Подготовка к защите и защита ВКР / Preparation and Thesis Defense",
        "term": 4,
        "course_project": False
    },
    {
        "id": 33262,
        "name": "Подготовка к защите и защита ВКР / Thesis Defence",
        "term": 4,
        "course_project": False
    },
    {
        "id": 33010,
        "name": "Подготовка к защите и защита ВКР/Master's Thesis",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31049,
        "name": "Поддержка и тестирование программных модулей",
        "term": 8,
        "course_project": False
    },
    {
        "id": 35291,
        "name": "Полимеры в регенеративной медицине",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26176,
        "name": "Популяционная и медицинская генетика/ Population and Medical Genetics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 5400,
        "name": "Поточно-технологические линии мясной промышленности",
        "term": 10,
        "course_project": False
    },
    {
        "id": 19296,
        "name": "Поточно-технологические линии хлебопекарных и кондитерских производств",
        "term": 10,
        "course_project": False
    },
    {
        "id": 26181,
        "name": "Правила и методики обследования предприятий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32365,
        "name": "Правовая защита и нормативное регулирование в креативных индустриях",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34867,
        "name": "Правовая защита и нормативное регулирование на новых рынках",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34860,
        "name": "Правовые аспекты в секторе ИКТ / Legal Matters in ICT",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26327,
        "name": "Правовые основы градостроительства и городского планирования",
        "term": 2,
        "course_project": False
    },
    {
        "id": 6673,
        "name": "Правовые основы интеллектуальной собственности",
        "term": 6,
        "course_project": False
    },
    {
        "id": 6673,
        "name": "Правовые основы интеллектуальной собственности",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26184,
        "name": "Правовые основы интеллектуальной собственности",
        "term": 4,
        "course_project": False
    },
    {
        "id": 13923,
        "name": "Практикум правоохранительной деятельности",
        "term": 8,
        "course_project": False
    },
    {
        "id": 27203,
        "name": "Практическая электроника",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32749,
        "name": "Практическая электроника / Practical electronics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26186,
        "name": "Практический русский язык (инженерно-технический профиль)",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26186,
        "name": "Практический русский язык (инженерно-технический профиль)",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26186,
        "name": "Практический русский язык (инженерно-технический профиль)",
        "term": 6,
        "course_project": True
    },
    {
        "id": 26188,
        "name": "Представление данных",
        "term": 6,
        "course_project": False
    },
    {
        "id": 10720,
        "name": "Прецизионные системы слежения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26197,
        "name": "Приближенные и качественные методы в физике",
        "term": 6,
        "course_project": False
    },
    {
        "id": 18980,
        "name": "Приводные системы в мехатронике",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26205,
        "name": "Прикладная информатика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 2128,
        "name": "Прикладная математика",
        "term": 6,
        "course_project": False
    },
    {
        "id": 34666,
        "name": "Прикладная математика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26199,
        "name": "Прикладная механика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26199,
        "name": "Прикладная механика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26199,
        "name": "Прикладная механика",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26200,
        "name": "Прикладная оптика",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26200,
        "name": "Прикладная оптика",
        "term": 6,
        "course_project": True
    },
    {
        "id": 26215,
        "name": "Прикладная статистика/ Applied Statistics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 80,
        "name": "Прикладная физика",
        "term": 8,
        "course_project": False
    },
    {
        "id": 32464,
        "name": "Прикладная экобиотехнология",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26207,
        "name": "Прикладное программирование",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26214,
        "name": "Прикладное программирование в технических системах",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26211,
        "name": "Прикладной искусственный интеллект",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34156,
        "name": "Прикладной искусственный интеллект (базовый уровень)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34157,
        "name": "Прикладной искусственный интеллект (базовый уровень) / Applied Artificial Intelligence (basic level)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34158,
        "name": "Прикладной искусственный интеллект (продвинутый уровень)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34160,
        "name": "Прикладной искусственный интеллект (продвинутый уровень) / Applied Artificial Intelligence (advanced level)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28209,
        "name": "Прикладной искусственный интеллект/Applied Artificial Intelligence",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26212,
        "name": "Прикладные исследования урбанизированных территорий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26212,
        "name": "Прикладные исследования урбанизированных территорий",
        "term": 2,
        "course_project": True
    },
    {
        "id": 27204,
        "name": "Применение нейронных сетей",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19074,
        "name": "Применение пищевых и биологически активных добавок",
        "term": 8,
        "course_project": False
    },
    {
        "id": 19074,
        "name": "Применение пищевых и биологически активных добавок",
        "term": 10,
        "course_project": False
    },
    {
        "id": 32327,
        "name": "Принципы биотехнологического производства",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32327,
        "name": "Принципы биотехнологического производства",
        "term": 2,
        "course_project": True
    },
    {
        "id": 27195,
        "name": "Принципы и методы светового моделирования",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27195,
        "name": "Принципы и методы светового моделирования",
        "term": 2,
        "course_project": True
    },
    {
        "id": 32318,
        "name": "Принципы машинного обучения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32318,
        "name": "Принципы машинного обучения",
        "term": 2,
        "course_project": True
    },
    {
        "id": 28262,
        "name": "Принципы микробиологических технологий / Principles of Microbiological Technologies",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26228,
        "name": "Принципы построения приборов ориентации",
        "term": 6,
        "course_project": False
    },
    {
        "id": 34282,
        "name": "Принципы проектирования урбанизированных территорий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34282,
        "name": "Принципы проектирования урбанизированных территорий",
        "term": 2,
        "course_project": True
    },
    {
        "id": 31423,
        "name": "Проблемно-ориентированный подход в проектировании световых решений/ Problem-Based Approach to Lighting Design Projects",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31423,
        "name": "Проблемно-ориентированный подход в проектировании световых решений/ Problem-Based Approach to Lighting Design Projects",
        "term": 2,
        "course_project": True
    },
    {
        "id": 32856,
        "name": "Проведение государственного демонстрационного экзамена",
        "term": 6,
        "course_project": False
    },
    {
        "id": 32856,
        "name": "Проведение государственного демонстрационного экзамена",
        "term": 8,
        "course_project": False
    },
    {
        "id": 6663,
        "name": "Прогнозирование систем \"оператор-машина\"",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26245,
        "name": "Программирование",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33195,
        "name": "Программирование / Programming",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34576,
        "name": "Программирование аппаратных решений",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34576,
        "name": "Программирование аппаратных решений",
        "term": 2,
        "course_project": True
    },
    {
        "id": 30379,
        "name": "Программирование встроенных систем",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26241,
        "name": "Программирование и основы алгоритмизации",
        "term": 6,
        "course_project": False
    },
    {
        "id": 6690,
        "name": "Программирование микроконтроллеров",
        "term": 8,
        "course_project": False
    },
    {
        "id": 6690,
        "name": "Программирование микроконтроллеров",
        "term": 10,
        "course_project": False
    },
    {
        "id": 28649,
        "name": "Программирование на Java",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27341,
        "name": "Программирование на языке Java",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35929,
        "name": "Программирование на языке Kotlin",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34347,
        "name": "Программирование на языке Python для научных задач / Scientific Python",
        "term": 2,
        "course_project": False
    },
    {
        "id": 18673,
        "name": "Программирование на языке Пролог",
        "term": 8,
        "course_project": False
    },
    {
        "id": 31029,
        "name": "Программирование на языке высокого уровня",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31029,
        "name": "Программирование на языке высокого уровня",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26248,
        "name": "Программирование систем управления",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26248,
        "name": "Программирование систем управления",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26342,
        "name": "Программируемая электроника на программируемых логических интегральных схемах",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26342,
        "name": "Программируемая электроника на программируемых логических интегральных схемах",
        "term": 2,
        "course_project": True
    },
    {
        "id": 32746,
        "name": "Программируемая электроника на программируемых логических интегральных схемах / FPGA based programmable electronics (онлайн-курс)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32746,
        "name": "Программируемая электроника на программируемых логических интегральных схемах / FPGA based programmable electronics (онлайн-курс)",
        "term": 2,
        "course_project": True
    },
    {
        "id": 17933,
        "name": "Программируемые логические контроллеры",
        "term": 8,
        "course_project": False
    },
    {
        "id": 33199,
        "name": "Программная инженерия / Software Engineering",
        "term": 4,
        "course_project": False
    },
    {
        "id": 30156,
        "name": "Программная инженерия больших данных",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26249,
        "name": "Программно-аппаратная защита информации",
        "term": 2,
        "course_project": False
    },
    {
        "id": 4174,
        "name": "Программно-аппаратные средства защиты информации",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26237,
        "name": "Программно-аппаратные средства защиты информации",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31442,
        "name": "Программное обеспечение автоматических систем и сервисов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26236,
        "name": "Программное обеспечение компьютерного проектирования оптико-цифровых систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26175,
        "name": "Программное обеспечение мобильных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32325,
        "name": "Прогрессивные материалы для печатной электроники",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28150,
        "name": "Проектирование ПО",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28150,
        "name": "Проектирование ПО",
        "term": 2,
        "course_project": True
    },
    {
        "id": 31058,
        "name": "Проектирование автоматизированных систем неразрушающего контроля",
        "term": 2,
        "course_project": False
    },
    {
        "id": 5414,
        "name": "Проектирование бизнеса",
        "term": 8,
        "course_project": False
    },
    {
        "id": 5414,
        "name": "Проектирование бизнеса",
        "term": 10,
        "course_project": False
    },
    {
        "id": 26281,
        "name": "Проектирование биомехатронных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31362,
        "name": "Проектирование биомехатронных систем / Biomechatronic Systems Development",
        "term": 2,
        "course_project": False
    },
    {
        "id": 18963,
        "name": "Проектирование в профессиональной деятельности",
        "term": 6,
        "course_project": False
    },
    {
        "id": 18963,
        "name": "Проектирование в профессиональной деятельности",
        "term": 8,
        "course_project": False
    },
    {
        "id": 18963,
        "name": "Проектирование в профессиональной деятельности",
        "term": 10,
        "course_project": False
    },
    {
        "id": 31352,
        "name": "Проектирование встраиваемых и киберфизических систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26282,
        "name": "Проектирование встраиваемых систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26282,
        "name": "Проектирование встраиваемых систем",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26261,
        "name": "Проектирование и анализ языков веб-решений",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26261,
        "name": "Проектирование и анализ языков веб-решений",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26268,
        "name": "Проектирование и поддержка компьютерных сетей",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26320,
        "name": "Проектирование и разработка компьютерных средств обучения",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26295,
        "name": "Проектирование и реализация баз данных",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26295,
        "name": "Проектирование и реализация баз данных",
        "term": 4,
        "course_project": False
    },
    {
        "id": 10108,
        "name": "Проектирование и технологическое оборудование хлебопекарных и кондитерских предприятий",
        "term": 8,
        "course_project": False
    },
    {
        "id": 10108,
        "name": "Проектирование и технологическое оборудование хлебопекарных и кондитерских предприятий",
        "term": 8,
        "course_project": True
    },
    {
        "id": 21630,
        "name": "Проектирование инновационного бизнеса",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26287,
        "name": "Проектирование инновационного бизнеса",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26287,
        "name": "Проектирование инновационного бизнеса",
        "term": 6,
        "course_project": True
    },
    {
        "id": 1594,
        "name": "Проектирование интегральных микросхем и микропроцессоров",
        "term": 8,
        "course_project": False
    },
    {
        "id": 6502,
        "name": "Проектирование интеллектуальных систем в управлении",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26289,
        "name": "Проектирование информационных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26289,
        "name": "Проектирование информационных систем",
        "term": 2,
        "course_project": True
    },
    {
        "id": 30843,
        "name": "Проектирование киберфизических систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30843,
        "name": "Проектирование киберфизических систем",
        "term": 2,
        "course_project": True
    },
    {
        "id": 30953,
        "name": "Проектирование компрессорного и детандерного оборудования для холодильной техники и пневматики",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30953,
        "name": "Проектирование компрессорного и детандерного оборудования для холодильной техники и пневматики",
        "term": 2,
        "course_project": True
    },
    {
        "id": 30946,
        "name": "Проектирование машин и аппаратов для компримирования и транспортировки различных сред",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26284,
        "name": "Проектирование механических систем",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26284,
        "name": "Проектирование механических систем",
        "term": 6,
        "course_project": True
    },
    {
        "id": 34555,
        "name": "Проектирование микропроцессорных средств измерений",
        "term": 2,
        "course_project": False
    },
    {
        "id": 20833,
        "name": "Проектирование приборов фотоники",
        "term": 8,
        "course_project": False
    },
    {
        "id": 1985,
        "name": "Проектирование программного обеспечения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26278,
        "name": "Проектирование систем на кристалле",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26278,
        "name": "Проектирование систем на кристалле",
        "term": 2,
        "course_project": True
    },
    {
        "id": 5416,
        "name": "Проектирование систем управления",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26285,
        "name": "Проектирование телекоммуникационных систем и сетей",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26285,
        "name": "Проектирование телекоммуникационных систем и сетей",
        "term": 2,
        "course_project": True
    },
    {
        "id": 30947,
        "name": "Проектирование тепломассообменных аппаратов систем жизнеобеспечения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26286,
        "name": "Проектирование технических средств охраны",
        "term": 6,
        "course_project": False
    },
    {
        "id": 22189,
        "name": "Проектирование холодильных систем",
        "term": 8,
        "course_project": False
    },
    {
        "id": 29421,
        "name": "Проектирование холодильных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 29421,
        "name": "Проектирование холодильных систем",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26300,
        "name": "Проектная деятельность",
        "term": 4,
        "course_project": False
    },
    {
        "id": 2374,
        "name": "Проектная документация",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26223,
        "name": "Проектная инженерия производства мучных и кондитерских изделий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19528,
        "name": "Проектное финансирование инновационного предпринимательства",
        "term": 10,
        "course_project": False
    },
    {
        "id": 26303,
        "name": "Проектный менеджмент",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26303,
        "name": "Проектный менеджмент",
        "term": 4,
        "course_project": False
    },
    {
        "id": 17937,
        "name": "Производственная (преддипломная) практика",
        "term": 10,
        "course_project": False
    },
    {
        "id": 35779,
        "name": "Производственная практика (осуществление интеграции программных модулей)",
        "term": 6,
        "course_project": False
    },
    {
        "id": 35779,
        "name": "Производственная практика (осуществление интеграции программных модулей)",
        "term": 8,
        "course_project": False
    },
    {
        "id": 35773,
        "name": "Производственная практика (преддипломная)",
        "term": 6,
        "course_project": False
    },
    {
        "id": 35773,
        "name": "Производственная практика (преддипломная)",
        "term": 8,
        "course_project": False
    },
    {
        "id": 35774,
        "name": "Производственная практика (разработка модулей программного обеспечения для компьютерных систем)",
        "term": 6,
        "course_project": False
    },
    {
        "id": 35774,
        "name": "Производственная практика (разработка модулей программного обеспечения для компьютерных систем)",
        "term": 8,
        "course_project": False
    },
    {
        "id": 35777,
        "name": "Производственная практика (сопровождение и обслуживание программного обеспечения компьютерных систем)",
        "term": 6,
        "course_project": False
    },
    {
        "id": 35777,
        "name": "Производственная практика (сопровождение и обслуживание программного обеспечения компьютерных систем)",
        "term": 8,
        "course_project": False
    },
    {
        "id": 24109,
        "name": "Производственная практика, информационно-аналитическая",
        "term": 8,
        "course_project": False
    },
    {
        "id": 23709,
        "name": "Производственная практика, научно-исследовательская",
        "term": 6,
        "course_project": False
    },
    {
        "id": 23613,
        "name": "Производственная практика, научно-исследовательская работа",
        "term": 4,
        "course_project": False
    },
    {
        "id": 23613,
        "name": "Производственная практика, научно-исследовательская работа",
        "term": 6,
        "course_project": False
    },
    {
        "id": 23613,
        "name": "Производственная практика, научно-исследовательская работа",
        "term": 10,
        "course_project": False
    },
    {
        "id": 23889,
        "name": "Производственная практика, по получению профессиональных умений и опыта профессиональной деятельности",
        "term": 8,
        "course_project": False
    },
    {
        "id": 23889,
        "name": "Производственная практика, по получению профессиональных умений и опыта профессиональной деятельности",
        "term": 10,
        "course_project": False
    },
    {
        "id": 23615,
        "name": "Производственная практика, преддипломная",
        "term": 4,
        "course_project": False
    },
    {
        "id": 23615,
        "name": "Производственная практика, преддипломная",
        "term": 8,
        "course_project": False
    },
    {
        "id": 23615,
        "name": "Производственная практика, преддипломная",
        "term": 10,
        "course_project": False
    },
    {
        "id": 23866,
        "name": "Производственная практика, проектная",
        "term": 6,
        "course_project": False
    },
    {
        "id": 23789,
        "name": "Производственная практика, проектно-конструкторская",
        "term": 6,
        "course_project": False
    },
    {
        "id": 23864,
        "name": "Производственная практика, производственно-технологическая",
        "term": 6,
        "course_project": False
    },
    {
        "id": 23864,
        "name": "Производственная практика, производственно-технологическая",
        "term": 8,
        "course_project": False
    },
    {
        "id": 29499,
        "name": "Производственная, консультационно-экспертная",
        "term": 4,
        "course_project": False
    },
    {
        "id": 28529,
        "name": "Производственная, научно-исследовательская",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28529,
        "name": "Производственная, научно-исследовательская",
        "term": 4,
        "course_project": False
    },
    {
        "id": 28529,
        "name": "Производственная, научно-исследовательская",
        "term": 6,
        "course_project": False
    },
    {
        "id": 29053,
        "name": "Производственная, научно-исследовательская / Research Internship",
        "term": 4,
        "course_project": False
    },
    {
        "id": 27111,
        "name": "Производственная, научно-исследовательская работа",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27111,
        "name": "Производственная, научно-исследовательская работа",
        "term": 4,
        "course_project": False
    },
    {
        "id": 28211,
        "name": "Производственная, научно-исследовательская работа / Research Internship",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28211,
        "name": "Производственная, научно-исследовательская работа / Research Internship",
        "term": 4,
        "course_project": False
    },
    {
        "id": 30109,
        "name": "Производственная, научно-исследовательская работа / Research Work",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30956,
        "name": "Производственная, научно-педагогическая",
        "term": 4,
        "course_project": False
    },
    {
        "id": 24108,
        "name": "Производственная, образовательно-проектировочная практика",
        "term": 8,
        "course_project": False
    },
    {
        "id": 29245,
        "name": "Производственная, организационно-управленческая",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29245,
        "name": "Производственная, организационно-управленческая",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31087,
        "name": "Производственная, организационно-управленческая, научно-педагогическая",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29488,
        "name": "Производственная, организационно-управленческая, экспериментально-исследовательская работа",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29449,
        "name": "Производственная, педагогическая",
        "term": 4,
        "course_project": False
    },
    {
        "id": 28337,
        "name": "Производственная, преддипломная",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29271,
        "name": "Производственная, преддипломная / Senior Internship",
        "term": 4,
        "course_project": False
    },
    {
        "id": 28563,
        "name": "Производственная, проектная",
        "term": 4,
        "course_project": False
    },
    {
        "id": 28552,
        "name": "Производственная, проектная/ Project Internship",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29304,
        "name": "Производственная, проектно-конструкторская",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29304,
        "name": "Производственная, проектно-конструкторская",
        "term": 6,
        "course_project": False
    },
    {
        "id": 24110,
        "name": "Производственная, проектно-предпринимательская практика",
        "term": 6,
        "course_project": False
    },
    {
        "id": 29247,
        "name": "Производственная, проектно-технологическая",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29526,
        "name": "Производственная, проектно-технологическая / Tech Project Internship",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29280,
        "name": "Производственная, производственно-технологическая",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29280,
        "name": "Производственная, производственно-технологическая",
        "term": 6,
        "course_project": False
    },
    {
        "id": 29329,
        "name": "Производственная, технологическая",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29329,
        "name": "Производственная, технологическая",
        "term": 6,
        "course_project": False
    },
    {
        "id": 28336,
        "name": "Производственная, технологическая (проектно-технологическая)",
        "term": 4,
        "course_project": False
    },
    {
        "id": 28336,
        "name": "Производственная, технологическая (проектно-технологическая)",
        "term": 6,
        "course_project": False
    },
    {
        "id": 35675,
        "name": "Производственная, технологическая (проектно-технологическая) / Industrial and Tech Internship",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29268,
        "name": "Производственная, технологическая (проектно-технологическая) / Tech Project Internship",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29430,
        "name": "Производственная, технологическая / Tech Internship",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29246,
        "name": "Производственная, эксплуатационная",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26317,
        "name": "Производственные киберфизические системы",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30469,
        "name": "Промышленная логистика",
        "term": 6,
        "course_project": False
    },
    {
        "id": 35029,
        "name": "Промышленная робототехника и мехатронные системы",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26321,
        "name": "Промышленная экология",
        "term": 6,
        "course_project": False
    },
    {
        "id": 30911,
        "name": "Промышленный интернет вещей и сервисов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31560,
        "name": "Протеомика/ Proteomics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27296,
        "name": "Протоколы информационной безопасности киберфизических систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26153,
        "name": "Процессы и аппараты защиты окружающей среды",
        "term": 6,
        "course_project": False
    },
    {
        "id": 34803,
        "name": "Процессы и технологии разделения и глубокой очистки загрязненных сред / Processes and Technologies for the Separation and Deep Purification of Contaminated Media",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26334,
        "name": "Процессы и устройства преобразования энергии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27361,
        "name": "Прямое преобразование энергии и возобновляемые источники энергии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27689,
        "name": "Прямое преобразование энергии и возобновляемые источники энергии / Direct Energy Conversion and Renewable Energy Sources",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34326,
        "name": "Психология взаимодействия горожан с городской средой",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26343,
        "name": "Психология визуального восприятия",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31046,
        "name": "Психология личности и профессиональное самоопределение",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31046,
        "name": "Психология личности и профессиональное самоопределение",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31046,
        "name": "Психология личности и профессиональное самоопределение",
        "term": 8,
        "course_project": False
    },
    {
        "id": 2932,
        "name": "Психология общения",
        "term": 6,
        "course_project": False
    },
    {
        "id": 2932,
        "name": "Психология общения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26344,
        "name": "Психология предпринимательства",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31045,
        "name": "Психология профессиональной адаптации",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31045,
        "name": "Психология профессиональной адаптации",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31045,
        "name": "Психология профессиональной адаптации",
        "term": 8,
        "course_project": False
    },
    {
        "id": 29678,
        "name": "Психология развития и профессиональное образование",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26347,
        "name": "Психология человеко-компьютерного взаимодействия",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35570,
        "name": "Публичные выступления и презентации, сторителлинг",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31592,
        "name": "Пьезоэлектрические исполнительные устройства",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31121,
        "name": "Работа с данными в биотехнологиях и медицине",
        "term": 2,
        "course_project": False
    },
    {
        "id": 37769,
        "name": "Радиочастотные системы МРТ",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26354,
        "name": "Развитие речи на материале научных технических текстов",
        "term": 6,
        "course_project": False
    },
    {
        "id": 34989,
        "name": "Разработка IDE",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28670,
        "name": "Разработка Web-приложений / Web Software Development",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26369,
        "name": "Разработка баз данных",
        "term": 6,
        "course_project": False
    },
    {
        "id": 18680,
        "name": "Разработка веб-приложений",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26376,
        "name": "Разработка и внедрение распределенных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26376,
        "name": "Разработка и внедрение распределенных систем",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34436,
        "name": "Разработка и расчет новых конструкций ферментаторов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34436,
        "name": "Разработка и расчет новых конструкций ферментаторов",
        "term": 2,
        "course_project": True
    },
    {
        "id": 21698,
        "name": "Разработка и сопровождение баз данных",
        "term": 8,
        "course_project": False
    },
    {
        "id": 18707,
        "name": "Разработка интеллектуальных систем",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26371,
        "name": "Разработка компиляторов",
        "term": 6,
        "course_project": False
    },
    {
        "id": 11602,
        "name": "Разработка мобильных приложений",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26367,
        "name": "Разработка мобильных приложений",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26367,
        "name": "Разработка мобильных приложений",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26368,
        "name": "Разработка мультимедийных приложений",
        "term": 6,
        "course_project": False
    },
    {
        "id": 19169,
        "name": "Разработка переносимых приложений",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34653,
        "name": "Разработка приложений на Java",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31048,
        "name": "Разработка программных модулей",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26360,
        "name": "Разработка социальных программ и проектов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26360,
        "name": "Разработка социальных программ и проектов",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26379,
        "name": "Разработка управляющих программ для станков с числовым программным управлением",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26379,
        "name": "Разработка управляющих программ для станков с числовым программным управлением",
        "term": 4,
        "course_project": True
    },
    {
        "id": 36629,
        "name": "Рамановское и Мандельштам- бриллюэновское рассеяния в оптических волокнах и их применение / Raman and Mandelstam- Brillouin scattering within optical fibers and its application",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35889,
        "name": "Рамановское и Мандельштам-бриллюэновское рассеяния в оптических волокнах и их применение",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30153,
        "name": "Распознавание и генерация речи",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26385,
        "name": "Распределенные алгоритмы и системы",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26385,
        "name": "Распределенные алгоритмы и системы",
        "term": 6,
        "course_project": False
    },
    {
        "id": 32577,
        "name": "Распределенные базы данных и знаний",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32577,
        "name": "Распределенные базы данных и знаний",
        "term": 2,
        "course_project": True
    },
    {
        "id": 35576,
        "name": "Распределенные системы / Distributed Systems",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30295,
        "name": "Распределенные системы хранения данных",
        "term": 6,
        "course_project": False
    },
    {
        "id": 34026,
        "name": "Распространение и прием радиоволн",
        "term": 8,
        "course_project": False
    },
    {
        "id": 6760,
        "name": "Расчет допусков на оптические элементы",
        "term": 8,
        "course_project": False
    },
    {
        "id": 27394,
        "name": "Расчет и автоматизация проектирования оптических систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34501,
        "name": "Расчет и автоматизация проектирования оптических систем / Optical system design",
        "term": 2,
        "course_project": False
    },
    {
        "id": 9703,
        "name": "Расчет и конструирование динамических компрессоров",
        "term": 8,
        "course_project": False
    },
    {
        "id": 8897,
        "name": "Расчет и конструирование объемных компрессоров",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26382,
        "name": "Расчет и проектирование машин и аппаратов систем жизнеобеспечения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26382,
        "name": "Расчет и проектирование машин и аппаратов систем жизнеобеспечения",
        "term": 2,
        "course_project": True
    },
    {
        "id": 9711,
        "name": "Регулирование и автоматизация криогенных машин и установок",
        "term": 8,
        "course_project": False
    },
    {
        "id": 18816,
        "name": "Регулирование и автоматизация машин и установок систем жизнеобеспечения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34945,
        "name": "Регулирование предпринимательства в сфере транспорта",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34366,
        "name": "Регулирование разработок в сфере Life Sciences",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31580,
        "name": "Реинжиниринг бизнес-процессов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 9834,
        "name": "Ремонт, монтаж и обслуживание машин и оборудования биотехнологий",
        "term": 8,
        "course_project": False
    },
    {
        "id": 31603,
        "name": "Реология",
        "term": 2,
        "course_project": False
    },
    {
        "id": 9772,
        "name": "Реология в производстве хлебобулочных и кондитерских изделий",
        "term": 8,
        "course_project": False
    },
    {
        "id": 20008,
        "name": "Ресурсосберегающие технологии при переработке растительного сырья",
        "term": 8,
        "course_project": False
    },
    {
        "id": 20008,
        "name": "Ресурсосберегающие технологии при переработке растительного сырья",
        "term": 10,
        "course_project": False
    },
    {
        "id": 30635,
        "name": "Речевая культура интернет-среды",
        "term": 6,
        "course_project": False
    },
    {
        "id": 1634,
        "name": "Русский язык",
        "term": 2,
        "course_project": False
    },
    {
        "id": 1634,
        "name": "Русский язык",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31348,
        "name": "САПР систем на кристалле",
        "term": 2,
        "course_project": False
    },
    {
        "id": 7664,
        "name": "Санитария и гигиена на пищевых предприятиях",
        "term": 10,
        "course_project": False
    },
    {
        "id": 13268,
        "name": "Санитария и гигиена на предприятиях бродильных производств",
        "term": 8,
        "course_project": False
    },
    {
        "id": 13268,
        "name": "Санитария и гигиена на предприятиях бродильных производств",
        "term": 10,
        "course_project": False
    },
    {
        "id": 9855,
        "name": "Санитария и гигиена предприятий молочной отрасли",
        "term": 8,
        "course_project": False
    },
    {
        "id": 19129,
        "name": "Санитария и гигиена при производстве мучных изделий",
        "term": 8,
        "course_project": False
    },
    {
        "id": 19129,
        "name": "Санитария и гигиена при производстве мучных изделий",
        "term": 10,
        "course_project": False
    },
    {
        "id": 10389,
        "name": "Санитария и гигиена при производстве хлебобулочных и кондитерских изделий",
        "term": 8,
        "course_project": False
    },
    {
        "id": 29997,
        "name": "Свет в искусстве и фотографии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32971,
        "name": "Световая культура / Light in Culture",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32970,
        "name": "Световые устройства и системы управления / Lighting Devices and Control Systems",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26428,
        "name": "Светодиодные нанотехнологии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30157,
        "name": "Семантика языков программирования",
        "term": 4,
        "course_project": False
    },
    {
        "id": 27178,
        "name": "Сенсорная фотоника",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27178,
        "name": "Сенсорная фотоника",
        "term": 2,
        "course_project": True
    },
    {
        "id": 30895,
        "name": "Сенсорная фотоника / Sensors photonics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30895,
        "name": "Сенсорная фотоника / Sensors photonics",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34355,
        "name": "Сенсоры в робототехнических системах",
        "term": 2,
        "course_project": False
    },
    {
        "id": 20842,
        "name": "Сенсоры и энкодеры в задачах фотоники",
        "term": 8,
        "course_project": False
    },
    {
        "id": 6952,
        "name": "Сервис-ориентированная архитектура",
        "term": 8,
        "course_project": False
    },
    {
        "id": 31390,
        "name": "Сервисно-ориентированные интеллектуальные системы (часть 1) / Service-oriented Intelligent Systems (part 1)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31393,
        "name": "Сервисно-ориентированные интеллектуальные системы (часть 2) / Service-oriented Intelligent Systems (part 2)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35681,
        "name": "Сервисно-ориентированные интеллектуальные системы (часть 3) / Service-oriented Intelligent Systems (part 3)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 1401,
        "name": "Сетевая экономика",
        "term": 8,
        "course_project": False
    },
    {
        "id": 6977,
        "name": "Сетевое системное администрирование",
        "term": 6,
        "course_project": False
    },
    {
        "id": 34403,
        "name": "Сетевые технологии в системах хранения данных",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30296,
        "name": "Сетевые технологии интернета вещей",
        "term": 6,
        "course_project": False
    },
    {
        "id": 2245,
        "name": "Сети ЭВМ и телекоммуникации",
        "term": 6,
        "course_project": False
    },
    {
        "id": 6677,
        "name": "Силовая электроника",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26444,
        "name": "Синтез распределенных регуляторов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 6670,
        "name": "Система менеджмента качества на предприятии",
        "term": 8,
        "course_project": False
    },
    {
        "id": 27376,
        "name": "Системная биология/ Systems Biology",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27376,
        "name": "Системная биология/ Systems Biology",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34189,
        "name": "Системная химия / System chemistry",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26467,
        "name": "Системное администрирование",
        "term": 6,
        "course_project": False
    },
    {
        "id": 16882,
        "name": "Системное программирование",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26468,
        "name": "Системное программное обеспечение",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26468,
        "name": "Системное программное обеспечение",
        "term": 6,
        "course_project": True
    },
    {
        "id": 6836,
        "name": "Системное программное обеспечение защищённых инфокоммуникационных систем",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26456,
        "name": "Системное проектирование оптико-электронных приборов и систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35671,
        "name": "Системное проектирование оптико-электронных приборов и систем / Digital signal processing in optoelectronics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26448,
        "name": "Системный анализ и моделирование информационных процессов и систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26447,
        "name": "Системный анализ и обработка информации",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26447,
        "name": "Системный анализ и обработка информации",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26463,
        "name": "Системный анализ и принятие решений",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31190,
        "name": "Системный анализ территорий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26459,
        "name": "Системы автоматизированного проектирования",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26459,
        "name": "Системы автоматизированного проектирования",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26459,
        "name": "Системы автоматизированного проектирования",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31330,
        "name": "Системы автоматизированного проектирования / Computer Aided Design",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26446,
        "name": "Системы автоматизированного проектирования электронных схем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26446,
        "name": "Системы автоматизированного проектирования электронных схем",
        "term": 2,
        "course_project": True
    },
    {
        "id": 32750,
        "name": "Системы автоматизированного проектирования электронных схем / CAD systems for electronic circuits",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26476,
        "name": "Системы ввода-вывода",
        "term": 6,
        "course_project": False
    },
    {
        "id": 18665,
        "name": "Системы ввода/вывода",
        "term": 8,
        "course_project": False
    },
    {
        "id": 19033,
        "name": "Системы записи и воспроизведения информации",
        "term": 8,
        "course_project": False
    },
    {
        "id": 19208,
        "name": "Системы и архитектуры резервного копирования и восстановления",
        "term": 8,
        "course_project": False
    },
    {
        "id": 30915,
        "name": "Системы инженерного анализа и компьютерного моделирования",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26477,
        "name": "Системы искусственного интеллекта",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26480,
        "name": "Системы компьютерного моделирования и инженерный анализ",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26481,
        "name": "Системы компьютерной обработки изображений",
        "term": 6,
        "course_project": False
    },
    {
        "id": 9882,
        "name": "Системы кондиционирования",
        "term": 8,
        "course_project": False
    },
    {
        "id": 18839,
        "name": "Системы охлаждения и термостатирования",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26470,
        "name": "Системы охранной сигнализации",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31331,
        "name": "Системы очувствления роботов / Robot Sensing Systems",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27194,
        "name": "Системы сжижения, хранения и транспортирования природного газа",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26472,
        "name": "Системы сквозного проектирования",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26474,
        "name": "Системы телевизионного наблюдения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26474,
        "name": "Системы телевизионного наблюдения",
        "term": 2,
        "course_project": True
    },
    {
        "id": 30409,
        "name": "Системы технического зрения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34521,
        "name": "Системы технического зрения / Systems of technical vision",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19088,
        "name": "Системы управления биотехнологическими комплексами",
        "term": 8,
        "course_project": False
    },
    {
        "id": 5503,
        "name": "Системы управления химико-технологическими процессами",
        "term": 8,
        "course_project": False
    },
    {
        "id": 5503,
        "name": "Системы управления химико-технологическими процессами",
        "term": 10,
        "course_project": False
    },
    {
        "id": 26492,
        "name": "Служебная интеллектуальная собственность",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34566,
        "name": "Случайные процессы и статистика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26530,
        "name": "Современная теория систем управления",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28789,
        "name": "Современная теория систем управления / Modern Control Theory",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31549,
        "name": "Современные биотехнологии сыров и сырных продуктов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34589,
        "name": "Современные инерциальные чувствительные элементы / Modern inertial sensors",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32629,
        "name": "Современные криптографические алгоритмы / Modern cryptographic algorithms",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27294,
        "name": "Современные криптографические алгоритмы в киберфизических системах",
        "term": 2,
        "course_project": False
    },
    {
        "id": 29217,
        "name": "Современные методы анализа систем информационной безопасности в киберфизических системах",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32110,
        "name": "Современные методы бизнес-аналитики",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26493,
        "name": "Современные методы испытаний биотехнологических процессов, производств и продукции",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27372,
        "name": "Современные методы исследования материалов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27372,
        "name": "Современные методы исследования материалов",
        "term": 2,
        "course_project": True
    },
    {
        "id": 28594,
        "name": "Современные методы исследования материалов / Modern Methods of Materials Analysis",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28594,
        "name": "Современные методы исследования материалов / Modern Methods of Materials Analysis",
        "term": 2,
        "course_project": True
    },
    {
        "id": 6792,
        "name": "Современные методы исследования оптических материалов",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26497,
        "name": "Современные методы теории управления в биотехнологической промышленности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26497,
        "name": "Современные методы теории управления в биотехнологической промышленности",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34273,
        "name": "Современные нанокомпозитные материалы",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31539,
        "name": "Современные направления производства белковых продуктов на молочной основе",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26507,
        "name": "Современные образовательные технологии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31402,
        "name": "Современные проблемы информационных систем бизнеса / Contemporary Subjects in Business Information Systems",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32229,
        "name": "Современные проблемы науки и техники",
        "term": 4,
        "course_project": False
    },
    {
        "id": 34580,
        "name": "Современные проблемы оптических материалов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31510,
        "name": "Современные проблемы оптических материалов / Advanced problems of optical materials",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26503,
        "name": "Современные проблемы прикладной математики и информатики",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26503,
        "name": "Современные проблемы прикладной математики и информатики",
        "term": 2,
        "course_project": True
    },
    {
        "id": 6038,
        "name": "Современные проблемы экологии в машиностроении",
        "term": 10,
        "course_project": False
    },
    {
        "id": 27407,
        "name": "Современные рыночные технологии получения наноструктурированных материалов/ Modern technologies for manufacturing nanoscale objects and materials",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27230,
        "name": "Современные системы пакетной коммутации",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27230,
        "name": "Современные системы пакетной коммутации",
        "term": 2,
        "course_project": True
    },
    {
        "id": 32730,
        "name": "Современные системы пакетной коммутации / Up-to-date systems of packet switching",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32730,
        "name": "Современные системы пакетной коммутации / Up-to-date systems of packet switching",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26527,
        "name": "Современные тенденции развития оптоэлектроники",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27360,
        "name": "Современные термоэлектрические материалы",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27688,
        "name": "Современные термоэлектрические материалы /Modern Thermoelectric Materials",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26541,
        "name": "Современные технологии программирования в инфокоммуникационных системах",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26544,
        "name": "Современные энергетические проблемы/The Energy Quest",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26545,
        "name": "Создание Web-приложений",
        "term": 6,
        "course_project": False
    },
    {
        "id": 36969,
        "name": "Создание бизнесов электроники",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26546,
        "name": "Создание и развитие студенческого клуба",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26546,
        "name": "Создание и развитие студенческого клуба",
        "term": 6,
        "course_project": False
    },
    {
        "id": 6829,
        "name": "Создание клиент-серверных приложений",
        "term": 8,
        "course_project": False
    },
    {
        "id": 6824,
        "name": "Создание программного обеспечения инфокоммуникационных систем",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34131,
        "name": "Создание технологического бизнеса",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26551,
        "name": "Солнечная фотовольтаика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 29416,
        "name": "Сорбенты в системах очистки",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32670,
        "name": "Состав и структура пищевого сырья животного и растительного происхождения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 32275,
        "name": "Социально-экономический анализ регионов и отраслей",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32275,
        "name": "Социально-экономический анализ регионов и отраслей",
        "term": 2,
        "course_project": True
    },
    {
        "id": 31079,
        "name": "Социология академического мира",
        "term": 2,
        "course_project": False
    },
    {
        "id": 36129,
        "name": "Спектральные и поляризационные оптические системы",
        "term": 8,
        "course_project": False
    },
    {
        "id": 27301,
        "name": "Специализированные пакеты программ для моделирования процессов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26559,
        "name": "Специальные вопросы прикладной оптики",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26559,
        "name": "Специальные вопросы прикладной оптики",
        "term": 2,
        "course_project": True
    },
    {
        "id": 7082,
        "name": "Специальные вопросы проектирования оптико-электронных приборов и систем",
        "term": 8,
        "course_project": False
    },
    {
        "id": 20843,
        "name": "Специальные вопросы проектирования приборов фотоники",
        "term": 8,
        "course_project": False
    },
    {
        "id": 32932,
        "name": "Специальные главы физики полупроводников",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19073,
        "name": "Специальные методы обработки пищевого сырья",
        "term": 8,
        "course_project": False
    },
    {
        "id": 19073,
        "name": "Специальные методы обработки пищевого сырья",
        "term": 10,
        "course_project": False
    },
    {
        "id": 6727,
        "name": "Специальные оптические элементы",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34651,
        "name": "Специальные разделы линейной алгебры",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30916,
        "name": "Специальные разделы материалов фотоники",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34453,
        "name": "Специальные разделы неорганической химии / Special sections of inorganic chemistry",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26570,
        "name": "Специальные разделы оптического материаловедения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 14454,
        "name": "Специальные разделы теории вероятностей и математической статистики",
        "term": 8,
        "course_project": False
    },
    {
        "id": 955,
        "name": "Специальные разделы теории управления",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26569,
        "name": "Специальные разделы физики",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26569,
        "name": "Специальные разделы физики",
        "term": 4,
        "course_project": False
    },
    {
        "id": 34684,
        "name": "Специальные разделы функционального анализа",
        "term": 4,
        "course_project": False
    },
    {
        "id": 34451,
        "name": "Спинтроника / Spintronics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 29563,
        "name": "Средства Web-программирования",
        "term": 6,
        "course_project": False
    },
    {
        "id": 29599,
        "name": "Средства компьютерного моделирования при разработке изделий",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31400,
        "name": "Средства моделирования предприятия / Enterprise Modelling Applications",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35070,
        "name": "Стандартизация в области информационных технологий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26591,
        "name": "Статистика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26593,
        "name": "Статистическая физика",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26595,
        "name": "Статистические методы в инженерных исследованиях",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26594,
        "name": "Статистические методы контроля и управления",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26594,
        "name": "Статистические методы контроля и управления",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26603,
        "name": "Стохастические динамики сложных многокомпонентных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34863,
        "name": "Стратегии защиты интеллектуальной собственности в секторе Cleantech",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34862,
        "name": "Стратегии защиты интеллектуальной собственности в секторе Foodtech",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34861,
        "name": "Стратегии защиты интеллектуальной собственности в секторе Life Sciences",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34864,
        "name": "Стратегии защиты интеллектуальной собственности на транспорте",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33471,
        "name": "Стратегии конкурентоспособности отраслей",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26609,
        "name": "Стратегический и тактический маркетинг",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26609,
        "name": "Стратегический и тактический маркетинг",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34856,
        "name": "Стратегический маркетинг в креативных индустриях",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34855,
        "name": "Стратегический маркетинг в секторе Cleantech",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34851,
        "name": "Стратегический маркетинг в секторе ИКТ / Strategic Marketing in ICT",
        "term": 2,
        "course_project": False
    },
    {
        "id": 982,
        "name": "Стратегический менеджмент",
        "term": 6,
        "course_project": False
    },
    {
        "id": 32284,
        "name": "Стратегический менеджмент",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32284,
        "name": "Стратегический менеджмент",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26612,
        "name": "Стратегическое управление инновационным развитием",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26619,
        "name": "Стратегическое управление развитием IT-инфраструктуры предприятия",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34933,
        "name": "Стратегия защиты интеллектуальной собственности в сфере Foodtech / IP Strategy in Foodtech",
        "term": 2,
        "course_project": False
    },
    {
        "id": 40370,
        "name": "Структурная биология",
        "term": 2,
        "course_project": False
    },
    {
        "id": 40369,
        "name": "Структурная биология / Structural biology",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34565,
        "name": "Структурные исследования интеллектуальных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34565,
        "name": "Структурные исследования интеллектуальных систем",
        "term": 2,
        "course_project": True
    },
    {
        "id": 991,
        "name": "Схемотехника ЭВМ",
        "term": 8,
        "course_project": False
    },
    {
        "id": 3678,
        "name": "Телекоммуникационные системы и технологии",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26629,
        "name": "Телекоммуникационные системы и технологии",
        "term": 6,
        "course_project": False
    },
    {
        "id": 35530,
        "name": "Тенденции развития безотходных биотехнологий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34348,
        "name": "Тенденции развития сектора Life Sciences",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27266,
        "name": "Теоретическая информатика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26633,
        "name": "Теоретическая механика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31374,
        "name": "Теоретические основы компьютерной графики и вычислительной оптики",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31374,
        "name": "Теоретические основы компьютерной графики и вычислительной оптики",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26667,
        "name": "Теоретические основы навигации",
        "term": 6,
        "course_project": False
    },
    {
        "id": 29645,
        "name": "Теоретические основы низкотемпературной техники",
        "term": 2,
        "course_project": False
    },
    {
        "id": 29645,
        "name": "Теоретические основы низкотемпературной техники",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26829,
        "name": "Теоретические основы разработки новых продуктов питания",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26829,
        "name": "Теоретические основы разработки новых продуктов питания",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26680,
        "name": "Теоретические основы современных технологий беспроводной связи",
        "term": 6,
        "course_project": False
    },
    {
        "id": 5517,
        "name": "Теоретические основы холодильной техники",
        "term": 8,
        "course_project": False
    },
    {
        "id": 19750,
        "name": "Теория автоматизированного электропривода",
        "term": 6,
        "course_project": False
    },
    {
        "id": 30449,
        "name": "Теория автоматизированного электропривода",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26655,
        "name": "Теория автоматического управления",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26655,
        "name": "Теория автоматического управления",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26655,
        "name": "Теория автоматического управления",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26655,
        "name": "Теория автоматического управления",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26655,
        "name": "Теория автоматического управления",
        "term": 6,
        "course_project": True
    },
    {
        "id": 767,
        "name": "Теория автоматов",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26647,
        "name": "Теория вероятностей",
        "term": 4,
        "course_project": False
    },
    {
        "id": 1008,
        "name": "Теория вероятностей и математическая статистика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 1008,
        "name": "Теория вероятностей и математическая статистика",
        "term": 6,
        "course_project": False
    },
    {
        "id": 33190,
        "name": "Теория вероятностей и математическая статистика / Probability Theory and Mathematical Statistics",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26632,
        "name": "Теория вероятности и математическая статистика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26632,
        "name": "Теория вероятности и математическая статистика",
        "term": 6,
        "course_project": False
    },
    {
        "id": 2327,
        "name": "Теория вычислительной сложности",
        "term": 6,
        "course_project": False
    },
    {
        "id": 29527,
        "name": "Теория вычислительной сложности",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26626,
        "name": "Теория и практика применения искусственного холода в технологиях пищевых продуктов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34294,
        "name": "Теория и практика применения искусственного холода в технологиях пищевых продуктов / Theory and practice of the use of artificial cold in food",
        "term": 2,
        "course_project": False
    },
    {
        "id": 18829,
        "name": "Теория и расчет криогенных циклов",
        "term": 8,
        "course_project": False
    },
    {
        "id": 29643,
        "name": "Теория и расчет криогенных циклов",
        "term": 6,
        "course_project": False
    },
    {
        "id": 21578,
        "name": "Теория и системы управления",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26642,
        "name": "Теория и техника теплофизического эксперимента",
        "term": 2,
        "course_project": False
    },
    {
        "id": 3082,
        "name": "Теория игр",
        "term": 8,
        "course_project": False
    },
    {
        "id": 30281,
        "name": "Теория игр",
        "term": 4,
        "course_project": False
    },
    {
        "id": 34568,
        "name": "Теория интеллектуальных систем обработки информации",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26649,
        "name": "Теория информации",
        "term": 6,
        "course_project": False
    },
    {
        "id": 6835,
        "name": "Теория информационной безопасности и методология защиты инфокоммуникаций",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26625,
        "name": "Теория информационной безопасности и методология защиты информации",
        "term": 4,
        "course_project": False
    },
    {
        "id": 1374,
        "name": "Теория информационных процессов и систем",
        "term": 6,
        "course_project": False
    },
    {
        "id": 30158,
        "name": "Теория категорий",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26651,
        "name": "Теория колебаний",
        "term": 6,
        "course_project": False
    },
    {
        "id": 36791,
        "name": "Теория массового обслуживания",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26653,
        "name": "Теория надежности",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26657,
        "name": "Теория надежности программного обеспечения",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31321,
        "name": "Теория операторов и явно решаемые модели",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34733,
        "name": "Теория представлений",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26673,
        "name": "Теория проектирования вычислительных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26673,
        "name": "Теория проектирования вычислительных систем",
        "term": 2,
        "course_project": True
    },
    {
        "id": 27258,
        "name": "Теория проектирования систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26676,
        "name": "Теория решения изобретательских задач",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26654,
        "name": "Теория систем",
        "term": 6,
        "course_project": False
    },
    {
        "id": 13708,
        "name": "Теория систем и системный анализ в оптике",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34019,
        "name": "Теория фазовых переходов",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26644,
        "name": "Теория функции комплексного переменного",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26659,
        "name": "Теория электрической связи",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26684,
        "name": "Тепловые измерения",
        "term": 4,
        "course_project": False
    },
    {
        "id": 7590,
        "name": "Тепловые насосы",
        "term": 10,
        "course_project": False
    },
    {
        "id": 26686,
        "name": "Тепломассообмен",
        "term": 6,
        "course_project": False
    },
    {
        "id": 19712,
        "name": "Теплообменные аппараты компрессорных холодильных машин",
        "term": 8,
        "course_project": False
    },
    {
        "id": 5528,
        "name": "Теплоснабжение предприятий",
        "term": 8,
        "course_project": False
    },
    {
        "id": 31623,
        "name": "Теплофизика проводящих сред",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27418,
        "name": "Теплофизика реологических жидкостей",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31005,
        "name": "Теплофизические методы исследования биологических систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26838,
        "name": "Теплофизические свойства веществ",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26838,
        "name": "Теплофизические свойства веществ",
        "term": 6,
        "course_project": False
    },
    {
        "id": 6046,
        "name": "Термодинамика и теплопередача",
        "term": 8,
        "course_project": False
    },
    {
        "id": 30149,
        "name": "Тестирование ПО",
        "term": 4,
        "course_project": False
    },
    {
        "id": 1836,
        "name": "Тестирование программного обеспечения",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26700,
        "name": "Тестирование программного обеспечения",
        "term": 6,
        "course_project": False
    },
    {
        "id": 27190,
        "name": "Техника низкотемпературного эксперимента",
        "term": 2,
        "course_project": False
    },
    {
        "id": 36029,
        "name": "Техники публичных выступлений и презентаций",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26694,
        "name": "Техники публичных выступлений, переговоров и презентаций. Деловая коммуникация",
        "term": 4,
        "course_project": False
    },
    {
        "id": 4175,
        "name": "Техническая защита информации",
        "term": 8,
        "course_project": False
    },
    {
        "id": 30507,
        "name": "Техническая электродинамика",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26722,
        "name": "Техническое регулирование",
        "term": 2,
        "course_project": False
    },
    {
        "id": 10548,
        "name": "Технологии IP-телефонии",
        "term": 8,
        "course_project": False
    },
    {
        "id": 32345,
        "name": "Технологии альтернативной энергетики",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26742,
        "name": "Технологии больших данных",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26742,
        "name": "Технологии больших данных",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26758,
        "name": "Технологии веб-сервисов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26714,
        "name": "Технологии виртуальной реконструкции архитектурного наследия",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26746,
        "name": "Технологии защиты информации",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26746,
        "name": "Технологии защиты информации",
        "term": 6,
        "course_project": True
    },
    {
        "id": 27413,
        "name": "Технологии и инструменты построения языковых процессов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27413,
        "name": "Технологии и инструменты построения языковых процессов",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26761,
        "name": "Технологии и процессы",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34206,
        "name": "Технологии и процессы пищевых производств / Technology and Processes of Food Production",
        "term": 2,
        "course_project": False
    },
    {
        "id": 1908,
        "name": "Технологии искусственного интеллекта",
        "term": 8,
        "course_project": False
    },
    {
        "id": 30152,
        "name": "Технологии компьютерных сетей",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26774,
        "name": "Технологии машинного обучения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26774,
        "name": "Технологии машинного обучения",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34297,
        "name": "Технологии машинного обучения в задачах развития городских территорий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33138,
        "name": "Технологии машинного обучения/Machine Learning",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33138,
        "name": "Технологии машинного обучения/Machine Learning",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26710,
        "name": "Технологии моделирования и визуализации трехмерных сцен",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26781,
        "name": "Технологии обеспечения информационной безопасности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31125,
        "name": "Технологии оценки эффективности инноваций в складских процессах",
        "term": 2,
        "course_project": False
    },
    {
        "id": 29601,
        "name": "Технологии приборостроения",
        "term": 6,
        "course_project": False
    },
    {
        "id": 803,
        "name": "Технологии программирования",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26762,
        "name": "Технологии программирования",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26762,
        "name": "Технологии программирования",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26762,
        "name": "Технологии программирования",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26762,
        "name": "Технологии программирования",
        "term": 6,
        "course_project": False
    },
    {
        "id": 18711,
        "name": "Технологии программирования (базовый уровень)",
        "term": 6,
        "course_project": False
    },
    {
        "id": 34854,
        "name": "Технологии продакт-менеджмента в Foodtech",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31064,
        "name": "Технологии разработки и защиты баз данных",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31064,
        "name": "Технологии разработки и защиты баз данных",
        "term": 8,
        "course_project": False
    },
    {
        "id": 29193,
        "name": "Технологии разработки информационных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26816,
        "name": "Технологии разработки информационных систем в защищенном исполнении",
        "term": 6,
        "course_project": False
    },
    {
        "id": 30850,
        "name": "Технологии разработки нейроинтерфейсов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 10969,
        "name": "Технологии разработки программного обеспечения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34331,
        "name": "Технологии сбора, обработки и систематизации городских данных",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34331,
        "name": "Технологии сбора, обработки и систематизации городских данных",
        "term": 2,
        "course_project": True
    },
    {
        "id": 27268,
        "name": "Технологии смешанной реальности для использования в системах поддержки принятия решений и обучении",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32326,
        "name": "Технологии фотовольтаических систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26804,
        "name": "Технологии функциональных и специализированных продуктов питания",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26750,
        "name": "Технологические инновации в производстве",
        "term": 4,
        "course_project": False
    },
    {
        "id": 33226,
        "name": "Технологические инновации в производстве / Technological Innovations in Manufacturing",
        "term": 4,
        "course_project": False
    },
    {
        "id": 34917,
        "name": "Технологические инновации в секторе ИКТ / Technology Innovation in ICT",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26813,
        "name": "Технологические процессы производства экологически безопасных продуктов питания",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26813,
        "name": "Технологические процессы производства экологически безопасных продуктов питания",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26777,
        "name": "Технологические расчеты в мясных технологиях",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26778,
        "name": "Технологические расчеты в рыбных технологиях",
        "term": 6,
        "course_project": False
    },
    {
        "id": 32310,
        "name": "Технологические тренды в ИКТ-секторе",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32315,
        "name": "Технологические тренды в креативных индустриях",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32316,
        "name": "Технологические тренды в печатной электронике",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32314,
        "name": "Технологические тренды развития транспорта",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26765,
        "name": "Технологические экосистемы",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26764,
        "name": "Технологический форсайт",
        "term": 4,
        "course_project": False
    },
    {
        "id": 13674,
        "name": "Технологическое брокерство и трансфер технологий",
        "term": 8,
        "course_project": False
    },
    {
        "id": 9889,
        "name": "Технологическое оборудование биотехнологических производств",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34417,
        "name": "Технология OpenStack. Основы программирования и конфигурирования",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34424,
        "name": "Технология OpenStack. Основы программирования и конфигурирования / OpenStack technology. Programming and configuring",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26748,
        "name": "Технология и методы программирования",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26748,
        "name": "Технология и методы программирования",
        "term": 6,
        "course_project": True
    },
    {
        "id": 19126,
        "name": "Технология и организация производства хлеба, кондитерских и макаронных изделий",
        "term": 8,
        "course_project": False
    },
    {
        "id": 19111,
        "name": "Технология крепких алкогольных напитков",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26729,
        "name": "Технология крепких алкогольных напитков",
        "term": 6,
        "course_project": False
    },
    {
        "id": 806,
        "name": "Технология обработки материалов",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26736,
        "name": "Технология обработки материалов при изготовлении приборов",
        "term": 6,
        "course_project": False
    },
    {
        "id": 28255,
        "name": "Технология переработки масличного сырья / Technology for Processing Oilseed Raw Materials",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19107,
        "name": "Технология пива",
        "term": 8,
        "course_project": False
    },
    {
        "id": 30943,
        "name": "Технология полупроводников",
        "term": 2,
        "course_project": False
    },
    {
        "id": 9854,
        "name": "Технология продуктов детского питания на молочной основе",
        "term": 8,
        "course_project": False
    },
    {
        "id": 9854,
        "name": "Технология продуктов детского питания на молочной основе",
        "term": 10,
        "course_project": False
    },
    {
        "id": 28261,
        "name": "Технология производства растительных масел и белков / Technology of Vegetable Oils and Proteins Production",
        "term": 2,
        "course_project": False
    },
    {
        "id": 6864,
        "name": "Технология производства электронных средств",
        "term": 6,
        "course_project": False
    },
    {
        "id": 36961,
        "name": "Технология разработки и защиты баз данных",
        "term": 6,
        "course_project": False
    },
    {
        "id": 786,
        "name": "Технология разработки программного обеспечения",
        "term": 6,
        "course_project": False
    },
    {
        "id": 1192,
        "name": "Технология сертификации средств защиты информации",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26768,
        "name": "Технология солода",
        "term": 6,
        "course_project": False
    },
    {
        "id": 9753,
        "name": "Технология теплового консервирования пищевых продуктов",
        "term": 10,
        "course_project": False
    },
    {
        "id": 13532,
        "name": "Технология управления проектом",
        "term": 8,
        "course_project": False
    },
    {
        "id": 7807,
        "name": "Технология хлеба",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26770,
        "name": "Технология хлеба",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26707,
        "name": "Технохимический контроль хлебопекарного и кондитерского производств",
        "term": 6,
        "course_project": False
    },
    {
        "id": 818,
        "name": "Типовые конструкции оптических приборов",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26823,
        "name": "Типографика и вёрстка",
        "term": 6,
        "course_project": False
    },
    {
        "id": 28154,
        "name": "Типы в языках программирования",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26827,
        "name": "Товарные знаки и знаки обслуживания",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26835,
        "name": "Трёхмерное моделирование и анимация компьютерных персонажей",
        "term": 2,
        "course_project": False
    },
    {
        "id": 18830,
        "name": "Транспортирование и хранение криогенных жидкостей",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26830,
        "name": "Транспортная инфраструктура",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19182,
        "name": "Трансфер инновационных продуктов",
        "term": 10,
        "course_project": False
    },
    {
        "id": 32313,
        "name": "Тренды и бизнес-модели на рынке Foodtech",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34320,
        "name": "Тренды цифровой трансформации",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33185,
        "name": "Трудоустройство и карьерный рост / College Career Development and Employment Guidance",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26842,
        "name": "Умные материалы/ Smart Materials",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26842,
        "name": "Умные материалы/ Smart Materials",
        "term": 4,
        "course_project": False
    },
    {
        "id": 19269,
        "name": "Упаковка пищевых производств",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34208,
        "name": "Упаковочные материалы /Food Packaging Materials",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26856,
        "name": "Управление брендами",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26855,
        "name": "Управление высокотехнологичным предприятием",
        "term": 6,
        "course_project": False
    },
    {
        "id": 34207,
        "name": "Управление и автоматизация процессами пищевых производств/Automation and Control of Food Production Processes",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26859,
        "name": "Управление инвестициями",
        "term": 4,
        "course_project": False
    },
    {
        "id": 13867,
        "name": "Управление инновационной деятельностью",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26868,
        "name": "Управление инновационными проектами",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26867,
        "name": "Управление инновациями",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26851,
        "name": "Управление информацией и хранением данных",
        "term": 6,
        "course_project": False
    },
    {
        "id": 3075,
        "name": "Управление информационной безопасностью",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26873,
        "name": "Управление информационной безопасностью",
        "term": 2,
        "course_project": False
    },
    {
        "id": 36032,
        "name": "Управление карьерой",
        "term": 2,
        "course_project": False
    },
    {
        "id": 36032,
        "name": "Управление карьерой",
        "term": 6,
        "course_project": False
    },
    {
        "id": 836,
        "name": "Управление качеством",
        "term": 10,
        "course_project": False
    },
    {
        "id": 31517,
        "name": "Управление качеством пищевой продукции",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26853,
        "name": "Управление качеством разработки ПО",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27414,
        "name": "Управление качеством разработки программного обеспечения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26845,
        "name": "Управление качеством электронного изделия в интегрированной информационной среде",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19498,
        "name": "Управление конкурентоспособностью малого бизнеса",
        "term": 10,
        "course_project": False
    },
    {
        "id": 6197,
        "name": "Управление конкурентоспособностью предприятия",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26901,
        "name": "Управление конфигурацией электронного изделия при сквозном проектировании в интегрированной информационной среде",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26901,
        "name": "Управление конфигурацией электронного изделия при сквозном проектировании в интегрированной информационной среде",
        "term": 2,
        "course_project": True
    },
    {
        "id": 9645,
        "name": "Управление логистическими издержками",
        "term": 8,
        "course_project": False
    },
    {
        "id": 9645,
        "name": "Управление логистическими издержками",
        "term": 10,
        "course_project": False
    },
    {
        "id": 21699,
        "name": "Управление наукоемким производством",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34593,
        "name": "Управление непрерывными и дискретными процессами/\nContinuous and discrete process control",
        "term": 2,
        "course_project": False
    },
    {
        "id": 20550,
        "name": "Управление объектами биотехнологической промышленности",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26860,
        "name": "Управление персоналом",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26860,
        "name": "Управление персоналом",
        "term": 2,
        "course_project": True
    },
    {
        "id": 31608,
        "name": "Управление персоналом / Human Resources Management",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31608,
        "name": "Управление персоналом / Human Resources Management",
        "term": 2,
        "course_project": True
    },
    {
        "id": 2786,
        "name": "Управление персоналом в таможенных органах",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26878,
        "name": "Управление предприятием",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31575,
        "name": "Управление приводами / Actuators Control",
        "term": 2,
        "course_project": False
    },
    {
        "id": 7054,
        "name": "Управление программными проектами",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26862,
        "name": "Управление проектами",
        "term": 4,
        "course_project": False
    },
    {
        "id": 31407,
        "name": "Управление проектами в области информационных систем / Information Systems Project Management",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28709,
        "name": "Управление проектной деятельностью",
        "term": 2,
        "course_project": False
    },
    {
        "id": 28709,
        "name": "Управление проектной деятельностью",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26886,
        "name": "Управление развитием государственных информационных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 9681,
        "name": "Управление рисками в малом бизнесе",
        "term": 10,
        "course_project": False
    },
    {
        "id": 26887,
        "name": "Управление рисками информационной безопасности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26887,
        "name": "Управление рисками информационной безопасности",
        "term": 2,
        "course_project": True
    },
    {
        "id": 29283,
        "name": "Управление рисками информационной безопасности / Information Security Risk Management",
        "term": 2,
        "course_project": False
    },
    {
        "id": 29283,
        "name": "Управление рисками информационной безопасности / Information Security Risk Management",
        "term": 2,
        "course_project": True
    },
    {
        "id": 26910,
        "name": "Управление созданием и защитой интеллектуальной собственности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 13922,
        "name": "Управление таможенными органами",
        "term": 8,
        "course_project": False
    },
    {
        "id": 32362,
        "name": "Управление транспортом и цепями поставок на основе мультиагентных систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26863,
        "name": "Управление требованиями",
        "term": 4,
        "course_project": False
    },
    {
        "id": 18755,
        "name": "Управление требованиями к программному обеспечению",
        "term": 8,
        "course_project": False
    },
    {
        "id": 29809,
        "name": "Управление устойчивым развитием городов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 29809,
        "name": "Управление устойчивым развитием городов",
        "term": 2,
        "course_project": True
    },
    {
        "id": 30456,
        "name": "Управление электромеханическими системами",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26847,
        "name": "Управление, организация и планирование комплексов систем производства и транспортирования углеводородных энергоносителей",
        "term": 6,
        "course_project": False
    },
    {
        "id": 1180,
        "name": "Уравнения математической физики",
        "term": 6,
        "course_project": False
    },
    {
        "id": 30503,
        "name": "Уравнения математической физики",
        "term": 4,
        "course_project": False
    },
    {
        "id": 18812,
        "name": "Установки и тепломассообменные аппараты систем жизнеобеспечения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 21532,
        "name": "Устройство и эксплуатация МАС",
        "term": 8,
        "course_project": False
    },
    {
        "id": 31120,
        "name": "Устройство систем здравоохранения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 35770,
        "name": "Учебная практика (осуществление интеграции программных модулей)",
        "term": 4,
        "course_project": False
    },
    {
        "id": 35769,
        "name": "Учебная практика (разработка модулей программного обеспечения для компьютерных систем)",
        "term": 6,
        "course_project": False
    },
    {
        "id": 35769,
        "name": "Учебная практика (разработка модулей программного обеспечения для компьютерных систем)",
        "term": 8,
        "course_project": False
    },
    {
        "id": 35772,
        "name": "Учебная практика (разработка, администрирование и защита баз данных)",
        "term": 6,
        "course_project": False
    },
    {
        "id": 35771,
        "name": "Учебная практика (сопровождение и обслуживание программного обеспечения компьютерных систем)",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29573,
        "name": "Учебная практика, ознакомительная",
        "term": 4,
        "course_project": False
    },
    {
        "id": 23788,
        "name": "Учебная практика, по получению первичных профессиональных умений и навыков",
        "term": 6,
        "course_project": False
    },
    {
        "id": 29574,
        "name": "Учебная, научно-исследовательская работа (получение первичных навыков научно-исследовательской работы)",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29569,
        "name": "Учебная, ознакомительная",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29569,
        "name": "Учебная, ознакомительная",
        "term": 6,
        "course_project": False
    },
    {
        "id": 829,
        "name": "Учебно-исследовательская работа студента",
        "term": 8,
        "course_project": False
    },
    {
        "id": 27833,
        "name": "Учебно-исследовательская работа студента (междисциплинарный проект)",
        "term": 8,
        "course_project": False
    },
    {
        "id": 19095,
        "name": "Учет в молочной промышленности",
        "term": 8,
        "course_project": False
    },
    {
        "id": 19095,
        "name": "Учет в молочной промышленности",
        "term": 10,
        "course_project": False
    },
    {
        "id": 26917,
        "name": "Фемтосекундная оптика и фемтотехнологии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30873,
        "name": "Фемтосекундная оптика и фемтотехнологии/Femtosecond optics and femtotechnology",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26918,
        "name": "Фемтотехнологии инженерной фотоники",
        "term": 6,
        "course_project": False
    },
    {
        "id": 35293,
        "name": "Ферменты и БАВ",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26924,
        "name": "Физика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26924,
        "name": "Физика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 33193,
        "name": "Физика / College Physics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 9535,
        "name": "Физика взаимодействия интенсивного излучения с веществом",
        "term": 8,
        "course_project": False
    },
    {
        "id": 18996,
        "name": "Физика и техника лазерного эксперимента",
        "term": 8,
        "course_project": False
    },
    {
        "id": 32324,
        "name": "Физика конденсированных сред",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32324,
        "name": "Физика конденсированных сред",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34020,
        "name": "Физика лазеров",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26930,
        "name": "Физика магнитных наносистем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26925,
        "name": "Физика наноструктур",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26925,
        "name": "Физика наноструктур",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26926,
        "name": "Физика низких температур",
        "term": 4,
        "course_project": False
    },
    {
        "id": 7285,
        "name": "Физика оптоэлектронных приборов и устройств",
        "term": 8,
        "course_project": False
    },
    {
        "id": 31531,
        "name": "Физика полупроводников / Semiconductor Physics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26934,
        "name": "Физика полупроводниковых наноструктур",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27417,
        "name": "Физика реального газа и жидкости",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33494,
        "name": "Физика с элементами компьютерного моделирования",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34736,
        "name": "Физика твердого тела. Часть 1",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26983,
        "name": "Физико-химические методы исследования коллоидных систем",
        "term": 6,
        "course_project": False
    },
    {
        "id": 28249,
        "name": "Физиология питания / Physiology of Nutrition",
        "term": 2,
        "course_project": False
    },
    {
        "id": 862,
        "name": "Физическая культура",
        "term": 4,
        "course_project": False
    },
    {
        "id": 862,
        "name": "Физическая культура",
        "term": 6,
        "course_project": False
    },
    {
        "id": 862,
        "name": "Физическая культура",
        "term": 8,
        "course_project": False
    },
    {
        "id": 862,
        "name": "Физическая культура",
        "term": 10,
        "course_project": False
    },
    {
        "id": 26938,
        "name": "Физическая культура",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33221,
        "name": "Физическая культура (Элективная дисциплина)/ Physical Education (Elective discipline)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33221,
        "name": "Физическая культура (Элективная дисциплина)/ Physical Education (Elective discipline)",
        "term": 4,
        "course_project": False
    },
    {
        "id": 17629,
        "name": "Физическая культура (элективная дисциплина)",
        "term": 6,
        "course_project": False
    },
    {
        "id": 29572,
        "name": "Физическая культура (элективная дисциплина)",
        "term": 2,
        "course_project": False
    },
    {
        "id": 29572,
        "name": "Физическая культура (элективная дисциплина)",
        "term": 4,
        "course_project": False
    },
    {
        "id": 29572,
        "name": "Физическая культура (элективная дисциплина)",
        "term": 6,
        "course_project": False
    },
    {
        "id": 33171,
        "name": "Физическая культура / Physical Education",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33171,
        "name": "Физическая культура / Physical Education",
        "term": 4,
        "course_project": False
    },
    {
        "id": 26940,
        "name": "Физическая химия",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26951,
        "name": "Физическая химия наноструктур",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34636,
        "name": "Физическая химия наноструктур / Physical Chemistry of Nanostructures",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26948,
        "name": "Физические механизмы функционирования гибридных наноструктур",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34635,
        "name": "Физические механизмы функционирования гибридных наноструктур / Physical Mechanisms of Functioning of Hybrid Nanostructures",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31050,
        "name": "Физические основы интроскопии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 867,
        "name": "Философия",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26953,
        "name": "Философия",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26953,
        "name": "Философия",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26955,
        "name": "Финансовая кибербезопасность",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26955,
        "name": "Финансовая кибербезопасность",
        "term": 2,
        "course_project": True
    },
    {
        "id": 40449,
        "name": "Финансовая математика",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19430,
        "name": "Финансовое обеспечение проекта",
        "term": 10,
        "course_project": False
    },
    {
        "id": 26956,
        "name": "Финансовые кибертехнологии",
        "term": 2,
        "course_project": False
    },
    {
        "id": 21710,
        "name": "Финансовый аудит инновационной деятельности",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34908,
        "name": "Финансовый менеджмент",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26961,
        "name": "Финансовый учет и налогообложение",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26961,
        "name": "Финансовый учет и налогообложение",
        "term": 6,
        "course_project": True
    },
    {
        "id": 31086,
        "name": "Финансовый, управленческий учет и управление рисками",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31086,
        "name": "Финансовый, управленческий учет и управление рисками",
        "term": 2,
        "course_project": True
    },
    {
        "id": 2599,
        "name": "Финансы и бухгалтерский учет",
        "term": 8,
        "course_project": False
    },
    {
        "id": 28151,
        "name": "Формальные языки",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26962,
        "name": "Формальные языки и грамматики",
        "term": 6,
        "course_project": False
    },
    {
        "id": 19431,
        "name": "Формирование портфеля инвестиций",
        "term": 10,
        "course_project": False
    },
    {
        "id": 5647,
        "name": "Формирование портфеля инвестиций на предприятии",
        "term": 10,
        "course_project": False
    },
    {
        "id": 21703,
        "name": "Форсайт-технологии в прогнозировании инновационного развития",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26968,
        "name": "Фотографические технологии",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26970,
        "name": "Фотоника поверхности",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31558,
        "name": "Фотоника поверхности / Surface photonics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34598,
        "name": "Фоточувствительные материалы для записи оптической информации",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31559,
        "name": "Фоточувствительные материалы для записи оптической информации / Photosensitive materials for recording optical information",
        "term": 2,
        "course_project": False
    },
    {
        "id": 878,
        "name": "Функциональная схемотехника",
        "term": 6,
        "course_project": False
    },
    {
        "id": 30292,
        "name": "Функциональная схемотехника",
        "term": 6,
        "course_project": False
    },
    {
        "id": 1361,
        "name": "Функциональное программирование",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26974,
        "name": "Функциональное программирование",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31527,
        "name": "Функциональные продукты питания на белковой основе",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34442,
        "name": "Функциональные свойства пищевых добавок из белоксодержащего сырья",
        "term": 2,
        "course_project": False
    },
    {
        "id": 1134,
        "name": "Функциональный анализ",
        "term": 6,
        "course_project": False
    },
    {
        "id": 1134,
        "name": "Функциональный анализ",
        "term": 8,
        "course_project": False
    },
    {
        "id": 5656,
        "name": "Химия биологически активных веществ",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26985,
        "name": "Химия и физика молока и молочных продуктов",
        "term": 6,
        "course_project": False
    },
    {
        "id": 26987,
        "name": "Химия и физика пищевых белков",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19007,
        "name": "Химия наноструктур",
        "term": 8,
        "course_project": False
    },
    {
        "id": 9760,
        "name": "Хладоснабжение предприятий",
        "term": 8,
        "course_project": False
    },
    {
        "id": 19287,
        "name": "Холодильное оборудование пищевых предприятий",
        "term": 10,
        "course_project": False
    },
    {
        "id": 19285,
        "name": "Холодильное оборудование предприятий биотехнологий",
        "term": 10,
        "course_project": False
    },
    {
        "id": 30954,
        "name": "Холодоснабжение в системах жизнеобеспечения",
        "term": 2,
        "course_project": False
    },
    {
        "id": 9752,
        "name": "Холодоснабжение систем жизнеобеспечения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 26998,
        "name": "Хранение и обработка данных",
        "term": 2,
        "course_project": False
    },
    {
        "id": 26998,
        "name": "Хранение и обработка данных",
        "term": 6,
        "course_project": False
    },
    {
        "id": 27001,
        "name": "Хранилища и базы данных",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27001,
        "name": "Хранилища и базы данных",
        "term": 2,
        "course_project": True
    },
    {
        "id": 34350,
        "name": "Цели устойчивого развития в энергетике и ресурсосбережении",
        "term": 2,
        "course_project": False
    },
    {
        "id": 6785,
        "name": "Цифровая голография",
        "term": 8,
        "course_project": False
    },
    {
        "id": 27005,
        "name": "Цифровая обработка речевых сигналов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27005,
        "name": "Цифровая обработка речевых сигналов",
        "term": 2,
        "course_project": True
    },
    {
        "id": 3152,
        "name": "Цифровая обработка сигналов",
        "term": 6,
        "course_project": False
    },
    {
        "id": 3722,
        "name": "Цифровая схемотехника",
        "term": 8,
        "course_project": False
    },
    {
        "id": 27011,
        "name": "Цифровая техника систем управления",
        "term": 2,
        "course_project": False
    },
    {
        "id": 34920,
        "name": "Цифровая трансформация высокотехнологичных производств",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27008,
        "name": "Цифровая экономика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 27004,
        "name": "Цифровые методы обработки информации в измерительных и управляющих оптико-цифровых системах",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27012,
        "name": "Цифровые методы обработки информации при контроле и испытаниях оптико-цифровых систем",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27010,
        "name": "Цифровые системы управления",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31590,
        "name": "Цифровые системы управления / Digital Control Systems",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31149,
        "name": "Цифровые технологии в здравоохранении",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31146,
        "name": "Цифровые технологии в креативных индустриях",
        "term": 2,
        "course_project": False
    },
    {
        "id": 670,
        "name": "Численные методы",
        "term": 6,
        "course_project": False
    },
    {
        "id": 670,
        "name": "Численные методы",
        "term": 8,
        "course_project": False
    },
    {
        "id": 27017,
        "name": "Численные методы",
        "term": 4,
        "course_project": False
    },
    {
        "id": 36949,
        "name": "Численные методы I",
        "term": 4,
        "course_project": False
    },
    {
        "id": 27019,
        "name": "Численные методы в оптике",
        "term": 6,
        "course_project": False
    },
    {
        "id": 27024,
        "name": "Численные методы в оптике и фотонике/ Numerical Methods in Optics and Photonics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 32930,
        "name": "Численные методы в физике полупроводников",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27023,
        "name": "Численные методы в электродинамике/ Numerical Methods in Electrodynamics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27016,
        "name": "Численные методы фотоники",
        "term": 4,
        "course_project": False
    },
    {
        "id": 9026,
        "name": "Экологические аспекты возобновляемых источников энергии",
        "term": 8,
        "course_project": False
    },
    {
        "id": 35829,
        "name": "Экологические аспекты питания и здоровья человека",
        "term": 2,
        "course_project": False
    },
    {
        "id": 1497,
        "name": "Экологический менеджмент",
        "term": 8,
        "course_project": False
    },
    {
        "id": 27037,
        "name": "Экологическое нормирование",
        "term": 6,
        "course_project": False
    },
    {
        "id": 27037,
        "name": "Экологическое нормирование",
        "term": 6,
        "course_project": True
    },
    {
        "id": 678,
        "name": "Экология",
        "term": 8,
        "course_project": False
    },
    {
        "id": 27035,
        "name": "Экология",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27035,
        "name": "Экология",
        "term": 4,
        "course_project": False
    },
    {
        "id": 34360,
        "name": "Экономика бизнеса в ИКТ-секторе / Business Economics in ICT",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30404,
        "name": "Экономика и управление бизнес организацией",
        "term": 6,
        "course_project": False
    },
    {
        "id": 5709,
        "name": "Экономика отрасли",
        "term": 6,
        "course_project": False
    },
    {
        "id": 5709,
        "name": "Экономика отрасли",
        "term": 6,
        "course_project": True
    },
    {
        "id": 5709,
        "name": "Экономика отрасли",
        "term": 8,
        "course_project": False
    },
    {
        "id": 5709,
        "name": "Экономика отрасли",
        "term": 8,
        "course_project": True
    },
    {
        "id": 32366,
        "name": "Экономика предприятий в креативных индустриях",
        "term": 2,
        "course_project": False
    },
    {
        "id": 6949,
        "name": "Экономика программной инженерии",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34896,
        "name": "Экономическая модель в Foodtech бизнесе",
        "term": 2,
        "course_project": False
    },
    {
        "id": 680,
        "name": "Экономическая оценка инвестиций",
        "term": 6,
        "course_project": False
    },
    {
        "id": 18469,
        "name": "Экспериментальная оптика",
        "term": 8,
        "course_project": False
    },
    {
        "id": 693,
        "name": "Экспериментальные методы исследования",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34435,
        "name": "Экспериментальные методы определения реологических свойств продуктов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27026,
        "name": "Экспериментальные методы фабрикации в нанофотонике/ Experimental fabrication methods in nanophotonics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 33194,
        "name": "Эксперименты по физике / Experiments in college physics",
        "term": 2,
        "course_project": False
    },
    {
        "id": 19096,
        "name": "Экспертиза продуктов питания",
        "term": 8,
        "course_project": False
    },
    {
        "id": 19096,
        "name": "Экспертиза продуктов питания",
        "term": 10,
        "course_project": False
    },
    {
        "id": 7084,
        "name": "Эксплуатация оптико-электронных информационно-измерительных приборов и систем",
        "term": 6,
        "course_project": False
    },
    {
        "id": 7075,
        "name": "Эксплуатация систем специального назначения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 7075,
        "name": "Эксплуатация систем специального назначения",
        "term": 10,
        "course_project": False
    },
    {
        "id": 8217,
        "name": "Эксплуатация холодильных установок",
        "term": 10,
        "course_project": False
    },
    {
        "id": 720,
        "name": "Электрические машины",
        "term": 8,
        "course_project": False
    },
    {
        "id": 27289,
        "name": "Электрические машины устройств автоматики",
        "term": 2,
        "course_project": False
    },
    {
        "id": 1189,
        "name": "Электрический привод",
        "term": 6,
        "course_project": False
    },
    {
        "id": 29638,
        "name": "Электрический привод",
        "term": 6,
        "course_project": False
    },
    {
        "id": 29638,
        "name": "Электрический привод",
        "term": 6,
        "course_project": True
    },
    {
        "id": 28389,
        "name": "Электродинамика",
        "term": 4,
        "course_project": False
    },
    {
        "id": 27070,
        "name": "Электродинамика метаматериалов",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27065,
        "name": "Электродинамика метаматериалов/ Electrodynamics of Metamaterials",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27065,
        "name": "Электродинамика метаматериалов/ Electrodynamics of Metamaterials",
        "term": 2,
        "course_project": True
    },
    {
        "id": 27066,
        "name": "Электроника и микропроцессорная техника",
        "term": 6,
        "course_project": False
    },
    {
        "id": 27074,
        "name": "Электроника и схемотехника",
        "term": 6,
        "course_project": False
    },
    {
        "id": 3276,
        "name": "Электронная коммерция",
        "term": 8,
        "course_project": False
    },
    {
        "id": 7068,
        "name": "Электронные и оптико-электронные приборы специального назначения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 34751,
        "name": "Электронные приборы",
        "term": 6,
        "course_project": False
    },
    {
        "id": 27085,
        "name": "Электронные устройства мехатронных и робототехнических систем",
        "term": 6,
        "course_project": False
    },
    {
        "id": 27079,
        "name": "Электронные устройства систем управления",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27079,
        "name": "Электронные устройства систем управления",
        "term": 6,
        "course_project": False
    },
    {
        "id": 27071,
        "name": "Электронный документооборот",
        "term": 6,
        "course_project": False
    },
    {
        "id": 27077,
        "name": "Электротехника",
        "term": 4,
        "course_project": False
    },
    {
        "id": 27078,
        "name": "Электротехника и электроника",
        "term": 4,
        "course_project": False
    },
    {
        "id": 27083,
        "name": "Электроэлементы и передача данных в компьютерных системах",
        "term": 6,
        "course_project": False
    },
    {
        "id": 1978,
        "name": "Элементы высшей математики",
        "term": 4,
        "course_project": False
    },
    {
        "id": 1978,
        "name": "Элементы высшей математики",
        "term": 6,
        "course_project": False
    },
    {
        "id": 31036,
        "name": "Элементы робототехники",
        "term": 2,
        "course_project": False
    },
    {
        "id": 1313,
        "name": "Элементы систем автоматики",
        "term": 8,
        "course_project": False
    },
    {
        "id": 27081,
        "name": "Элементы теории автоматического управления",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31536,
        "name": "Элементы теории твердого тела и кристаллографии / Solid State Theory and Crystallography",
        "term": 2,
        "course_project": False
    },
    {
        "id": 6926,
        "name": "Энергоаудит и энергосбережение",
        "term": 8,
        "course_project": False
    },
    {
        "id": 18818,
        "name": "Энергосберегающие технологии в системах жизнеобеспечения",
        "term": 8,
        "course_project": False
    },
    {
        "id": 30932,
        "name": "Энергосберегающие технологии в электроэнергетике и автоматизации",
        "term": 2,
        "course_project": False
    },
    {
        "id": 30957,
        "name": "Энергосбережение в системах жизнеобеспечения",
        "term": 4,
        "course_project": False
    },
    {
        "id": 27091,
        "name": "Энергоснабжение предприятий отрасли",
        "term": 6,
        "course_project": False
    },
    {
        "id": 18679,
        "name": "Эргономика и промышленный дизайн",
        "term": 8,
        "course_project": False
    },
    {
        "id": 27097,
        "name": "Этика науки и технологий",
        "term": 2,
        "course_project": False
    },
    {
        "id": 31065,
        "name": "Этика науки и технологий / Ethics in Science and Technology",
        "term": 2,
        "course_project": False
    },
    {
        "id": 36031,
        "name": "Эффективное участие в научных и практических конференциях",
        "term": 2,
        "course_project": False
    },
    {
        "id": 36031,
        "name": "Эффективное участие в научных и практических конференциях",
        "term": 6,
        "course_project": False
    },
    {
        "id": 1366,
        "name": "Явнорешаемые математические модели",
        "term": 8,
        "course_project": False
    },
    {
        "id": 27129,
        "name": "Язык программирования C++",
        "term": 2,
        "course_project": False
    },
    {
        "id": 27834,
        "name": "искусство и естественные науки: теория, эстетика, дискурсы / Art and Natural Sciences: Theory, Aesthetics, Discourses",
        "term": 2,
        "course_project": False
    }
]