export const steps = [
    'Образовательная программа',
    'Аннотация',
    'Области профессиональной деятельности',
    'Объекты профессиональной деятельности',

    // 'Ключевые компетенции',
    // 'Надпрофессиональные компетенции',
    // 'Общепрофессиональные компетенции',

    'Профессиональные компетенции (на основе профессиональных стандартов)',
    'Профессиональные компетенции (на основе форсайтов)',
    'Профессиональные компетенции майнора',
    'Необходимый преподавательский состав',
    'Ответственные лица',
];